<!DOCTYPE html>
<html lang="en">
  <head>
    <meta charset="utf-8">
    <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=5, minimum-scale=1">
    <meta name="msvalidate.01" content="B5163518CBE4A854B63801277FE5E35C" />
    <meta name="google-site-verification" content="ucqagxjVuq0lJZeLKs0F5AppzK111lNt3IoxU6mzlJE" />
    <meta name="robots" content="index, follow" />
    <meta name="googlebot" content="index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1" />
    <meta name="bingbot" content="index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1" />

    <meta property="og:locale" content="en_US" />
    <meta property="og:type" content="article" />

<script>(function(w,d,s,l,i){w[l]=w[l]||[];w[l].push({'gtm.start':new Date().getTime(),event:'gtm.js'});var f=d.getElementsByTagName(s)[0],j=d.createElement(s),dl=l!='dataLayer'?'&l='+l:'';j.async=true;j.src='https://www.googletagmanager.com/gtm.js?id='+i+dl;f.parentNode.insertBefore(j,f);})(window,document,'script','dataLayer','GTM-WK23PSS');</script>
<!-- Hotjar Tracking Code for staging -->
<script>
    (function(h,o,t,j,a,r){
        h.hj=h.hj||function(){(h.hj.q=h.hj.q||[]).push(arguments)};
        h._hjSettings={hjid:3587741,hjsv:6};
        a=o.getElementsByTagName('head')[0];
        r=o.createElement('script');r.async=1;
        r.src=t+h._hjSettings.hjid+j+h._hjSettings.hjsv;
        a.appendChild(r);
    })(window,document,'https://static.hotjar.com/c/hotjar-','.js?sv=');
</script>
<!-- End Hotjar Tracking code -->
    <title>Planner hints and the USING keyword - Cypher Manual</title>
    <link rel="prev" href="../advanced-example/">
    <link rel="next" href="../../execution-plans/">
      <meta name="description" content="A planner hint is used to influence the decisions of the planner when building an execution plan for a query.">
<link rel="stylesheet" href="https://neo4j.com/wp-content/themes/neo4jweb/assets/neo4j-react-modules-assets/search-preact/chunkless/bundle.css" />
<link rel="stylesheet" href="https://neo4j.com/wp-content/themes/neo4jweb/assets/neo4j-react-modules-assets/search-preact/chunkless/utilities.min.css" />

    <link rel="preload" href="../../../../assets/fonts/fontawesome-webfont.woff2?v=4.7.0" as="font">
    <link rel="stylesheet" href="../../../../assets/css/site.css">
    <link href="https://fonts.googleapis.com/css2?family=Nunito+Sans:wght@300;400;600;700&display=swap" rel="stylesheet">

    <link rel="shortcut icon" href="https://neo4j.com/wp-content/themes/neo4jweb/favicon.ico" />



    <meta property="neo:type" content="Docs">
    <meta property="neo:site" content="Reference Docs">


    <meta property="og:site_name" content="Neo4j Graph Data Platform" />
    <meta property="article:publisher" content="https://www.facebook.com/neo4j.graph.database" />
    <meta name="twitter:card" content="summary_large_image" />
    <meta name="twitter:creator" content="@neo4j" />
    <meta name="twitter:site" content="@neo4j" />
    <meta property="og:type" content="article" />
    <meta property="og:title" content="Planner hints and the USING keyword - Cypher Manual" />
    <meta property="og:locale" content="en_US" />
    <meta property="og:image" content="https://dist.neo4j.com/wp-content/uploads/20210423062553/neo4j-social-share-21.png" />
    <meta property="og:description" content="A planner hint is used to influence the decisions of the planner when building an execution plan for a query." />
    <meta property="og:url" content="https://neo4j.com/docs/cypher-manual/5/query-tuning/using/" />
    <link rel="shortcut icon" href="https://neo4j.com/wp-content/themes/neo4jweb/favicon.ico" />
  </head>
  <body class="article docs">
<!-- Google Tag Manager (noscript) -->
<noscript><iframe src="https://www.googletagmanager.com/ns.html?id=GTM-WK23PSS"
height="0" width="0" style="display:none;visibility:hidden"></iframe></noscript>
<!-- End Google Tag Manager (noscript) -->
<script>(function(f,b){if(!b.__SV){var e,g,i,h;window.mixpanel=b;b._i=[];b.init=function(e,f,c){function g(a,d){var b=d.split(".");2==b.length&&(a=a[b[0]],d=b[1]);a[d]=function(){a.push([d].concat(Array.prototype.slice.call(arguments,0)))}}var a=b;"undefined"!==typeof c?a=b[c]=[]:c="mixpanel";a.people=a.people||[];a.toString=function(a){var d="mixpanel";"mixpanel"!==c&&(d+="."+c);a||(d+=" (stub)");return d};a.people.toString=function(){return a.toString(1)+".people (stub)"};i="disable time_event track track_pageview track_links track_forms track_with_groups add_group set_group remove_group register register_once alias unregister identify name_tag set_config reset opt_in_tracking opt_out_tracking has_opted_in_tracking has_opted_out_tracking clear_opt_in_out_tracking start_batch_senders people.set people.set_once people.unset people.increment people.append people.union people.track_charge people.clear_charges people.delete_user people.remove".split(" ");
for(h=0;h<i.length;h++)g(a,i[h]);var j="set set_once union unset remove delete".split(" ");a.get_group=function(){function b(c){d[c]=function(){call2_args=arguments;call2=[c].concat(Array.prototype.slice.call(call2_args,0));a.push([e,call2])}}for(var d={},e=["get_group"].concat(Array.prototype.slice.call(arguments,0)),c=0;c<j.length;c++)b(j[c]);return d};b._i.push([e,f,c])};b.__SV=1.2;e=f.createElement("script");e.type="text/javascript";e.async=!0;e.src="undefined"!==typeof MIXPANEL_CUSTOM_LIB_URL?
MIXPANEL_CUSTOM_LIB_URL:"file:"===f.location.protocol&&"//cdn.mxpnl.com/libs/mixpanel-2-latest.min.js".match(/^\/\//)?"https://cdn.mxpnl.com/libs/mixpanel-2-latest.min.js":"//cdn.mxpnl.com/libs/mixpanel-2-latest.min.js";g=f.getElementsByTagName("script")[0];g.parentNode.insertBefore(e,g)}})(document,window.mixpanel||[]);
mixpanel.init("4bfb2414ab973c741b6f067bf06d5575", {batch_requests: true})
mixpanel.track("Page View", {
    pathname: window.location.origin + window.location.pathname,
    search: window.location.search,
    hash: window.location.hash,
    referrer: document.referrer,
})
</script>
<header class="header">
  <nav class="navbar">
    <div class="navbar-brand">
      <a class="navbar-item" href="/">

      <img class="navbar-logo" src="https://dist.neo4j.com/wp-content/uploads/20210422142941/neo4j-logo-2020.svg" alt="Neo4j Docs" />
      <a href="/docs/" class="navbar-item no-left-padding" aria-label="Docs">
        Docs
      </a>

      </div>

      <button class="navbar-search search-button" data-target="topbar-nav" id="search_open_mobile" aria-label="Open Search">
        <svg width="23px" height="23px" viewBox="0 0 23 23" version="1.1" class="fill-current float-right" id="searchx" role="button" title="Search Website">
          <g stroke="none" stroke-width="1" fill="none" fill-rule="evenodd" stroke-linecap="round"
            stroke-linejoin="round">
            <g transform="translate(-2.000000, -2.000000)" stroke="#a0aec0" stroke-width="1.5">
              <circle
                transform="translate(11.389364, 11.388564) rotate(-23.025000) translate(-11.389364, -11.388564) "
                cx="11.3893642" cy="11.3885639" r="8.056"></circle>
              <path d="M17.0853333,17.0844444 L23.3333333,23.3333333" ></path>
            </g>
          </g>
        </svg>
      </button>
      <button class="navbar-burger" data-target="topbar-nav" aria-label="Mobile Navigation Button">
        <span></span>
        <span></span>
        <span></span>
      </button>
    </div>
    <div id="topbar-nav" class="navbar-menu">
            <div class="navbar-end">


        <div class="navbar-item has-dropdown is-hoverable docs">
          <a class="navbar-link" href="/docs/">Docs</a>
          <div class="navbar-dropdown">
            <div class="navbar-item project">
              <span class="project-name">Neo4j DBMS</span>
              <ul class="project-links">
                <li><a href="/docs/getting-started/current/" class="project-link">Getting Started</a></li>
                <li><a href="/docs/operations-manual/current/" class="project-link">Operations</a></li>
                <li><a href="/docs/migration-guide/current/" class="project-link">Migration and Upgrade</a></li>
                <li><a href="/docs/status-codes/current/" class="project-link">Status Codes</a></li>
                <li><a href="/docs/java-reference/current/" class="project-link">Java Reference</a></li>
                <li><a href="/docs/kerberos-add-on/current/" class="project-link">Kerberos Add-on</a></li>
              </ul>
            </div>

            <div class="navbar-item project">
              <a class="project-name" href="/docs/aura/">Neo4j Aura</a>
              <ul class="project-links">
                <li><a class="project-link" href="/docs/aura">Neo4j Aura</a></li>
                <li><a class="project-link" href="/docs/aura/auradb/">Neo4j AuraDB</a></li>
                <li><a class="project-link" href="/docs/aura/aurads/">Neo4j AuraDS</a></li>
              </ul>
            </div>

            <div class="navbar-item project">
              <span class="project-name">Neo4j Tools</span>
              <ul class="project-links">
                <li><a href="/docs/bloom-user-guide/current/" class="project-link">Neo4j Bloom</a></li>
                <li><a href="/docs/browser-manual/current/" class="project-link">Neo4j Browser</a></li>
                <li><a href="/docs/data-importer/current/" class="project-link">Neo4j Data Importer</a></li>
                <li><a href="/docs/desktop-manual/current/" class="project-link">Neo4j Desktop</a></li>
                <li><a href="/docs/ops-manager/current/" class="project-link">Neo4j Ops Manager</a></li>
              </ul>
            </div>

            <div class="navbar-item project">
              <span class="project-name">Neo4j Graph Data Science</span>
              <ul class="project-links">
                <li><a href="/docs/graph-data-science/current/" class="project-link">Neo4j Graph Data Science Library</a></li>
              </ul>
            </div>

            <div class="navbar-item project">
              <span class="project-name">Cypher Query Language</span>
              <ul class="project-links">
                <li><a href="/docs/cypher-manual/current/" class="project-link">Cypher</a></li>
                <li><a href="/docs/cypher-cheat-sheet/current/" class="project-link">Cypher Cheat Sheet</a></li>
                <li><a href="/docs/apoc/current/" class="project-link">APOC Library</a></li>
              </ul>
            </div>

            <div class="navbar-item project">
              <span class="project-name" href="/docs/drivers-apis">Create applications</span>
              <ul class="project-links">
                <li><a href="/docs/python-manual/current/" class="project-link">Python Driver</a></li>
                <li><a href="/docs/go-manual/current/" class="project-link">Go Driver</a></li>
                <li><a href="/docs/java-manual/current/" class="project-link">Java Driver</a></li>
                <li><a href="/docs/javascript-manual/current/" class="project-link">JavaScript Driver</a></li>
                <li><a href="/docs/dotnet-manual/current/" class="project-link">.Net Driver</a></li>
                <li><a href="/docs/graphql-manual/current/" class="project-link">Neo4j GraphQL Library</a></li>
                <li><a href="/docs/http-api/current/" class="project-link">HTTP API</a></li>
                <li><a href="/docs/ogm-manual/current/" class="project-link">OGM Library</a></li>
                <li><a href="https://docs.spring.io/spring-data/neo4j/docs/current/reference/html/#reference" class="project-link">Spring Data Neo4j</a></li>
                <li><a href="/docs/spark/" class="project-link">Neo4j Connector for Apache Spark</a></li>
                <li><a href="/docs/kafka/" class="project-link">Neo4j Connector for Apache Kafka</a></li>
              </ul>
            </div>

          </div>
        </div>
        <div class="navbar-item has-dropdown is-hoverable labs">
          <a class="navbar-link" href="/labs/">Labs</a>
          <div class="navbar-dropdown">
            <div class="navbar-item project">
              <a class="project-name" href="/labs/arrows/">arrows.app</a>
              <ul class="project-links">
                <li><a href="/labs/arrows/" class="project-link">Details</a></li>
                <li><a href="https://arrows.app" class="project-link">arrows.app</a></li>
              </ul>
            </div>
            <div class="navbar-item project">
              <a class="project-name" href="/labs/apoc/">APOC Extended</a>

              <ul class="project-links">
                <li><a href="/labs/apoc/5/" class="project-link">Documentation</a></li>
                <li><a href="/developer/neo4j-apoc/" class="project-link">Developer Guide</a></li>
              </ul>
            </div>
            <div class="navbar-item project">
              <a class="project-name" href="/labs/halin/">Halin</a>
            </div>
            <div class="navbar-item project">
              <a class="project-name" href="/labs/etl-tool/">ETL Tool</a>
              <ul class="project-links">
                <li><a href="/labs/etl-tool/" class="project-link">Details</a></li>
                <li><a href="/labs/etl-tool/1.5.0/" class="project-link">Documentation</a></li>
              </ul>
            </div>
            <div class="navbar-item project">
              <a class="project-name" href="/labs/neo4j-migrations/">Neo4j Migrations</a>
              <ul class="project-links">
                <li><a href="/labs/neo4j-migrations/" class="project-link">Details</a></li>
                <li><a href="/labs/neo4j-migrations/2.0/" class="project-link">Documentation</a></li>
              </ul>
            </div>
            <div class="navbar-item project">
              <a class="project-name" href="/labs/liquibase/">Neo4j Plugin For Liquibase</a>
              <ul class="project-links">
                <li><a href="/labs/liquibase/" class="project-link">Details</a></li>
                <li><a href="https://github.com/liquibase/liquibase-neo4j" class="project-link">Documentation</a></li>
              </ul>
            </div>
            <div class="navbar-item project">
              <a class="project-name" href="/labs/neosemantics/">Neosemantics</a>
              <ul class="project-links">
                <li><a href="/labs/neosemantics/tutorial/" class="project-link">Getting Started</a></li>
                <li><a href="/labs/neosemantics/4.0/" class="project-link">Documentation</a></li>
              </ul>
            </div>
            <div class="navbar-item project">
              <a class="project-name" href="/labs/neo4j-helm/">Neo4j Helm</a>
              <ul class="project-links">
                <li><a href="/labs/neo4j-helm/" class="project-link">Details</a></li>
                <li><a href="/labs/neo4j-helm/1.0.0/" class="project-link">Documentation</a></li>
              </ul>
            </div>
            <div class="navbar-item project">
              <a class="project-name" href="/labs/neodash/">NeoDash</a>
              <ul class="project-links">
                <li><a href="/labs/neodash/" class="project-link">Details</a></li>
                <li><a href="/labs/neodash/2.1/" class="project-link">Documentation</a></li>
              </ul>
            </div>
            <div class="navbar-item project">
              <a class="project-name" href="/labs/neomodel/">neomodel</a>
              <ul class="project-links">
                <li><a href="/labs/neomodel/" class="project-link">Details</a></li>
                <li><a href="https://neomodel.readthedocs.io/en/latest/" target="_blank" class="project-link">Documentation</a></li>
              </ul>
            </div>
          </div>
        </div>
        <div class="navbar-item has-dropdown is-hoverable developer">
          <a class="navbar-link" href="/developer/resources/">Get Help</a>
          <div class="navbar-dropdown">
            <div class="navbar-item project">
              <a class="project-name" href="https://graphacademy.neo4j.com/?ref=docs" target="_blank">GraphAcademy</a>
              <ul class="project-links">
                <li><a class="project-link" href="https://graphacademy.neo4j.com/?ref=docs">Free, Self Paced Training</a></li>
                <li><a class="project-link" href="https://graphacademy.neo4j.com/certification/?ref=docs" target="_blank">Certification</a></li>
              </ul>
            </div>

            <div class="navbar-item project">
              <a class="project-name" href="https://dev.neo4j.com/forum" target="_blank">Community Forum</a>
            </div>
            <div class="navbar-item project">
              <a class="project-name" href="https://dev.neo4j.com/chat" target="_blank">Discord Chat</a>
            </div>
            <div class="navbar-item project">
              <a class="project-name" href="/developer/kb" target="_blank">Knowledge Base</a>
            </div>
            <div class="navbar-item project">
              <a class="project-name" href="https://medium.com/neo4j" target="_blank">Neo4j Developer Blog</a>
            </div>
            <div class="navbar-item project">
              <a class="project-name" href="https://www.youtube.com/neo4j" target="_blank">Neo4j Videos</a>
            </div>
          </div>
        </div>
        <div class="navbar-item is-hoverable getting-started-cta">
          <a class="navbar-link primary" href="https://neo4j.com/cloud/platform/aura-graph-database/?ref=docs-nav-get-started">Get Started Free</a>
        </div>
        <div class="navbar-item">
          <a class="navbar-link search-button" href="#search" id="search_open"><svg width="23px" height="23px" viewBox="0 0 23 23"
              version="1.1" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink"
              class="fill-current float-right" id="search" role="button" title="Search Website">
              <g stroke="none" stroke-width="1" fill="none" fill-rule="evenodd" stroke-linecap="round"
                stroke-linejoin="round">
                <g transform="translate(-2.000000, -2.000000)" stroke="#a0aec0" stroke-width="1.5">
                  <circle
                    transform="translate(11.389364, 11.388564) rotate(-23.025000) translate(-11.389364, -11.388564) "
                    cx="11.3893642" cy="11.3885639" r="8.056"></circle>
                  <path d="M17.0853333,17.0844444 L23.3333333,23.3333333" ></path>
                </g>
              </g>
            </svg><span class="navbar-mobile">Search</span></a>
        </div>
      </div>
    </div>
  </nav>
</header>
<div class="body">
<div class="nav-container" data-component="cypher-manual" data-version="5">
  <aside class="nav">
    <div class="panels">
      <div class="selectors">
        
      </div>
      <div class="nav-panel-menu is-active" data-panel="menu">
    <nav class="nav-menu">
    <ul class="nav-list">
  <li class="nav-item" data-depth="0">
<ul class="nav-list">
  <li class="nav-item" data-depth="1">
    <a class="nav-link nav-item-toggle" href="../../introduction/">Introduction</a>
<ul class="nav-list">
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../introduction/cypher_overview/">Overview</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../introduction/cypher_neo4j/">Cypher and Neo4j</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../introduction/cypher_aura/">Cypher and Aura</a>
  </li>
</ul>
  </li>
  <li class="nav-item" data-depth="1">
    <a class="nav-link nav-item-toggle" href="../../queries/">Queries</a>
<ul class="nav-list">
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../queries/concepts/">Core concepts</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../queries/basic/">Basic queries</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../queries/expressions/">Cypher expressions</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../queries/case/">Conditional expressions (CASE)</a>
  </li>
</ul>
  </li>
  <li class="nav-item" data-depth="1">
    <a class="nav-link nav-item-toggle" href="../../clauses/">Clauses</a>
<ul class="nav-list">
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../clauses/clause_composition/">Clause composition</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../clauses/match/">MATCH</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../clauses/optional-match/">OPTIONAL MATCH</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../clauses/return/">RETURN</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../clauses/with/">WITH</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../clauses/unwind/">UNWIND</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../clauses/where/">WHERE</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../clauses/order-by/">ORDER BY</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../clauses/skip/">SKIP</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../clauses/limit/">LIMIT</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../clauses/create/">CREATE</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../clauses/delete/">DELETE</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../clauses/set/">SET</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../clauses/remove/">REMOVE</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../clauses/foreach/">FOREACH</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../clauses/merge/">MERGE</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../clauses/call/">CALL procedure</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../clauses/union/">UNION</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../clauses/use/">USE</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../clauses/load-csv/">LOAD CSV</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../clauses/listing-functions/">SHOW FUNCTIONS</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../clauses/listing-procedures/">SHOW PROCEDURES</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../clauses/listing-settings/">SHOW SETTINGS</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../clauses/transaction-clauses/#query-listing-transactions">SHOW TRANSACTIONS</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../clauses/transaction-clauses/#query-terminate-transactions">TERMINATE TRANSACTIONS</a>
  </li>
</ul>
  </li>
  <li class="nav-item" data-depth="1">
    <a class="nav-link nav-item-toggle" href="../../subqueries/">Subqueries</a>
<ul class="nav-list">
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../subqueries/call-subquery/">CALL subqueries</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../subqueries/subqueries-in-transactions/">CALL subqueries in transactions</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../subqueries/existential/">EXISTS subqueries</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../subqueries/count/">COUNT subqueries</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../subqueries/collect/">COLLECT subqueries</a>
  </li>
</ul>
  </li>
  <li class="nav-item" data-depth="1">
    <a class="nav-link nav-item-toggle" href="../../patterns/">Patterns</a>
<ul class="nav-list">
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../patterns/concepts/">Concepts</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../patterns/primer/">Primer</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../patterns/reference/">Syntax and semantics</a>
  </li>
</ul>
  </li>
  <li class="nav-item" data-depth="1">
    <a class="nav-link nav-item-toggle" href="../../values-and-types/">Values and types</a>
<ul class="nav-list">
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../values-and-types/property-structural-constructed/">Property, structural, and constructed values</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../values-and-types/temporal/">Temporal values</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../values-and-types/spatial/">Spatial values</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../values-and-types/working-with-null/">Working with <code>null</code></a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../values-and-types/lists/">Lists</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../values-and-types/maps/">Maps</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../values-and-types/casting-data/">Casting data values</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../values-and-types/type-predicate/">Type predicate expressions</a>
  </li>
</ul>
  </li>
  <li class="nav-item" data-depth="1">
    <a class="nav-link nav-item-toggle" href="../../functions/">Functions</a>
<ul class="nav-list">
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../functions/predicate/">Predicate functions</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../functions/scalar/">Scalar functions</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../functions/aggregating/">Aggregating functions</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../functions/list/">List functions</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../functions/mathematical-numeric/">Mathematical functions - numeric</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../functions/mathematical-logarithmic/">Mathematical functions - logarithmic</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../functions/mathematical-trigonometric/">Mathematical functions - trigonometric</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../functions/string/">String functions</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../functions/temporal/">Temporal functions - instant types</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../functions/temporal/duration/">Temporal functions - duration</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../functions/spatial/">Spatial functions</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../functions/load-csv/">LOAD CSV functions</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../functions/graph/">Graph functions</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../functions/database/">Database functions</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../functions/user-defined/">User-defined functions</a>
  </li>
</ul>
  </li>
  <li class="nav-item" data-depth="1">
    <a class="nav-link" href="../../indexes-for-search-performance/">Indexes for search performance</a>
  </li>
  <li class="nav-item" data-depth="1">
    <a class="nav-link" href="../../indexes-for-full-text-search/">Full-text search index</a>
  </li>
  <li class="nav-item" data-depth="1">
    <a class="nav-link" href="../../indexes-for-vector-search/">Vector search index</a>
  </li>
  <li class="nav-item" data-depth="1">
    <a class="nav-link nav-item-toggle" href="../../constraints/">Constraints</a>
<ul class="nav-list">
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../constraints/syntax/">Syntax</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../constraints/examples/">Examples</a>
  </li>
</ul>
  </li>
  <li class="nav-item" data-depth="1">
    <a class="nav-link nav-item-toggle" href="../">Query tuning</a>
<ul class="nav-list">
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../query-options/">Cypher query options</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../query-profile/">Profile a query</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../indexes/">The use of indexes</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../basic-example/">Basic query tuning example</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../advanced-example/">Advanced query tuning example</a>
  </li>
  <li class="nav-item is-current-page" data-depth="2">
    <a class="nav-link" href="./">Planner hints and the USING keyword</a>
  </li>
</ul>
  </li>
  <li class="nav-item" data-depth="1">
    <a class="nav-link nav-item-toggle" href="../../execution-plans/">Execution plans</a>
<ul class="nav-list">
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../execution-plans/db-hits/">Database hits</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../execution-plans/operator-summary/">Execution plan operators</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../execution-plans/operators/">Execution plan operators in detail</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../execution-plans/shortestpath-planning/">Shortest path planning</a>
  </li>
</ul>
  </li>
  <li class="nav-item" data-depth="1">
    <a class="nav-link nav-item-toggle" href="../../query-caches/">Query caches</a>
<ul class="nav-list">
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../query-caches/unified-query-caches/">Unifying query caches</a>
  </li>
</ul>
  </li>
  <li class="nav-item" data-depth="1">
    <a class="nav-link nav-item-toggle" href="../../administration/">Administration</a>
<ul class="nav-list">
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../administration/databases/">Database management</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../administration/aliases/">Database alias management</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../administration/servers/">Server management</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link nav-item-toggle" href="../../administration/access-control/">Access control</a>
<ul class="nav-list">
  <li class="nav-item" data-depth="3">
    <a class="nav-link" href="../../administration/access-control/manage-users/">Managing users</a>
  </li>
  <li class="nav-item" data-depth="3">
    <a class="nav-link" href="../../administration/access-control/manage-roles/">Managing roles</a>
  </li>
  <li class="nav-item" data-depth="3">
    <a class="nav-link" href="../../administration/access-control/manage-privileges/">Managing privileges</a>
  </li>
  <li class="nav-item" data-depth="3">
    <a class="nav-link" href="../../administration/access-control/built-in-roles/">Built-in roles and privileges</a>
  </li>
  <li class="nav-item" data-depth="3">
    <a class="nav-link" href="../../administration/access-control/privileges-reads/">Read privileges</a>
  </li>
  <li class="nav-item" data-depth="3">
    <a class="nav-link" href="../../administration/access-control/privileges-writes/">Write privileges</a>
  </li>
  <li class="nav-item" data-depth="3">
    <a class="nav-link" href="../../administration/access-control/database-administration/">Database administration</a>
  </li>
  <li class="nav-item" data-depth="3">
    <a class="nav-link" href="../../administration/access-control/dbms-administration/">DBMS administration</a>
  </li>
  <li class="nav-item" data-depth="3">
    <a class="nav-link" href="../../administration/access-control/load-privileges/">Load privileges</a>
  </li>
  <li class="nav-item" data-depth="3">
    <a class="nav-link" href="../../administration/access-control/limitations/">Limitations</a>
  </li>
  <li class="nav-item" data-depth="3">
    <a class="nav-link" href="../../administration/access-control/privileges-immutable/">Immutable privileges</a>
  </li>
</ul>
  </li>
</ul>
  </li>
  <li class="nav-item" data-depth="1">
    <a class="nav-link nav-item-toggle" href="../../syntax/">Syntax</a>
<ul class="nav-list">
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../syntax/parsing/">Parsing</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../syntax/naming/">Naming rules and recommendations</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../syntax/variables/">Variables</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../syntax/reserved/">Reserved keywords</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../syntax/parameters/">Parameters</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../syntax/operators/">Operators</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../syntax/comments/">Comments</a>
  </li>
</ul>
  </li>
  <li class="nav-item" data-depth="1">
    <a class="nav-link" href="../../deprecations-additions-removals-compatibility/">Deprecations, additions, and compatibility</a>
  </li>
  <li class="nav-item" data-depth="1">
    <a class="nav-link" href="../../keyword-glossary/">Glossary of keywords</a>
  </li>
  <li class="nav-item" data-depth="1">
    <span class="nav-text nav-item-toggle">Appendix</span>
<ul class="nav-list">
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../styleguide/">Cypher styleguide</a>
  </li>
</ul>
  </li>
</ul>
  </li>
</ul>
  </nav>
</div>
    </div>
  </aside>
</div>
<main class="article">
<div class="toolbar" role="navigation">
  <div class="toolbar-wrapper">
    <button class="nav-toggle" aria-label="Toggle Table of Contents"></button>
    <a href="../../introduction/" class="home-link" aria-label="Go to home page"></a>
    <nav class="breadcrumbs" aria-label="breadcrumbs">
  <ul>
    <li><a href="../../introduction/">Cypher Manual</a></li>
    <li><a href="../">
        Query tuning
    </a></li>
    <li><a href="./">
        Planner hints and the USING keyword
    </a></li>
  </ul>
</nav>
      </div>
</div>

  <div class="content">
<article class="doc">
<div class="sect-header">
<h1 class="page">Planner hints and the USING keyword</h1>
</div>





<div id="preamble">
<div class="sectionbody">
<div class="quoteblock abstract">
<blockquote>
<div class="paragraph">
<p>A planner hint is used to influence the decisions of the planner when building an execution plan for a query.
Planner hints are specified in a query with the <code>USING</code> keyword.</p>
</div>
</blockquote>
</div>
<div class="admonitionblock caution">
<table>
<tr>
<td class="icon">
<i class="fa icon-caution" title="Caution"></i>
</td>
<td class="content">
<div class="paragraph">
<p>Forcing planner behavior is an advanced feature, and should be used with caution by experienced developers and/or database administrators only, as it may cause queries to perform poorly.</p>
</div>
</td>
</tr>
</table>
</div>
<div class="paragraph">
<p>When executing a query, Neo4j needs to decide where in the query graph to start matching.
This is done by looking at the <code>MATCH</code> clause and the <code>WHERE</code> conditions and using that information to find useful indexes, or other starting points.</p>
</div>
<div class="paragraph">
<p>However, the selected index might not always be the best choice.
Sometimes multiple indexes are possible candidates, and the query planner picks the suboptimal one from a performance point of view.
Moreover, in some circumstances (albeit rarely) it is better not to use an index at all.</p>
</div>
<div class="paragraph">
<p>Neo4j can be forced to use a specific starting point through the <code>USING</code> keyword.
This is called giving a planner hint.</p>
</div>
<div class="paragraph">
<p>There are three types of planner hints:</p>
</div>
<div class="ulist">
<ul>
<li>
<p>Index hints.</p>
</li>
<li>
<p>Scan hints.</p>
</li>
<li>
<p>Join hints.</p>
</li>
</ul>
</div>
<div class="listingblock">
<div class="title">Query</div>
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">PROFILE
MATCH
  (s:Scientist {born: 1850})-[:RESEARCHED]-&gt;
  (sc:Science)&lt;-[i:INVENTED_BY {year: 560}]-
  (p:Pioneer {born: 525})-[:LIVES_IN]-&gt;
  (c:City)-[:PART_OF]-&gt;
  (cc:Country {formed: 411})
RETURN *</code></pre>
</div>
</div>
<div class="paragraph">
<p>The query above will be used in some of the examples on this page.
Without any hints, one index and no join is used.</p>
</div>
<div class="listingblock queryplan">
<div class="title">Query plan</div>
<div class="content">
<pre>Planner COST

Runtime PIPELINED

Runtime version 5.13

Batch size 128

+-----------------+----------------------------------------------------------+----------------+------+---------+----------------+------------------------+-----------+---------------------+
| Operator        | Details                                                  | Estimated Rows | Rows | DB Hits | Memory (Bytes) | Page Cache Hits/Misses | Time (ms) | Pipeline            |
+-----------------+----------------------------------------------------------+----------------+------+---------+----------------+------------------------+-----------+---------------------+
| +ProduceResults | c, cc, i, p, s, sc                                       |              0 |    0 |       0 |                |                        |           |                     |
| |               +----------------------------------------------------------+----------------+------+---------+----------------+                        |           |                     |
| +Filter         | s.born = $autoint_0 AND s:Scientist                      |              0 |    0 |       0 |                |                        |           |                     |
| |               +----------------------------------------------------------+----------------+------+---------+----------------+                        |           |                     |
| +Expand(All)    | (sc)&lt;-[anon_0:RESEARCHED]-(s)                            |              0 |    0 |       0 |                |                        |           |                     |
| |               +----------------------------------------------------------+----------------+------+---------+----------------+                        |           |                     |
| +Filter         | i.year = $autoint_1 AND sc:Science                       |              0 |    0 |       0 |                |                        |           |                     |
| |               +----------------------------------------------------------+----------------+------+---------+----------------+                        |           |                     |
| +Expand(All)    | (p)-[i:INVENTED_BY]-&gt;(sc)                                |              0 |    0 |       0 |                |                        |           |                     |
| |               +----------------------------------------------------------+----------------+------+---------+----------------+                        |           |                     |
| +Filter         | p.born = $autoint_2 AND p:Pioneer                        |              0 |    0 |       2 |                |                        |           |                     |
| |               +----------------------------------------------------------+----------------+------+---------+----------------+                        |           |                     |
| +Expand(All)    | (c)&lt;-[anon_1:LIVES_IN]-(p)                               |              1 |    1 |       3 |                |                        |           |                     |
| |               +----------------------------------------------------------+----------------+------+---------+----------------+                        |           |                     |
| +Filter         | c:City                                                   |              1 |    1 |       2 |                |                        |           |                     |
| |               +----------------------------------------------------------+----------------+------+---------+----------------+                        |           |                     |
| +Expand(All)    | (cc)&lt;-[anon_2:PART_OF]-(c)                               |              1 |    1 |       2 |                |                        |           |                     |
| |               +----------------------------------------------------------+----------------+------+---------+----------------+                        |           |                     |
| +NodeIndexSeek  | RANGE INDEX cc:Country(formed) WHERE formed = $autoint_3 |              1 |    1 |       2 |            120 |                    6/1 |     0.506 | Fused in Pipeline 0 |
+-----------------+----------------------------------------------------------+----------------+------+---------+----------------+------------------------+-----------+---------------------+

Total database accesses: 11, total allocated memory: 208</pre>
</div>
</div>
</div>
</div>
<div class="sect1">
<h2 id="query-using-index-hint"><a class="anchor" href="#query-using-index-hint"></a>Index hints</h2>
<div class="sectionbody">
<div class="paragraph">
<p>Index hints are used to specify which index the planner should use as a starting point.
This can be beneficial in cases where the index statistics are not accurate for the specific values that
the query at hand is known to use, which would result in the planner picking a non-optimal index.
An index hint is supplied after an applicable <code>MATCH</code> clause.</p>
</div>
<div class="paragraph">
<p>Available index hints are:</p>
</div>
<table class="tableblock frame-all grid-all stretch">
<colgroup>
<col style="width: 50%;">
<col style="width: 50%;">
</colgroup>
<thead>
<tr>
<th class="tableblock halign-left valign-top">Hint</th>
<th class="tableblock halign-left valign-top">Fulfilled by plans</th>
</tr>
</thead>
<tbody>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>USING [RANGE | TEXT | POINT] INDEX variable:Label(property)</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>NodeIndexScan</code>, <code>NodeIndexSeek</code></p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>USING [RANGE | TEXT | POINT] INDEX SEEK variable:Label(property)</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>NodeIndexSeek</code></p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>USING [RANGE | TEXT | POINT] INDEX variable:RELATIONSHIP_TYPE(property)</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>DirectedRelationshipIndexScan</code>, <code>UndirectedRelationshipIndexScan</code>, <code>DirectedRelationshipIndexSeek</code>, <code>UndirectedRelationshipIndexSeek</code></p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>USING [RANGE | TEXT | POINT] INDEX SEEK variable:RELATIONSHIP_TYPE(property)</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>DirectedRelationshipIndexSeek</code>, <code>UndirectedRelationshipIndexSeek</code></p></td>
</tr>
</tbody>
</table>
<div class="paragraph">
<p>When specifying an index type for a hint, e.g. <code>RANGE</code>, <code>TEXT</code>, or <code>POINT</code>, the hint can only be fulfilled when an index of the specified type is available.
When no index type is specified, the hint can be fulfilled by any index types.</p>
</div>
<div class="admonitionblock caution">
<table>
<tr>
<td class="icon">
<i class="fa icon-caution" title="Caution"></i>
</td>
<td class="content">
<div class="paragraph">
<p>Using a hint must never change the result of a query.
Therefore, a hint with a specified index type is only fulfillable when the planner knows that using an index of the specified type does not change the results.
Please refer to <a href="../indexes/" class="xref page">The use of indexes</a> for more details.</p>
</div>
</td>
</tr>
</table>
</div>
<div class="paragraph">
<p>It is possible to supply several index hints, but keep in mind that several starting points
will require the use of a potentially expensive join later in the query plan.</p>
</div>
<div class="sect2">
<h3 id="_query_using_a_node_index_hint"><a class="anchor" href="#_query_using_a_node_index_hint"></a>Query using a node index hint</h3>
<div class="paragraph">
<p>The query above can be tuned to pick a different index as the starting point.</p>
</div>
<div class="listingblock">
<div class="title">Query</div>
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">PROFILE
MATCH
  (s:Scientist {born: 1850})-[:RESEARCHED]-&gt;
  (sc:Science)&lt;-[i:INVENTED_BY {year: 560}]-
  (p:Pioneer {born: 525})-[:LIVES_IN]-&gt;
  (c:City)-[:PART_OF]-&gt;
  (cc:Country {formed: 411})
USING INDEX p:Pioneer(born)
RETURN *</code></pre>
</div>
</div>
<div class="listingblock queryplan">
<div class="title">Query plan</div>
<div class="content">
<pre>Planner COST

Runtime PIPELINED

Runtime version 5.13

Batch size 128

+-----------------+-----------------------------------------------------+----------------+------+---------+----------------+------------------------+-----------+---------------------+
| Operator        | Details                                             | Estimated Rows | Rows | DB Hits | Memory (Bytes) | Page Cache Hits/Misses | Time (ms) | Pipeline            |
+-----------------+-----------------------------------------------------+----------------+------+---------+----------------+------------------------+-----------+---------------------+
| +ProduceResults | c, cc, i, p, s, sc                                  |              0 |    0 |       0 |                |                        |           |                     |
| |               +-----------------------------------------------------+----------------+------+---------+----------------+                        |           |                     |
| +Filter         | cc.formed = $autoint_3 AND cc:Country               |              0 |    0 |       0 |                |                        |           |                     |
| |               +-----------------------------------------------------+----------------+------+---------+----------------+                        |           |                     |
| +Expand(All)    | (c)-[anon_2:PART_OF]-&gt;(cc)                          |              0 |    0 |       0 |                |                        |           |                     |
| |               +-----------------------------------------------------+----------------+------+---------+----------------+                        |           |                     |
| +Filter         | c:City                                              |              0 |    0 |       0 |                |                        |           |                     |
| |               +-----------------------------------------------------+----------------+------+---------+----------------+                        |           |                     |
| +Expand(All)    | (p)-[anon_1:LIVES_IN]-&gt;(c)                          |              0 |    0 |       0 |                |                        |           |                     |
| |               +-----------------------------------------------------+----------------+------+---------+----------------+                        |           |                     |
| +Filter         | s.born = $autoint_0 AND s:Scientist                 |              0 |    0 |       0 |                |                        |           |                     |
| |               +-----------------------------------------------------+----------------+------+---------+----------------+                        |           |                     |
| +Expand(All)    | (sc)&lt;-[anon_0:RESEARCHED]-(s)                       |              0 |    0 |       0 |                |                        |           |                     |
| |               +-----------------------------------------------------+----------------+------+---------+----------------+                        |           |                     |
| +Filter         | i.year = $autoint_1 AND sc:Science                  |              0 |    0 |       2 |                |                        |           |                     |
| |               +-----------------------------------------------------+----------------+------+---------+----------------+                        |           |                     |
| +Expand(All)    | (p)-[i:INVENTED_BY]-&gt;(sc)                           |              2 |    2 |       6 |                |                        |           |                     |
| |               +-----------------------------------------------------+----------------+------+---------+----------------+                        |           |                     |
| +NodeIndexSeek  | RANGE INDEX p:Pioneer(born) WHERE born = $autoint_2 |              2 |    2 |       3 |            120 |                    4/1 |     0.491 | Fused in Pipeline 0 |
+-----------------+-----------------------------------------------------+----------------+------+---------+----------------+------------------------+-----------+---------------------+

Total database accesses: 11, total allocated memory: 208</pre>
</div>
</div>
</div>
<div class="sect2">
<h3 id="_query_using_a_node_text_index_hint"><a class="anchor" href="#_query_using_a_node_text_index_hint"></a>Query using a node text index hint</h3>
<div class="paragraph">
<p>The following query can be tuned to pick a text index.</p>
</div>
<div class="listingblock">
<div class="title">Query</div>
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">PROFILE
MATCH (c:Country)
USING TEXT INDEX c:Country(name)
WHERE c.name = 'Country7'
RETURN *</code></pre>
</div>
</div>
<div class="listingblock queryplan">
<div class="title">Query plan</div>
<div class="content">
<pre>Planner COST

Runtime PIPELINED

Runtime version 5.13

Batch size 128

+-----------------+-------------------------------------------------------+----------------+------+---------+----------------+------------------------+-----------+---------------------+
| Operator        | Details                                               | Estimated Rows | Rows | DB Hits | Memory (Bytes) | Page Cache Hits/Misses | Time (ms) | Pipeline            |
+-----------------+-------------------------------------------------------+----------------+------+---------+----------------+------------------------+-----------+---------------------+
| +ProduceResults | c                                                     |              1 |    1 |       0 |                |                        |           |                     |
| |               +-------------------------------------------------------+----------------+------+---------+----------------+                        |           |                     |
| +NodeIndexSeek  | TEXT INDEX c:Country(name) WHERE name = $autostring_0 |              1 |    1 |       2 |            120 |                    2/0 |     0.949 | Fused in Pipeline 0 |
+-----------------+-------------------------------------------------------+----------------+------+---------+----------------+------------------------+-----------+---------------------+

Total database accesses: 2, total allocated memory: 184</pre>
</div>
</div>
</div>
<div class="sect2">
<h3 id="_query_using_a_relationship_index_hint"><a class="anchor" href="#_query_using_a_relationship_index_hint"></a>Query using a relationship index hint</h3>
<div class="paragraph">
<p>The query above can be tuned to pick a relationship index as the starting point.</p>
</div>
<div class="listingblock">
<div class="title">Query</div>
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">PROFILE
MATCH
  (s:Scientist {born: 1850})-[:RESEARCHED]-&gt;
  (sc:Science)&lt;-[i:INVENTED_BY {year: 560}]-
  (p:Pioneer {born: 525})-[:LIVES_IN]-&gt;
  (c:City)-[:PART_OF]-&gt;
  (cc:Country {formed: 411})
USING INDEX i:INVENTED_BY(year)
RETURN *</code></pre>
</div>
</div>
<div class="listingblock queryplan">
<div class="title">Query plan</div>
<div class="content">
<pre>Planner COST

Runtime PIPELINED

Runtime version 5.13

Batch size 128

+--------------------------------+---------------------------------------------------------------------+----------------+------+---------+----------------+------------------------+-----------+---------------------+
| Operator                       | Details                                                             | Estimated Rows | Rows | DB Hits | Memory (Bytes) | Page Cache Hits/Misses | Time (ms) | Pipeline            |
+--------------------------------+---------------------------------------------------------------------+----------------+------+---------+----------------+------------------------+-----------+---------------------+
| +ProduceResults                | c, cc, i, p, s, sc                                                  |              0 |    0 |       0 |                |                        |           |                     |
| |                              +---------------------------------------------------------------------+----------------+------+---------+----------------+                        |           |                     |
| +Filter                        | cc.formed = $autoint_3 AND cc:Country                               |              0 |    0 |       0 |                |                        |           |                     |
| |                              +---------------------------------------------------------------------+----------------+------+---------+----------------+                        |           |                     |
| +Expand(All)                   | (c)-[anon_2:PART_OF]-&gt;(cc)                                          |              0 |    0 |       0 |                |                        |           |                     |
| |                              +---------------------------------------------------------------------+----------------+------+---------+----------------+                        |           |                     |
| +Filter                        | c:City                                                              |              0 |    0 |       0 |                |                        |           |                     |
| |                              +---------------------------------------------------------------------+----------------+------+---------+----------------+                        |           |                     |
| +Expand(All)                   | (p)-[anon_1:LIVES_IN]-&gt;(c)                                          |              0 |    0 |       0 |                |                        |           |                     |
| |                              +---------------------------------------------------------------------+----------------+------+---------+----------------+                        |           |                     |
| +Filter                        | s.born = $autoint_0 AND s:Scientist                                 |              0 |    0 |       0 |                |                        |           |                     |
| |                              +---------------------------------------------------------------------+----------------+------+---------+----------------+                        |           |                     |
| +Expand(All)                   | (sc)&lt;-[anon_0:RESEARCHED]-(s)                                       |              0 |    0 |       0 |                |                        |           |                     |
| |                              +---------------------------------------------------------------------+----------------+------+---------+----------------+                        |           |                     |
| +Filter                        | p.born = $autoint_2 AND sc:Science AND p:Pioneer                    |              0 |    0 |       4 |                |                        |           |                     |
| |                              +---------------------------------------------------------------------+----------------+------+---------+----------------+                        |           |                     |
| +DirectedRelationshipIndexSeek | RANGE INDEX (p)-[i:INVENTED_BY(year)]-&gt;(sc) WHERE year = $autoint_1 |              2 |    2 |       3 |            120 |                    5/1 |     0.461 | Fused in Pipeline 0 |
+--------------------------------+---------------------------------------------------------------------+----------------+------+---------+----------------+------------------------+-----------+---------------------+

Total database accesses: 7, total allocated memory: 208</pre>
</div>
</div>
</div>
<div class="sect2">
<h3 id="_query_using_a_relationship_text_index_hint"><a class="anchor" href="#_query_using_a_relationship_text_index_hint"></a>Query using a relationship text index hint</h3>
<div class="paragraph">
<p>The following query can be tuned to pick a text index.</p>
</div>
<div class="listingblock">
<div class="title">Query</div>
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">PROFILE
MATCH ()-[i:INVENTED_BY]-&gt;()
USING TEXT INDEX i:INVENTED_BY(location)
WHERE i.location = 'Location7'
RETURN *</code></pre>
</div>
</div>
<div class="listingblock queryplan">
<div class="title">Query plan</div>
<div class="content">
<pre>Planner COST

Runtime PIPELINED

Runtime version 5.13

Batch size 128

+--------------------------------+----------------------------------------------------------------------------------------+----------------+------+---------+----------------+------------------------+-----------+---------------------+
| Operator                       | Details                                                                                | Estimated Rows | Rows | DB Hits | Memory (Bytes) | Page Cache Hits/Misses | Time (ms) | Pipeline            |
+--------------------------------+----------------------------------------------------------------------------------------+----------------+------+---------+----------------+------------------------+-----------+---------------------+
| +ProduceResults                | i                                                                                      |              1 |    1 |       0 |                |                        |           |                     |
| |                              +----------------------------------------------------------------------------------------+----------------+------+---------+----------------+                        |           |                     |
| +DirectedRelationshipIndexSeek | TEXT INDEX (anon_0)-[i:INVENTED_BY(location)]-&gt;(anon_1) WHERE location = $autostring_0 |              1 |    1 |       2 |            120 |                    3/0 |     1.079 | Fused in Pipeline 0 |
+--------------------------------+----------------------------------------------------------------------------------------+----------------+------+---------+----------------+------------------------+-----------+---------------------+

Total database accesses: 2, total allocated memory: 184</pre>
</div>
</div>
</div>
<div class="sect2">
<h3 id="_query_using_multiple_index_hints"><a class="anchor" href="#_query_using_multiple_index_hints"></a>Query using multiple index hints</h3>
<div class="paragraph">
<p>Supplying one index hint changed the starting point of the query, but the plan is still linear, meaning it
only has one starting point. If we give the planner yet another index hint, we force it to use two starting points,
one at each end of the match. It will then join these two branches using a join operator.</p>
</div>
<div class="listingblock">
<div class="title">Query</div>
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">PROFILE
MATCH
  (s:Scientist {born: 1850})-[:RESEARCHED]-&gt;
  (sc:Science)&lt;-[i:INVENTED_BY {year: 560}]-
  (p:Pioneer {born: 525})-[:LIVES_IN]-&gt;
  (c:City)-[:PART_OF]-&gt;
  (cc:Country {formed: 411})
USING INDEX s:Scientist(born)
USING INDEX cc:Country(formed)
RETURN *</code></pre>
</div>
</div>
<div class="listingblock queryplan">
<div class="title">Query plan</div>
<div class="content">
<pre>Planner COST

Runtime PIPELINED

Runtime version 5.13

Batch size 128

+------------------+----------------------------------------------------------+----------------+------+---------+----------------+------------------------+-----------+---------------------+
| Operator         | Details                                                  | Estimated Rows | Rows | DB Hits | Memory (Bytes) | Page Cache Hits/Misses | Time (ms) | Pipeline            |
+------------------+----------------------------------------------------------+----------------+------+---------+----------------+------------------------+-----------+---------------------+
| +ProduceResults  | c, cc, i, p, s, sc                                       |              0 |    0 |       0 |                |                    0/0 |     0.000 |                     |
| |                +----------------------------------------------------------+----------------+------+---------+----------------+------------------------+-----------+                     |
| +NodeHashJoin    | sc                                                       |              0 |    0 |       0 |            432 |                        |           | In Pipeline 2       |
| |\               +----------------------------------------------------------+----------------+------+---------+----------------+------------------------+-----------+---------------------+
| | +Expand(All)   | (s)-[anon_0:RESEARCHED]-&gt;(sc)                            |              1 |    0 |       0 |                |                        |           |                     |
| | |              +----------------------------------------------------------+----------------+------+---------+----------------+                        |           |                     |
| | +NodeIndexSeek | RANGE INDEX s:Scientist(born) WHERE born = $autoint_0    |              1 |    0 |       0 |            120 |                    0/0 |     0.000 | Fused in Pipeline 1 |
| |                +----------------------------------------------------------+----------------+------+---------+----------------+------------------------+-----------+---------------------+
| +Filter          | i.year = $autoint_1 AND sc:Science                       |              0 |    0 |       0 |                |                        |           |                     |
| |                +----------------------------------------------------------+----------------+------+---------+----------------+                        |           |                     |
| +Expand(All)     | (p)-[i:INVENTED_BY]-&gt;(sc)                                |              0 |    0 |       0 |                |                        |           |                     |
| |                +----------------------------------------------------------+----------------+------+---------+----------------+                        |           |                     |
| +Filter          | p.born = $autoint_2 AND p:Pioneer                        |              0 |    0 |       2 |                |                        |           |                     |
| |                +----------------------------------------------------------+----------------+------+---------+----------------+                        |           |                     |
| +Expand(All)     | (c)&lt;-[anon_1:LIVES_IN]-(p)                               |              1 |    1 |       3 |                |                        |           |                     |
| |                +----------------------------------------------------------+----------------+------+---------+----------------+                        |           |                     |
| +Filter          | c:City                                                   |              1 |    1 |       2 |                |                        |           |                     |
| |                +----------------------------------------------------------+----------------+------+---------+----------------+                        |           |                     |
| +Expand(All)     | (cc)&lt;-[anon_2:PART_OF]-(c)                               |              1 |    1 |       2 |                |                        |           |                     |
| |                +----------------------------------------------------------+----------------+------+---------+----------------+                        |           |                     |
| +NodeIndexSeek   | RANGE INDEX cc:Country(formed) WHERE formed = $autoint_3 |              1 |    1 |       2 |            120 |                    7/0 |     0.494 | Fused in Pipeline 0 |
+------------------+----------------------------------------------------------+----------------+------+---------+----------------+------------------------+-----------+---------------------+

Total database accesses: 11, total allocated memory: 768</pre>
</div>
</div>
</div>
<div class="sect2">
<h3 id="_query_using_multiple_index_hints_with_a_disjunction"><a class="anchor" href="#_query_using_multiple_index_hints_with_a_disjunction"></a>Query using multiple index hints with a disjunction</h3>
<div class="paragraph">
<p>Supplying multiple index hints can also be useful if the query contains a disjunction (<code>OR</code>) in the <code>WHERE</code> clause.
This makes sure that all hinted indexes are used and the results are joined together with a <code>Union</code> and a <code>Distinct</code> afterwards.</p>
</div>
<div class="listingblock">
<div class="title">Query</div>
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">PROFILE
MATCH (country:Country)
USING INDEX country:Country(name)
USING INDEX country:Country(formed)
WHERE country.formed = 500 OR country.name STARTS WITH "A"
RETURN *</code></pre>
</div>
</div>
<div class="listingblock queryplan">
<div class="title">Query plan</div>
<div class="content">
<pre>Planner COST

Runtime PIPELINED

Runtime version 5.13

Batch size 128

+-----------------------+------------------------------------------------------------------------+----------------+------+---------+----------------+------------------------+-----------+---------------------+
| Operator              | Details                                                                | Estimated Rows | Rows | DB Hits | Memory (Bytes) | Page Cache Hits/Misses | Time (ms) | Pipeline            |
+-----------------------+------------------------------------------------------------------------+----------------+------+---------+----------------+------------------------+-----------+---------------------+
| +ProduceResults       | country                                                                |              1 |    1 |       0 |                |                        |           |                     |
| |                     +------------------------------------------------------------------------+----------------+------+---------+----------------+                        |           |                     |
| +Distinct             | country                                                                |              1 |    1 |       0 |            224 |                        |           |                     |
| |                     +------------------------------------------------------------------------+----------------+------+---------+----------------+                        |           |                     |
| +Union                |                                                                        |              2 |    1 |       0 |             80 |                    1/0 |     0.213 | Fused in Pipeline 2 |
| |\                    +------------------------------------------------------------------------+----------------+------+---------+----------------+------------------------+-----------+---------------------+
| | +NodeIndexSeek      | RANGE INDEX country:Country(formed) WHERE formed = $autoint_0          |              1 |    1 |       2 |            120 |                    1/0 |     0.101 | In Pipeline 1       |
| |                     +------------------------------------------------------------------------+----------------+------+---------+----------------+------------------------+-----------+---------------------+
| +NodeIndexSeekByRange | RANGE INDEX country:Country(name) WHERE name STARTS WITH $autostring_1 |              1 |    0 |       1 |            120 |                    0/1 |     0.307 | In Pipeline 0       |
+-----------------------+------------------------------------------------------------------------+----------------+------+---------+----------------+------------------------+-----------+---------------------+

Total database accesses: 3, total allocated memory: 320</pre>
</div>
</div>
<div class="paragraph">
<p>Cypher<sup>&reg;</sup> will usually provide a plan that uses all indexes for a disjunction without hints.
It may, however, decide to plan a <code>NodeByLabelScan</code> instead, if the predicates appear to be not very selective.
In this case, the index hints can be useful.</p>
</div>
</div>
</div>
</div>
<div class="sect1">
<h2 id="query-using-scan-hint"><a class="anchor" href="#query-using-scan-hint"></a>Scan hints</h2>
<div class="sectionbody">
<div class="paragraph">
<p>If your query matches large parts of an index, it might be faster to scan the label or relationship type and filter out rows that do not match.
To do this, you can use <code>USING SCAN variable:Label</code> after the applicable <code>MATCH</code> clause for node indexes, and <code>USING SCAN variable:RELATIONSHIP_TYPE</code> for relationship indexes.
This will force Cypher to not use an index that could have been used, and instead do a label scan/relationship type scan.
You can use the same hint to enforce a starting point where no index is applicable.</p>
</div>
<div class="sect2">
<h3 id="_hinting_a_label_scan"><a class="anchor" href="#_hinting_a_label_scan"></a>Hinting a label scan</h3>
<div class="listingblock">
<div class="title">Query</div>
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">PROFILE
MATCH
  (s:Scientist {born: 1850})-[:RESEARCHED]-&gt;
  (sc:Science)&lt;-[i:INVENTED_BY {year: 560}]-
  (p:Pioneer {born: 525})-[:LIVES_IN]-&gt;
  (c:City)-[:PART_OF]-&gt;
  (cc:Country {formed: 411})
USING SCAN s:Scientist
RETURN *</code></pre>
</div>
</div>
<div class="listingblock queryplan">
<div class="title">Query plan</div>
<div class="content">
<pre>Planner COST

Runtime PIPELINED

Runtime version 5.13

Batch size 128

+------------------+-----------------------------------------------------------+----------------+------+---------+----------------+------------------------+-----------+---------------------+
| Operator         | Details                                                   | Estimated Rows | Rows | DB Hits | Memory (Bytes) | Page Cache Hits/Misses | Time (ms) | Pipeline            |
+------------------+-----------------------------------------------------------+----------------+------+---------+----------------+------------------------+-----------+---------------------+
| +ProduceResults  | c, cc, i, p, s, sc                                        |              0 |    0 |       0 |                |                        |           |                     |
| |                +-----------------------------------------------------------+----------------+------+---------+----------------+                        |           |                     |
| +Filter          | cc.formed = $autoint_3 AND cc:Country                     |              0 |    0 |       0 |                |                        |           |                     |
| |                +-----------------------------------------------------------+----------------+------+---------+----------------+                        |           |                     |
| +Expand(All)     | (c)-[anon_2:PART_OF]-&gt;(cc)                                |              0 |    0 |       0 |                |                        |           |                     |
| |                +-----------------------------------------------------------+----------------+------+---------+----------------+                        |           |                     |
| +Filter          | c:City                                                    |              0 |    0 |       0 |                |                        |           |                     |
| |                +-----------------------------------------------------------+----------------+------+---------+----------------+                        |           |                     |
| +Expand(All)     | (p)-[anon_1:LIVES_IN]-&gt;(c)                                |              0 |    0 |       0 |                |                        |           |                     |
| |                +-----------------------------------------------------------+----------------+------+---------+----------------+                        |           |                     |
| +Filter          | i.year = $autoint_1 AND p.born = $autoint_2 AND p:Pioneer |              0 |    0 |       1 |                |                        |           |                     |
| |                +-----------------------------------------------------------+----------------+------+---------+----------------+                        |           |                     |
| +Expand(All)     | (sc)&lt;-[i:INVENTED_BY]-(p)                                 |              1 |    1 |       3 |                |                        |           |                     |
| |                +-----------------------------------------------------------+----------------+------+---------+----------------+                        |           |                     |
| +Filter          | sc:Science                                                |              1 |    1 |       2 |                |                        |           |                     |
| |                +-----------------------------------------------------------+----------------+------+---------+----------------+                        |           |                     |
| +Expand(All)     | (s)-[anon_0:RESEARCHED]-&gt;(sc)                             |              1 |    1 |       2 |                |                        |           |                     |
| |                +-----------------------------------------------------------+----------------+------+---------+----------------+                        |           |                     |
| +Filter          | s.born = $autoint_0                                       |              1 |    1 |     200 |                |                        |           |                     |
| |                +-----------------------------------------------------------+----------------+------+---------+----------------+                        |           |                     |
| +NodeByLabelScan | s:Scientist                                               |            100 |  100 |     101 |            120 |                   11/0 |     0.512 | Fused in Pipeline 0 |
+------------------+-----------------------------------------------------------+----------------+------+---------+----------------+------------------------+-----------+---------------------+

Total database accesses: 309, total allocated memory: 216</pre>
</div>
</div>
</div>
<div class="sect2">
<h3 id="_hinting_a_relationship_type_scan"><a class="anchor" href="#_hinting_a_relationship_type_scan"></a>Hinting a relationship type scan</h3>
<div class="listingblock">
<div class="title">Query</div>
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">PROFILE
MATCH
  (s:Scientist {born: 1850})-[:RESEARCHED]-&gt;
  (sc:Science)&lt;-[i:INVENTED_BY {year: 560}]-
  (p:Pioneer {born: 525})-[:LIVES_IN]-&gt;
  (c:City)-[:PART_OF]-&gt;
  (cc:Country {formed: 411})
USING SCAN i:INVENTED_BY
RETURN *</code></pre>
</div>
</div>
<div class="listingblock queryplan">
<div class="title">Query plan</div>
<div class="content">
<pre>Planner COST

Runtime PIPELINED

Runtime version 5.13

Batch size 128

+-------------------------------+--------------------------------------------------------------------------+----------------+------+---------+----------------+------------------------+-----------+---------------------+
| Operator                      | Details                                                                  | Estimated Rows | Rows | DB Hits | Memory (Bytes) | Page Cache Hits/Misses | Time (ms) | Pipeline            |
+-------------------------------+--------------------------------------------------------------------------+----------------+------+---------+----------------+------------------------+-----------+---------------------+
| +ProduceResults               | c, cc, i, p, s, sc                                                       |              0 |    0 |       0 |                |                        |           |                     |
| |                             +--------------------------------------------------------------------------+----------------+------+---------+----------------+                        |           |                     |
| +Filter                       | cc.formed = $autoint_3 AND cc:Country                                    |              0 |    0 |       0 |                |                        |           |                     |
| |                             +--------------------------------------------------------------------------+----------------+------+---------+----------------+                        |           |                     |
| +Expand(All)                  | (c)-[anon_2:PART_OF]-&gt;(cc)                                               |              0 |    0 |       0 |                |                        |           |                     |
| |                             +--------------------------------------------------------------------------+----------------+------+---------+----------------+                        |           |                     |
| +Filter                       | c:City                                                                   |              0 |    0 |       0 |                |                        |           |                     |
| |                             +--------------------------------------------------------------------------+----------------+------+---------+----------------+                        |           |                     |
| +Expand(All)                  | (p)-[anon_1:LIVES_IN]-&gt;(c)                                               |              0 |    0 |       0 |                |                        |           |                     |
| |                             +--------------------------------------------------------------------------+----------------+------+---------+----------------+                        |           |                     |
| +Filter                       | s.born = $autoint_0 AND s:Scientist                                      |              0 |    0 |       0 |                |                        |           |                     |
| |                             +--------------------------------------------------------------------------+----------------+------+---------+----------------+                        |           |                     |
| +Expand(All)                  | (sc)&lt;-[anon_0:RESEARCHED]-(s)                                            |              0 |    0 |       0 |                |                        |           |                     |
| |                             +--------------------------------------------------------------------------+----------------+------+---------+----------------+                        |           |                     |
| +Filter                       | i.year = $autoint_1 AND p.born = $autoint_2 AND sc:Science AND p:Pioneer |              0 |    0 |     204 |                |                        |           |                     |
| |                             +--------------------------------------------------------------------------+----------------+------+---------+----------------+                        |           |                     |
| +DirectedRelationshipTypeScan | (p)-[i:INVENTED_BY]-&gt;(sc)                                                |            100 |  100 |     101 |            120 |                    9/0 |     0.910 | Fused in Pipeline 0 |
+-------------------------------+--------------------------------------------------------------------------+----------------+------+---------+----------------+------------------------+-----------+---------------------+

Total database accesses: 305, total allocated memory: 208</pre>
</div>
</div>
</div>
<div class="sect2">
<h3 id="_query_using_multiple_scan_hints_with_a_disjunction"><a class="anchor" href="#_query_using_multiple_scan_hints_with_a_disjunction"></a>Query using multiple scan hints with a disjunction</h3>
<div class="paragraph">
<p>Supplying multiple scan hints can also be useful if the query contains a disjunction (<code>OR</code>) in the <code>WHERE</code> clause.
This makes sure that all involved label predicates are solved by a <code>UnionNodeByLabelsScan</code>.</p>
</div>
<div class="listingblock">
<div class="title">Query</div>
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">PROFILE
MATCH (person)
USING SCAN person:Pioneer
USING SCAN person:Scientist
WHERE person:Pioneer OR person:Scientist
RETURN *</code></pre>
</div>
</div>
<div class="listingblock queryplan">
<div class="title">Query plan</div>
<div class="content">
<pre>Planner COST

Runtime PIPELINED

Runtime version 5.13

Batch size 128

+------------------------+--------------------------+----------------+------+---------+----------------+------------------------+-----------+---------------------+
| Operator               | Details                  | Estimated Rows | Rows | DB Hits | Memory (Bytes) | Page Cache Hits/Misses | Time (ms) | Pipeline            |
+------------------------+--------------------------+----------------+------+---------+----------------+------------------------+-----------+---------------------+
| +ProduceResults        | person                   |            180 |  200 |       0 |                |                        |           |                     |
| |                      +--------------------------+----------------+------+---------+----------------+                        |           |                     |
| +UnionNodeByLabelsScan | person:Pioneer|Scientist |            180 |  200 |     202 |            120 |                    6/0 |     1.740 | Fused in Pipeline 0 |
+------------------------+--------------------------+----------------+------+---------+----------------+------------------------+-----------+---------------------+

Total database accesses: 202, total allocated memory: 184</pre>
</div>
</div>
<div class="paragraph">
<p>Cypher will usually provide a plan that uses scans for a disjunction without hints.
It may, however, decide to plan an <code>AllNodeScan</code> followed by a <code>Filter</code> instead, if the label predicates appear to be not very selective.
In this case, the scan hints can be useful.</p>
</div>
</div>
</div>
</div>
<div class="sect1">
<h2 id="query-using-join-hint"><a class="anchor" href="#query-using-join-hint"></a>Join hints</h2>
<div class="sectionbody">
<div class="paragraph">
<p>Join hints are the most advanced type of hints, and are not used to find starting points for the query execution plan, but to enforce that joins are made at specified points.
This implies that there has to be more than one starting point (leaf) in the plan, in order for the query to be able to join the two branches ascending from these leaves.
Due to this nature, joins, and subsequently join hints, will force the planner to look for additional starting points, and in the case where there are no more good ones, potentially pick a very bad starting point.
This will negatively affect query performance. In other cases, the hint might force the planner to pick a <em>seemingly</em> bad starting point, which in reality proves to be a very good one.</p>
</div>
<div class="sect2">
<h3 id="_hinting_a_join_on_a_single_node"><a class="anchor" href="#_hinting_a_join_on_a_single_node"></a>Hinting a join on a single node</h3>
<div class="paragraph">
<p>In the example above using multiple index hints, we saw that the planner chose to do a join, but not on the <code>p</code> node.
By supplying a join hint in addition to the index hints, we can enforce the join to happen on the <code>p</code> node.</p>
</div>
<div class="listingblock">
<div class="title">Query</div>
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">PROFILE
MATCH
  (s:Scientist {born: 1850})-[:RESEARCHED]-&gt;
  (sc:Science)&lt;-[i:INVENTED_BY {year: 560}]-
  (p:Pioneer {born: 525})-[:LIVES_IN]-&gt;
  (c:City)-[:PART_OF]-&gt;
  (cc:Country {formed: 411})
USING INDEX s:Scientist(born)
USING INDEX cc:Country(formed)
USING JOIN ON p
RETURN *</code></pre>
</div>
</div>
<div class="listingblock queryplan">
<div class="title">Query plan</div>
<div class="content">
<pre>Planner COST

Runtime PIPELINED

Runtime version 5.13

Batch size 128

+------------------+------------------------------------------------------------------+----------------+------+---------+----------------+------------------------+-----------+---------------------+
| Operator         | Details                                                          | Estimated Rows | Rows | DB Hits | Memory (Bytes) | Page Cache Hits/Misses | Time (ms) | Pipeline            |
+------------------+------------------------------------------------------------------+----------------+------+---------+----------------+------------------------+-----------+---------------------+
| +ProduceResults  | c, cc, i, p, s, sc                                               |              0 |    0 |       0 |                |                    0/0 |     0.000 |                     |
| |                +------------------------------------------------------------------+----------------+------+---------+----------------+------------------------+-----------+                     |
| +NodeHashJoin    | p                                                                |              0 |    0 |       0 |            432 |                        |           | In Pipeline 2       |
| |\               +------------------------------------------------------------------+----------------+------+---------+----------------+------------------------+-----------+---------------------+
| | +Filter        | cache[p.born] = $autoint_2                                       |              1 |    0 |       0 |                |                        |           |                     |
| | |              +------------------------------------------------------------------+----------------+------+---------+----------------+                        |           |                     |
| | +Expand(All)   | (c)&lt;-[anon_1:LIVES_IN]-(p)                                       |              1 |    0 |       0 |                |                        |           |                     |
| | |              +------------------------------------------------------------------+----------------+------+---------+----------------+                        |           |                     |
| | +Filter        | c:City                                                           |              1 |    0 |       0 |                |                        |           |                     |
| | |              +------------------------------------------------------------------+----------------+------+---------+----------------+                        |           |                     |
| | +Expand(All)   | (cc)&lt;-[anon_2:PART_OF]-(c)                                       |              1 |    0 |       0 |                |                        |           |                     |
| | |              +------------------------------------------------------------------+----------------+------+---------+----------------+                        |           |                     |
| | +NodeIndexSeek | RANGE INDEX cc:Country(formed) WHERE formed = $autoint_3         |              1 |    0 |       0 |            120 |                    0/0 |     0.000 | Fused in Pipeline 1 |
| |                +------------------------------------------------------------------+----------------+------+---------+----------------+------------------------+-----------+---------------------+
| +Filter          | i.year = $autoint_1 AND cache[p.born] = $autoint_2 AND p:Pioneer |              0 |    0 |       1 |                |                        |           |                     |
| |                +------------------------------------------------------------------+----------------+------+---------+----------------+                        |           |                     |
| +Expand(All)     | (sc)&lt;-[i:INVENTED_BY]-(p)                                        |              1 |    1 |       3 |                |                        |           |                     |
| |                +------------------------------------------------------------------+----------------+------+---------+----------------+                        |           |                     |
| +Filter          | sc:Science                                                       |              1 |    1 |       2 |                |                        |           |                     |
| |                +------------------------------------------------------------------+----------------+------+---------+----------------+                        |           |                     |
| +Expand(All)     | (s)-[anon_0:RESEARCHED]-&gt;(sc)                                    |              1 |    1 |       2 |                |                        |           |                     |
| |                +------------------------------------------------------------------+----------------+------+---------+----------------+                        |           |                     |
| +NodeIndexSeek   | RANGE INDEX s:Scientist(born) WHERE born = $autoint_0            |              1 |    1 |       2 |            120 |                    6/1 |     0.515 | Fused in Pipeline 0 |
+------------------+------------------------------------------------------------------+----------------+------+---------+----------------+------------------------+-----------+---------------------+

Total database accesses: 10, total allocated memory: 768</pre>
</div>
</div>
</div>
<div class="sect2">
<h3 id="_hinting_a_join_for_an_optional_match"><a class="anchor" href="#_hinting_a_join_for_an_optional_match"></a>Hinting a join for an OPTIONAL MATCH</h3>
<div class="paragraph">
<p>A join hint can also be used to force the planner to pick a <code>NodeLeftOuterHashJoin</code> or <code>NodeRightOuterHashJoin</code> to solve an <code>OPTIONAL MATCH</code>.
In most cases, the planner will rather use an <code>OptionalExpand</code>.</p>
</div>
<div class="listingblock">
<div class="title">Query</div>
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">PROFILE
MATCH (s:Scientist {born: 1850})
OPTIONAL MATCH (s)-[:RESEARCHED]-&gt;(sc:Science)
RETURN *</code></pre>
</div>
</div>
<div class="paragraph">
<p>Without any hint, the planner did not use a join to solve the <code>OPTIONAL MATCH</code>.</p>
</div>
<div class="listingblock queryplan">
<div class="title">Query plan</div>
<div class="content">
<pre>Planner COST

Runtime PIPELINED

Runtime version 5.13

Batch size 128

+----------------------+-------------------------------------------------------+----------------+------+---------+----------------+------------------------+-----------+---------------------+
| Operator             | Details                                               | Estimated Rows | Rows | DB Hits | Memory (Bytes) | Page Cache Hits/Misses | Time (ms) | Pipeline            |
+----------------------+-------------------------------------------------------+----------------+------+---------+----------------+------------------------+-----------+---------------------+
| +ProduceResults      | s, sc                                                 |              1 |    1 |       0 |                |                        |           |                     |
| |                    +-------------------------------------------------------+----------------+------+---------+----------------+                        |           |                     |
| +OptionalExpand(All) | (s)-[anon_0:RESEARCHED]-&gt;(sc) WHERE sc:Science        |              1 |    1 |       4 |                |                        |           |                     |
| |                    +-------------------------------------------------------+----------------+------+---------+----------------+                        |           |                     |
| +NodeIndexSeek       | RANGE INDEX s:Scientist(born) WHERE born = $autoint_0 |              1 |    1 |       2 |            120 |                    6/0 |     0.560 | Fused in Pipeline 0 |
+----------------------+-------------------------------------------------------+----------------+------+---------+----------------+------------------------+-----------+---------------------+

Total database accesses: 6, total allocated memory: 184</pre>
</div>
</div>
<div class="listingblock">
<div class="title">Query</div>
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">PROFILE
MATCH (s:Scientist {born: 1850})
OPTIONAL MATCH (s)-[:RESEARCHED]-&gt;(sc:Science)
USING JOIN ON s
RETURN *</code></pre>
</div>
</div>
<div class="paragraph">
<p>Now the planner uses a join to solve the <code>OPTIONAL MATCH</code>.</p>
</div>
<div class="listingblock queryplan">
<div class="title">Query plan</div>
<div class="content">
<pre>Planner COST

Runtime PIPELINED

Runtime version 5.13

Batch size 128

+------------------------+-------------------------------------------------------+----------------+------+---------+----------------+------------------------+-----------+---------------------+
| Operator               | Details                                               | Estimated Rows | Rows | DB Hits | Memory (Bytes) | Page Cache Hits/Misses | Time (ms) | Pipeline            |
+------------------------+-------------------------------------------------------+----------------+------+---------+----------------+------------------------+-----------+---------------------+
| +ProduceResults        | s, sc                                                 |              1 |    1 |       0 |                |                    2/0 |     0.213 |                     |
| |                      +-------------------------------------------------------+----------------+------+---------+----------------+------------------------+-----------+                     |
| +NodeLeftOuterHashJoin | s                                                     |              1 |    1 |       0 |           3112 |                        |     0.650 | In Pipeline 2       |
| |\                     +-------------------------------------------------------+----------------+------+---------+----------------+------------------------+-----------+---------------------+
| | +Expand(All)         | (sc)&lt;-[anon_0:RESEARCHED]-(s)                         |            100 |  100 |     300 |                |                        |           |                     |
| | |                    +-------------------------------------------------------+----------------+------+---------+----------------+                        |           |                     |
| | +NodeByLabelScan     | sc:Science                                            |            100 |  100 |     101 |            120 |                    4/0 |     0.786 | Fused in Pipeline 1 |
| |                      +-------------------------------------------------------+----------------+------+---------+----------------+------------------------+-----------+---------------------+
| +NodeIndexSeek         | RANGE INDEX s:Scientist(born) WHERE born = $autoint_0 |              1 |    1 |       2 |            120 |                    1/0 |     0.214 | In Pipeline 0       |
+------------------------+-------------------------------------------------------+----------------+------+---------+----------------+------------------------+-----------+---------------------+

Total database accesses: 403, total allocated memory: 3192</pre>
</div>
</div>
</div>
</div>
</div>
<nav class="pagination">
  <span class="prev"><a href="../advanced-example/">Advanced query tuning example</a></span>

  <span class="next"><a href="../../execution-plans/">Execution plans</a></span>
</nav>
    <div class="feedback">
    <div class="header question">
        <p><strong>Was this page helpful?</strong></p>

        <svg width="22px" height="22px" viewBox="0 0 22 22" role="button" class="no" aria-label="No, this page isn't helpful">
            <path
                d="M6.25,15.8333333 C6.25,13.7622655 7.92893219,12.0833333 10,12.0833333 C12.0710678,12.0833333 13.75,13.7622655 13.75,15.8333333"
                ></path>
            <circle  cx="10" cy="10" r="9.58333333"></circle>
            <path
                d="M12.5,4.58333333 C12.8934466,4.05873783 13.5109223,3.75 14.1666667,3.75 C14.822411,3.75 15.4398867,4.05873783 15.8333333,4.58333333"
                ></path>
            <line x1="4.58333333" y1="7.91666667" x2="7.08333333" y2="7.91666667" ></line>
            <path
                d="M7.08333333,8.54166667 C6.96827401,8.54166667 6.875,8.44839266 6.875,8.33333333 C6.875,8.21827401 6.96827401,8.125 7.08333333,8.125 C7.19839266,8.125 7.29166667,8.21827401 7.29166667,8.33333333 C7.29166667,8.44839266 7.19839266,8.54166667 7.08333333,8.54166667"
                ></path>
            <line x1="12.9166667" y1="7.91666667" x2="15.4166667" y2="7.91666667" ></line>
            <path
                d="M15.4166667,8.54166667 C15.3016073,8.54166667 15.2083333,8.44839266 15.2083333,8.33333333 C15.2083333,8.21827401 15.3016073,8.125 15.4166667,8.125 C15.531726,8.125 15.625,8.21827401 15.625,8.33333333 C15.625,8.44839266 15.531726,8.54166667 15.4166667,8.54166667"
                ></path>
            <path
                d="M4.16666667,4.58333333 C4.5601133,4.05873783 5.17758895,3.75 5.83333333,3.75 C6.48907772,3.75 7.10655337,4.05873783 7.5,4.58333333"
                ></path>
        </svg>

        <svg width="22px" height="22px" viewBox="0 0 22 22" role="button" class="yes" aria-label="Yes, this page is helpful">
            <circle  cx="10" cy="10" r="9.58333333"></circle>
            <path
                d="M5.41666667,8.125 C5.53172599,8.125 5.625,8.21827401 5.625,8.33333333 C5.625,8.44839266 5.53172599,8.54166667 5.41666667,8.54166667 C5.30160734,8.54166667 5.20833333,8.44839266 5.20833333,8.33333333 C5.20833333,8.21827401 5.30160734,8.125 5.41666667,8.125"
                ></path>
            <path
                d="M14.5833333,8.125 C14.468274,8.125 14.375,8.21827401 14.375,8.33333333 C14.375,8.44839266 14.468274,8.54166667 14.5833333,8.54166667 C14.6983927,8.54166667 14.7916667,8.44839266 14.7916667,8.33333333 C14.7916667,8.21827401 14.6983927,8.125 14.5833333,8.125"
                ></path>
            <path
                d="M13.2275,12.9166657 C13.4853075,12.9162808 13.7287776,13.035241 13.8869095,13.2388563 C14.0450415,13.4424715 14.1000278,13.7078123 14.0358333,13.9575 C13.562901,15.7999679 11.9021969,17.0882321 10,17.0882321 C8.09780311,17.0882321 6.43709903,15.7999679 5.96416667,13.9575 C5.89997223,13.7078123 5.95495852,13.4424715 6.11309045,13.2388563 C6.27122239,13.035241 6.51469246,12.9162808 6.7725,12.9166657 L13.2275,12.9166657 Z"
                ></path>
        </svg>
    </div>


</div></article>
<aside class="toc sidebar" data-title="Contents"
  data-levels="2">
  <div class="toc-menu">
    <div class="toc-menu-placeholder"></div>

      </div>
  </aside>  </div>
</main>
</div>
<footer class="footer">
  <div class="wrapper">
  <div class="column">
    <div class="logo-footer"></div>
    <p> <span id="footer-copyright-year">2023</span> Neo4j, Inc.<br>
      <a href="https://neo4j.com/terms/">Terms</a> | <a href="https://neo4j.com/privacy-policy/">Privacy </a> | <a href="https://neo4j.com/sitemap/">Sitemap</a></p>
    <p>Neo4j<sup></sup>, Neo Technology<sup></sup>, Cypher<sup></sup>, Neo4j<sup></sup> Bloom<sup></sup> and
      Neo4j<sup></sup> Aura<sup></sup> are registered trademarks
      of Neo4j, Inc. All other marks are owned by their respective companies.</p>
  </div>

  <div class="column">
    <h2><a href="https://neo4j.com/contact-us/?ref=footer">Contact Us </a></h2>
    <p>US: 1-855-636-4532<br>
      Sweden +46 171 480 113<br>
      UK: +44 20 3868 3223<br>
      France: +33 (0) 1 88 46 13 20<br>
      <!--Germany: +49 (0)89 26204 6300</p>-->
    </p>
  </div>
  <div class="column links">
    <h2>Learn</h2>
    <ul>
      <li><i class="fa fa-wrench" aria-hidden="true"></i> <a rel="noopener" href="https://neo4j.com/sandbox/?ref=developer-footer">Sandbox</a></li>
      <li><i class="fa fa-comments-o" aria-hidden="true"></i> <a rel="noopener" href="https://community.neo4j.com?ref=developer-footer" target="_blank">Neo4j Community Site</a></li>
      <li><i class="fa fa-book" aria-hidden="true"></i> <a rel="noopener" href="https://medium.com/neo4j" target="_blank">Neo4j Developer Blog</a></li>
      <li><i class="fa fa-youtube" aria-hidden="true"></i> <a rel="noopener" href="https://www.youtube.com/neo4j" target="_blank">Neo4j Videos</a></li>
      <li><i class="fa fa-graduation-cap" aria-hidden="true"></i> <a rel="noopener" href="https://neo4j.com/graphacademy/?ref=developer-footer">GraphAcademy</a></li>
      <li><i class="fa fa-flask" aria-hidden="true"></i> <a href="https://neo4j.com/labs/?ref=developer-footer">Neo4j Labs</a></li>
    </ul>
  </div>
  <div class="column links">
    <h2>Social</h2>
    <ul>
      <li><i class="fa fa-twitter" aria-hidden="true"></i> <a rel="noopener" href="https://twitter.com/neo4j" target="_blank">Twitter</a></li>
      <li><i class="fa fa-meetup" aria-hidden="true"></i> <a rel="noopener" href="https://www.meetup.com/Neo4j-Online-Meetup/" target="_blank">Meetups</a></li>
      <li><i class="fa fa-github" aria-hidden="true"></i> <a rel="noopener" href="https://github.com/neo4j/neo4j" target="_blank">Github</a></li>
      <li><i class="fa fa-stack-overflow" aria-hidden="true"></i> <a rel="noopener" href="https://stackoverflow.com/questions/tagged/neo4j" target="_blank">Stack Overflow</a></li>

      <li class="speaker-program"><a href="https://docs.google.com/forms/d/e/1FAIpQLSdEcNnMruES5iwvOVYovmS1D_P1ZL_HdUOitFrwrvruv5PZvA/viewform">Want to Speak?</a></li>
    </ul>
  </div>
</div>
</footer>

  <script src="../../../../assets/js/vendor/auth0.js"></script>
  <script src="../../../../assets/js/site.js"></script>
  <script async src="../../../../assets/js/vendor/highlight.js"></script>
  <script async src="../../../../assets/js/vendor/image-zoom.js"></script>


<div id="neo4j-algolia-search-v2"></div>
<script src="https://neo4j.com/wp-content/themes/neo4jweb/assets/neo4j-react-modules-assets/search-preact/chunkless/bundle.js"></script>
<script src="https://neo4j.com/wp-content/themes/neo4jweb/assets/neo4j-react-modules-assets/search-preact/chunkless/polyfill.js"></script>
<script>window.algoliaSearchOptions = {indexName: "docs",placeholder: "Search Documentation",template: "docs"}</script>  </body>
</html>
