<!DOCTYPE html>
<html lang="en">
  <head>
    <meta charset="utf-8">
    <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=5, minimum-scale=1">
    <meta name="msvalidate.01" content="B5163518CBE4A854B63801277FE5E35C" />
    <meta name="google-site-verification" content="ucqagxjVuq0lJZeLKs0F5AppzK111lNt3IoxU6mzlJE" />
    <meta name="robots" content="index, follow" />
    <meta name="googlebot" content="index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1" />
    <meta name="bingbot" content="index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1" />

    <meta property="og:locale" content="en_US" />
    <meta property="og:type" content="article" />

<script>(function(w,d,s,l,i){w[l]=w[l]||[];w[l].push({'gtm.start':new Date().getTime(),event:'gtm.js'});var f=d.getElementsByTagName(s)[0],j=d.createElement(s),dl=l!='dataLayer'?'&l='+l:'';j.async=true;j.src='https://www.googletagmanager.com/gtm.js?id='+i+dl;f.parentNode.insertBefore(j,f);})(window,document,'script','dataLayer','GTM-WK23PSS');</script>
<!-- Hotjar Tracking Code for staging -->
<script>
    (function(h,o,t,j,a,r){
        h.hj=h.hj||function(){(h.hj.q=h.hj.q||[]).push(arguments)};
        h._hjSettings={hjid:3587741,hjsv:6};
        a=o.getElementsByTagName('head')[0];
        r=o.createElement('script');r.async=1;
        r.src=t+h._hjSettings.hjid+j+h._hjSettings.hjsv;
        a.appendChild(r);
    })(window,document,'https://static.hotjar.com/c/hotjar-','.js?sv=');
</script>
<!-- End Hotjar Tracking code -->
    <title>Basic queries - Cypher Manual</title>
    <link rel="prev" href="../concepts/">
    <link rel="next" href="../expressions/">
      <meta name="description" content="This section provides an overview of some basic Cypher queries using the Neo4j movie database.">
<link rel="stylesheet" href="https://neo4j.com/wp-content/themes/neo4jweb/assets/neo4j-react-modules-assets/search-preact/chunkless/bundle.css" />
<link rel="stylesheet" href="https://neo4j.com/wp-content/themes/neo4jweb/assets/neo4j-react-modules-assets/search-preact/chunkless/utilities.min.css" />

    <link rel="preload" href="../../../../assets/fonts/fontawesome-webfont.woff2?v=4.7.0" as="font">
    <link rel="stylesheet" href="../../../../assets/css/site.css">
    <link href="https://fonts.googleapis.com/css2?family=Nunito+Sans:wght@300;400;600;700&display=swap" rel="stylesheet">

    <link rel="shortcut icon" href="https://neo4j.com/wp-content/themes/neo4jweb/favicon.ico" />



    <meta property="neo:type" content="Docs">
    <meta property="neo:site" content="Reference Docs">


    <meta property="og:site_name" content="Neo4j Graph Data Platform" />
    <meta property="article:publisher" content="https://www.facebook.com/neo4j.graph.database" />
    <meta name="twitter:card" content="summary_large_image" />
    <meta name="twitter:creator" content="@neo4j" />
    <meta name="twitter:site" content="@neo4j" />
    <meta property="og:type" content="article" />
    <meta property="og:title" content="Basic queries - Cypher Manual" />
    <meta property="og:locale" content="en_US" />
    <meta property="og:image" content="https://dist.neo4j.com/wp-content/uploads/20210423062553/neo4j-social-share-21.png" />
    <meta property="og:description" content="This section provides an overview of some basic Cypher queries using the Neo4j movie database." />
    <meta property="og:url" content="https://neo4j.com/docs/cypher-manual/5/queries/basic/" />
    <link rel="shortcut icon" href="https://neo4j.com/wp-content/themes/neo4jweb/favicon.ico" />
  </head>
  <body class="article docs">
<!-- Google Tag Manager (noscript) -->
<noscript><iframe src="https://www.googletagmanager.com/ns.html?id=GTM-WK23PSS"
height="0" width="0" style="display:none;visibility:hidden"></iframe></noscript>
<!-- End Google Tag Manager (noscript) -->
<script>(function(f,b){if(!b.__SV){var e,g,i,h;window.mixpanel=b;b._i=[];b.init=function(e,f,c){function g(a,d){var b=d.split(".");2==b.length&&(a=a[b[0]],d=b[1]);a[d]=function(){a.push([d].concat(Array.prototype.slice.call(arguments,0)))}}var a=b;"undefined"!==typeof c?a=b[c]=[]:c="mixpanel";a.people=a.people||[];a.toString=function(a){var d="mixpanel";"mixpanel"!==c&&(d+="."+c);a||(d+=" (stub)");return d};a.people.toString=function(){return a.toString(1)+".people (stub)"};i="disable time_event track track_pageview track_links track_forms track_with_groups add_group set_group remove_group register register_once alias unregister identify name_tag set_config reset opt_in_tracking opt_out_tracking has_opted_in_tracking has_opted_out_tracking clear_opt_in_out_tracking start_batch_senders people.set people.set_once people.unset people.increment people.append people.union people.track_charge people.clear_charges people.delete_user people.remove".split(" ");
for(h=0;h<i.length;h++)g(a,i[h]);var j="set set_once union unset remove delete".split(" ");a.get_group=function(){function b(c){d[c]=function(){call2_args=arguments;call2=[c].concat(Array.prototype.slice.call(call2_args,0));a.push([e,call2])}}for(var d={},e=["get_group"].concat(Array.prototype.slice.call(arguments,0)),c=0;c<j.length;c++)b(j[c]);return d};b._i.push([e,f,c])};b.__SV=1.2;e=f.createElement("script");e.type="text/javascript";e.async=!0;e.src="undefined"!==typeof MIXPANEL_CUSTOM_LIB_URL?
MIXPANEL_CUSTOM_LIB_URL:"file:"===f.location.protocol&&"//cdn.mxpnl.com/libs/mixpanel-2-latest.min.js".match(/^\/\//)?"https://cdn.mxpnl.com/libs/mixpanel-2-latest.min.js":"//cdn.mxpnl.com/libs/mixpanel-2-latest.min.js";g=f.getElementsByTagName("script")[0];g.parentNode.insertBefore(e,g)}})(document,window.mixpanel||[]);
mixpanel.init("4bfb2414ab973c741b6f067bf06d5575", {batch_requests: true})
mixpanel.track("Page View", {
    pathname: window.location.origin + window.location.pathname,
    search: window.location.search,
    hash: window.location.hash,
    referrer: document.referrer,
})
</script>
<header class="header">
  <nav class="navbar">
    <div class="navbar-brand">
      <a class="navbar-item" href="/">

      <img class="navbar-logo" src="https://dist.neo4j.com/wp-content/uploads/20210422142941/neo4j-logo-2020.svg" alt="Neo4j Docs" />
      <a href="/docs/" class="navbar-item no-left-padding" aria-label="Docs">
        Docs
      </a>

      </div>

      <button class="navbar-search search-button" data-target="topbar-nav" id="search_open_mobile" aria-label="Open Search">
        <svg width="23px" height="23px" viewBox="0 0 23 23" version="1.1" class="fill-current float-right" id="searchx" role="button" title="Search Website">
          <g stroke="none" stroke-width="1" fill="none" fill-rule="evenodd" stroke-linecap="round"
            stroke-linejoin="round">
            <g transform="translate(-2.000000, -2.000000)" stroke="#a0aec0" stroke-width="1.5">
              <circle
                transform="translate(11.389364, 11.388564) rotate(-23.025000) translate(-11.389364, -11.388564) "
                cx="11.3893642" cy="11.3885639" r="8.056"></circle>
              <path d="M17.0853333,17.0844444 L23.3333333,23.3333333" ></path>
            </g>
          </g>
        </svg>
      </button>
      <button class="navbar-burger" data-target="topbar-nav" aria-label="Mobile Navigation Button">
        <span></span>
        <span></span>
        <span></span>
      </button>
    </div>
    <div id="topbar-nav" class="navbar-menu">
            <div class="navbar-end">


        <div class="navbar-item has-dropdown is-hoverable docs">
          <a class="navbar-link" href="/docs/">Docs</a>
          <div class="navbar-dropdown">
            <div class="navbar-item project">
              <span class="project-name">Neo4j DBMS</span>
              <ul class="project-links">
                <li><a href="/docs/getting-started/current/" class="project-link">Getting Started</a></li>
                <li><a href="/docs/operations-manual/current/" class="project-link">Operations</a></li>
                <li><a href="/docs/migration-guide/current/" class="project-link">Migration and Upgrade</a></li>
                <li><a href="/docs/status-codes/current/" class="project-link">Status Codes</a></li>
                <li><a href="/docs/java-reference/current/" class="project-link">Java Reference</a></li>
                <li><a href="/docs/kerberos-add-on/current/" class="project-link">Kerberos Add-on</a></li>
              </ul>
            </div>

            <div class="navbar-item project">
              <a class="project-name" href="/docs/aura/">Neo4j Aura</a>
              <ul class="project-links">
                <li><a class="project-link" href="/docs/aura">Neo4j Aura</a></li>
                <li><a class="project-link" href="/docs/aura/auradb/">Neo4j AuraDB</a></li>
                <li><a class="project-link" href="/docs/aura/aurads/">Neo4j AuraDS</a></li>
              </ul>
            </div>

            <div class="navbar-item project">
              <span class="project-name">Neo4j Tools</span>
              <ul class="project-links">
                <li><a href="/docs/bloom-user-guide/current/" class="project-link">Neo4j Bloom</a></li>
                <li><a href="/docs/browser-manual/current/" class="project-link">Neo4j Browser</a></li>
                <li><a href="/docs/data-importer/current/" class="project-link">Neo4j Data Importer</a></li>
                <li><a href="/docs/desktop-manual/current/" class="project-link">Neo4j Desktop</a></li>
                <li><a href="/docs/ops-manager/current/" class="project-link">Neo4j Ops Manager</a></li>
              </ul>
            </div>

            <div class="navbar-item project">
              <span class="project-name">Neo4j Graph Data Science</span>
              <ul class="project-links">
                <li><a href="/docs/graph-data-science/current/" class="project-link">Neo4j Graph Data Science Library</a></li>
              </ul>
            </div>

            <div class="navbar-item project">
              <span class="project-name">Cypher Query Language</span>
              <ul class="project-links">
                <li><a href="/docs/cypher-manual/current/" class="project-link">Cypher</a></li>
                <li><a href="/docs/cypher-cheat-sheet/current/" class="project-link">Cypher Cheat Sheet</a></li>
                <li><a href="/docs/apoc/current/" class="project-link">APOC Library</a></li>
              </ul>
            </div>

            <div class="navbar-item project">
              <span class="project-name" href="/docs/drivers-apis">Create applications</span>
              <ul class="project-links">
                <li><a href="/docs/python-manual/current/" class="project-link">Python Driver</a></li>
                <li><a href="/docs/go-manual/current/" class="project-link">Go Driver</a></li>
                <li><a href="/docs/java-manual/current/" class="project-link">Java Driver</a></li>
                <li><a href="/docs/javascript-manual/current/" class="project-link">JavaScript Driver</a></li>
                <li><a href="/docs/dotnet-manual/current/" class="project-link">.Net Driver</a></li>
                <li><a href="/docs/graphql-manual/current/" class="project-link">Neo4j GraphQL Library</a></li>
                <li><a href="/docs/http-api/current/" class="project-link">HTTP API</a></li>
                <li><a href="/docs/ogm-manual/current/" class="project-link">OGM Library</a></li>
                <li><a href="https://docs.spring.io/spring-data/neo4j/docs/current/reference/html/#reference" class="project-link">Spring Data Neo4j</a></li>
                <li><a href="/docs/spark/" class="project-link">Neo4j Connector for Apache Spark</a></li>
                <li><a href="/docs/kafka/" class="project-link">Neo4j Connector for Apache Kafka</a></li>
              </ul>
            </div>

          </div>
        </div>
        <div class="navbar-item has-dropdown is-hoverable labs">
          <a class="navbar-link" href="/labs/">Labs</a>
          <div class="navbar-dropdown">
            <div class="navbar-item project">
              <a class="project-name" href="/labs/arrows/">arrows.app</a>
              <ul class="project-links">
                <li><a href="/labs/arrows/" class="project-link">Details</a></li>
                <li><a href="https://arrows.app" class="project-link">arrows.app</a></li>
              </ul>
            </div>
            <div class="navbar-item project">
              <a class="project-name" href="/labs/apoc/">APOC Extended</a>

              <ul class="project-links">
                <li><a href="/labs/apoc/5/" class="project-link">Documentation</a></li>
                <li><a href="/developer/neo4j-apoc/" class="project-link">Developer Guide</a></li>
              </ul>
            </div>
            <div class="navbar-item project">
              <a class="project-name" href="/labs/halin/">Halin</a>
            </div>
            <div class="navbar-item project">
              <a class="project-name" href="/labs/etl-tool/">ETL Tool</a>
              <ul class="project-links">
                <li><a href="/labs/etl-tool/" class="project-link">Details</a></li>
                <li><a href="/labs/etl-tool/1.5.0/" class="project-link">Documentation</a></li>
              </ul>
            </div>
            <div class="navbar-item project">
              <a class="project-name" href="/labs/neo4j-migrations/">Neo4j Migrations</a>
              <ul class="project-links">
                <li><a href="/labs/neo4j-migrations/" class="project-link">Details</a></li>
                <li><a href="/labs/neo4j-migrations/2.0/" class="project-link">Documentation</a></li>
              </ul>
            </div>
            <div class="navbar-item project">
              <a class="project-name" href="/labs/liquibase/">Neo4j Plugin For Liquibase</a>
              <ul class="project-links">
                <li><a href="/labs/liquibase/" class="project-link">Details</a></li>
                <li><a href="https://github.com/liquibase/liquibase-neo4j" class="project-link">Documentation</a></li>
              </ul>
            </div>
            <div class="navbar-item project">
              <a class="project-name" href="/labs/neosemantics/">Neosemantics</a>
              <ul class="project-links">
                <li><a href="/labs/neosemantics/tutorial/" class="project-link">Getting Started</a></li>
                <li><a href="/labs/neosemantics/4.0/" class="project-link">Documentation</a></li>
              </ul>
            </div>
            <div class="navbar-item project">
              <a class="project-name" href="/labs/neo4j-helm/">Neo4j Helm</a>
              <ul class="project-links">
                <li><a href="/labs/neo4j-helm/" class="project-link">Details</a></li>
                <li><a href="/labs/neo4j-helm/1.0.0/" class="project-link">Documentation</a></li>
              </ul>
            </div>
            <div class="navbar-item project">
              <a class="project-name" href="/labs/neodash/">NeoDash</a>
              <ul class="project-links">
                <li><a href="/labs/neodash/" class="project-link">Details</a></li>
                <li><a href="/labs/neodash/2.1/" class="project-link">Documentation</a></li>
              </ul>
            </div>
            <div class="navbar-item project">
              <a class="project-name" href="/labs/neomodel/">neomodel</a>
              <ul class="project-links">
                <li><a href="/labs/neomodel/" class="project-link">Details</a></li>
                <li><a href="https://neomodel.readthedocs.io/en/latest/" target="_blank" class="project-link">Documentation</a></li>
              </ul>
            </div>
          </div>
        </div>
        <div class="navbar-item has-dropdown is-hoverable developer">
          <a class="navbar-link" href="/developer/resources/">Get Help</a>
          <div class="navbar-dropdown">
            <div class="navbar-item project">
              <a class="project-name" href="https://graphacademy.neo4j.com/?ref=docs" target="_blank">GraphAcademy</a>
              <ul class="project-links">
                <li><a class="project-link" href="https://graphacademy.neo4j.com/?ref=docs">Free, Self Paced Training</a></li>
                <li><a class="project-link" href="https://graphacademy.neo4j.com/certification/?ref=docs" target="_blank">Certification</a></li>
              </ul>
            </div>

            <div class="navbar-item project">
              <a class="project-name" href="https://dev.neo4j.com/forum" target="_blank">Community Forum</a>
            </div>
            <div class="navbar-item project">
              <a class="project-name" href="https://dev.neo4j.com/chat" target="_blank">Discord Chat</a>
            </div>
            <div class="navbar-item project">
              <a class="project-name" href="/developer/kb" target="_blank">Knowledge Base</a>
            </div>
            <div class="navbar-item project">
              <a class="project-name" href="https://medium.com/neo4j" target="_blank">Neo4j Developer Blog</a>
            </div>
            <div class="navbar-item project">
              <a class="project-name" href="https://www.youtube.com/neo4j" target="_blank">Neo4j Videos</a>
            </div>
          </div>
        </div>
        <div class="navbar-item is-hoverable getting-started-cta">
          <a class="navbar-link primary" href="https://neo4j.com/cloud/platform/aura-graph-database/?ref=docs-nav-get-started">Get Started Free</a>
        </div>
        <div class="navbar-item">
          <a class="navbar-link search-button" href="#search" id="search_open"><svg width="23px" height="23px" viewBox="0 0 23 23"
              version="1.1" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink"
              class="fill-current float-right" id="search" role="button" title="Search Website">
              <g stroke="none" stroke-width="1" fill="none" fill-rule="evenodd" stroke-linecap="round"
                stroke-linejoin="round">
                <g transform="translate(-2.000000, -2.000000)" stroke="#a0aec0" stroke-width="1.5">
                  <circle
                    transform="translate(11.389364, 11.388564) rotate(-23.025000) translate(-11.389364, -11.388564) "
                    cx="11.3893642" cy="11.3885639" r="8.056"></circle>
                  <path d="M17.0853333,17.0844444 L23.3333333,23.3333333" ></path>
                </g>
              </g>
            </svg><span class="navbar-mobile">Search</span></a>
        </div>
      </div>
    </div>
  </nav>
</header>
<div class="body">
<div class="nav-container" data-component="cypher-manual" data-version="5">
  <aside class="nav">
    <div class="panels">
      <div class="selectors">
        
      </div>
      <div class="nav-panel-menu is-active" data-panel="menu">
    <nav class="nav-menu">
    <ul class="nav-list">
  <li class="nav-item" data-depth="0">
<ul class="nav-list">
  <li class="nav-item" data-depth="1">
    <a class="nav-link nav-item-toggle" href="../../introduction/">Introduction</a>
<ul class="nav-list">
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../introduction/cypher_overview/">Overview</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../introduction/cypher_neo4j/">Cypher and Neo4j</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../introduction/cypher_aura/">Cypher and Aura</a>
  </li>
</ul>
  </li>
  <li class="nav-item" data-depth="1">
    <a class="nav-link nav-item-toggle" href="../">Queries</a>
<ul class="nav-list">
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../concepts/">Core concepts</a>
  </li>
  <li class="nav-item is-current-page" data-depth="2">
    <a class="nav-link" href="./">Basic queries</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../expressions/">Cypher expressions</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../case/">Conditional expressions (CASE)</a>
  </li>
</ul>
  </li>
  <li class="nav-item" data-depth="1">
    <a class="nav-link nav-item-toggle" href="../../clauses/">Clauses</a>
<ul class="nav-list">
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../clauses/clause_composition/">Clause composition</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../clauses/match/">MATCH</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../clauses/optional-match/">OPTIONAL MATCH</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../clauses/return/">RETURN</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../clauses/with/">WITH</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../clauses/unwind/">UNWIND</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../clauses/where/">WHERE</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../clauses/order-by/">ORDER BY</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../clauses/skip/">SKIP</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../clauses/limit/">LIMIT</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../clauses/create/">CREATE</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../clauses/delete/">DELETE</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../clauses/set/">SET</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../clauses/remove/">REMOVE</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../clauses/foreach/">FOREACH</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../clauses/merge/">MERGE</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../clauses/call/">CALL procedure</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../clauses/union/">UNION</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../clauses/use/">USE</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../clauses/load-csv/">LOAD CSV</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../clauses/listing-functions/">SHOW FUNCTIONS</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../clauses/listing-procedures/">SHOW PROCEDURES</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../clauses/listing-settings/">SHOW SETTINGS</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../clauses/transaction-clauses/#query-listing-transactions">SHOW TRANSACTIONS</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../clauses/transaction-clauses/#query-terminate-transactions">TERMINATE TRANSACTIONS</a>
  </li>
</ul>
  </li>
  <li class="nav-item" data-depth="1">
    <a class="nav-link nav-item-toggle" href="../../subqueries/">Subqueries</a>
<ul class="nav-list">
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../subqueries/call-subquery/">CALL subqueries</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../subqueries/subqueries-in-transactions/">CALL subqueries in transactions</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../subqueries/existential/">EXISTS subqueries</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../subqueries/count/">COUNT subqueries</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../subqueries/collect/">COLLECT subqueries</a>
  </li>
</ul>
  </li>
  <li class="nav-item" data-depth="1">
    <a class="nav-link nav-item-toggle" href="../../patterns/">Patterns</a>
<ul class="nav-list">
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../patterns/concepts/">Concepts</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../patterns/primer/">Primer</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../patterns/reference/">Syntax and semantics</a>
  </li>
</ul>
  </li>
  <li class="nav-item" data-depth="1">
    <a class="nav-link nav-item-toggle" href="../../values-and-types/">Values and types</a>
<ul class="nav-list">
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../values-and-types/property-structural-constructed/">Property, structural, and constructed values</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../values-and-types/temporal/">Temporal values</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../values-and-types/spatial/">Spatial values</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../values-and-types/working-with-null/">Working with <code>null</code></a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../values-and-types/lists/">Lists</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../values-and-types/maps/">Maps</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../values-and-types/casting-data/">Casting data values</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../values-and-types/type-predicate/">Type predicate expressions</a>
  </li>
</ul>
  </li>
  <li class="nav-item" data-depth="1">
    <a class="nav-link nav-item-toggle" href="../../functions/">Functions</a>
<ul class="nav-list">
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../functions/predicate/">Predicate functions</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../functions/scalar/">Scalar functions</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../functions/aggregating/">Aggregating functions</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../functions/list/">List functions</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../functions/mathematical-numeric/">Mathematical functions - numeric</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../functions/mathematical-logarithmic/">Mathematical functions - logarithmic</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../functions/mathematical-trigonometric/">Mathematical functions - trigonometric</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../functions/string/">String functions</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../functions/temporal/">Temporal functions - instant types</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../functions/temporal/duration/">Temporal functions - duration</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../functions/spatial/">Spatial functions</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../functions/load-csv/">LOAD CSV functions</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../functions/graph/">Graph functions</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../functions/database/">Database functions</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../functions/user-defined/">User-defined functions</a>
  </li>
</ul>
  </li>
  <li class="nav-item" data-depth="1">
    <a class="nav-link" href="../../indexes-for-search-performance/">Indexes for search performance</a>
  </li>
  <li class="nav-item" data-depth="1">
    <a class="nav-link" href="../../indexes-for-full-text-search/">Full-text search index</a>
  </li>
  <li class="nav-item" data-depth="1">
    <a class="nav-link" href="../../indexes-for-vector-search/">Vector search index</a>
  </li>
  <li class="nav-item" data-depth="1">
    <a class="nav-link nav-item-toggle" href="../../constraints/">Constraints</a>
<ul class="nav-list">
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../constraints/syntax/">Syntax</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../constraints/examples/">Examples</a>
  </li>
</ul>
  </li>
  <li class="nav-item" data-depth="1">
    <a class="nav-link nav-item-toggle" href="../../query-tuning/">Query tuning</a>
<ul class="nav-list">
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../query-tuning/query-options/">Cypher query options</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../query-tuning/query-profile/">Profile a query</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../query-tuning/indexes/">The use of indexes</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../query-tuning/basic-example/">Basic query tuning example</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../query-tuning/advanced-example/">Advanced query tuning example</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../query-tuning/using/">Planner hints and the USING keyword</a>
  </li>
</ul>
  </li>
  <li class="nav-item" data-depth="1">
    <a class="nav-link nav-item-toggle" href="../../execution-plans/">Execution plans</a>
<ul class="nav-list">
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../execution-plans/db-hits/">Database hits</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../execution-plans/operator-summary/">Execution plan operators</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../execution-plans/operators/">Execution plan operators in detail</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../execution-plans/shortestpath-planning/">Shortest path planning</a>
  </li>
</ul>
  </li>
  <li class="nav-item" data-depth="1">
    <a class="nav-link nav-item-toggle" href="../../query-caches/">Query caches</a>
<ul class="nav-list">
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../query-caches/unified-query-caches/">Unifying query caches</a>
  </li>
</ul>
  </li>
  <li class="nav-item" data-depth="1">
    <a class="nav-link nav-item-toggle" href="../../administration/">Administration</a>
<ul class="nav-list">
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../administration/databases/">Database management</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../administration/aliases/">Database alias management</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../administration/servers/">Server management</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link nav-item-toggle" href="../../administration/access-control/">Access control</a>
<ul class="nav-list">
  <li class="nav-item" data-depth="3">
    <a class="nav-link" href="../../administration/access-control/manage-users/">Managing users</a>
  </li>
  <li class="nav-item" data-depth="3">
    <a class="nav-link" href="../../administration/access-control/manage-roles/">Managing roles</a>
  </li>
  <li class="nav-item" data-depth="3">
    <a class="nav-link" href="../../administration/access-control/manage-privileges/">Managing privileges</a>
  </li>
  <li class="nav-item" data-depth="3">
    <a class="nav-link" href="../../administration/access-control/built-in-roles/">Built-in roles and privileges</a>
  </li>
  <li class="nav-item" data-depth="3">
    <a class="nav-link" href="../../administration/access-control/privileges-reads/">Read privileges</a>
  </li>
  <li class="nav-item" data-depth="3">
    <a class="nav-link" href="../../administration/access-control/privileges-writes/">Write privileges</a>
  </li>
  <li class="nav-item" data-depth="3">
    <a class="nav-link" href="../../administration/access-control/database-administration/">Database administration</a>
  </li>
  <li class="nav-item" data-depth="3">
    <a class="nav-link" href="../../administration/access-control/dbms-administration/">DBMS administration</a>
  </li>
  <li class="nav-item" data-depth="3">
    <a class="nav-link" href="../../administration/access-control/load-privileges/">Load privileges</a>
  </li>
  <li class="nav-item" data-depth="3">
    <a class="nav-link" href="../../administration/access-control/limitations/">Limitations</a>
  </li>
  <li class="nav-item" data-depth="3">
    <a class="nav-link" href="../../administration/access-control/privileges-immutable/">Immutable privileges</a>
  </li>
</ul>
  </li>
</ul>
  </li>
  <li class="nav-item" data-depth="1">
    <a class="nav-link nav-item-toggle" href="../../syntax/">Syntax</a>
<ul class="nav-list">
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../syntax/parsing/">Parsing</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../syntax/naming/">Naming rules and recommendations</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../syntax/variables/">Variables</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../syntax/reserved/">Reserved keywords</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../syntax/parameters/">Parameters</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../syntax/operators/">Operators</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../syntax/comments/">Comments</a>
  </li>
</ul>
  </li>
  <li class="nav-item" data-depth="1">
    <a class="nav-link" href="../../deprecations-additions-removals-compatibility/">Deprecations, additions, and compatibility</a>
  </li>
  <li class="nav-item" data-depth="1">
    <a class="nav-link" href="../../keyword-glossary/">Glossary of keywords</a>
  </li>
  <li class="nav-item" data-depth="1">
    <span class="nav-text nav-item-toggle">Appendix</span>
<ul class="nav-list">
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../styleguide/">Cypher styleguide</a>
  </li>
</ul>
  </li>
</ul>
  </li>
</ul>
  </nav>
</div>
    </div>
  </aside>
</div>
<main class="article">
<div class="toolbar" role="navigation">
  <div class="toolbar-wrapper">
    <button class="nav-toggle" aria-label="Toggle Table of Contents"></button>
    <a href="../../introduction/" class="home-link" aria-label="Go to home page"></a>
    <nav class="breadcrumbs" aria-label="breadcrumbs">
  <ul>
    <li><a href="../../introduction/">Cypher Manual</a></li>
    <li><a href="../">
        Queries
    </a></li>
    <li><a href="./">
        Basic queries
    </a></li>
  </ul>
</nav>
      </div>
</div>

  <div class="content">
<article class="doc">
<div class="sect-header">
<h1 class="page">Basic queries</h1>
</div>





<div id="preamble">
<div class="sectionbody">
<div class="paragraph">
<p>This page contains information about how to create, query, and delete a graph database using Cypher<sup>&reg;</sup>.
For more advanced queries, see the section on <a href="../../subqueries/" class="xref page">Subqueries</a>.</p>
</div>
<div class="paragraph">
<p>The examples below uses the publicly available <a href="https://github.com/neo4j-graph-examples/movies/tree/main/documentation">Neo4j movie database</a>.</p>
</div>
</div>
</div>
<div class="sect1">
<h2 id="data-model"><a class="anchor" href="#data-model"></a>Creating a data model</h2>
<div class="sectionbody">
<div class="paragraph">
<p>Before creating a <a href="https://qubitpi.github.io/neo4j-docs-getting-started/getting-started/get-started-with-neo4j/graph-database/#property-graph">property graph</a> database, it is important to develop an appropriate data model.
This will provide structure to the data, and allow users of the graph to efficiently retrieve the information they are looking for.</p>
</div>
<div class="paragraph">
<p>The following data model is used for the Neo4j data model:</p>
</div>
<div class="imageblock middle">
<div class="content">
<img src="../../_images/introduction_schema.svg" alt="introduction schema" width="800">
</div>
</div>
<div class="paragraph">
<p>It includes two types of node labels:</p>
</div>
<div class="ulist">
<ul>
<li>
<p><code>Person</code> nodes, which have the following properties: <code>name</code> and <code>born</code>.</p>
</li>
<li>
<p><code>Movie</code> nodes, which have the following properties: <code>title</code>, <code>released</code>, and <code>tagline</code>.</p>
</li>
</ul>
</div>
<div class="paragraph">
<p>The data model also contains five different relationship types between the <code>Person</code> and <code>Movie</code> nodes: <code>ACTED_IN</code>, <code>DIRECTED</code>, <code>PRODUCED</code>, <code>WROTE</code>, and <code>REVIEWED</code>. Two of the relationship types have properties:</p>
</div>
<div class="ulist">
<ul>
<li>
<p>The <code>ACTED_IN</code> relationship type, which has the <code>roles</code> property.</p>
</li>
<li>
<p>The <code>REVIEWED</code> relationship type, which has a <code>summary</code> property and a <code>rating</code> property.</p>
</li>
</ul>
</div>
<div class="paragraph">
<p><em>To learn more about data modelling for graph databases, enroll in the free
<a href="https://graphacademy.neo4j.com/courses/modeling-fundamentals/">Graph Data Modelling Fundamentals</a> course offered by GraphAcademy.</em></p>
</div>
</div>
</div>
<div class="sect1">
<h2 id="create-graph"><a class="anchor" href="#create-graph"></a>Creating a property graph database</h2>
<div class="sectionbody">
<div class="paragraph">
<p>The complete Cypher query to create the Neo4j movie database, can be found <a href="https://github.com/neo4j-graph-examples/movies/blob/main/scripts/movies.cypher">here</a>.
To create the full graph, run the full query against an empty Neo4j database.</p>
</div>
</div>
</div>
<div class="sect1">
<h2 id="find-nodes"><a class="anchor" href="#find-nodes"></a>Finding nodes</h2>
<div class="sectionbody">
<div class="paragraph">
<p>The <code>MATCH</code> clause is used to find a specific pattern in the graph, such as a specific node.
The <code>RETURN</code> clause specifies what of the found graph pattern to return.</p>
</div>
<div class="paragraph">
<p>For example, this query will find the nodes with <code>Person</code> label and the name <code>Keanu Reeves</code>, and return the <code>name</code> and <code>born</code> properties of the found nodes:</p>
</div>
<div class="listingblock">
<div class="title">Query</div>
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (keanu:Person {name:'Keanu Reeves'})
RETURN keanu.name AS name, keanu.born AS born</code></pre>
</div>
</div>
<table class="tableblock frame-all grid-all stretch queryresult">
<caption class="title">Table 1. Result</caption>
<colgroup>
<col style="width: 50%;">
<col style="width: 50%;">
</colgroup>
<thead>
<tr>
<th class="tableblock halign-left valign-top">name</th>
<th class="tableblock halign-left valign-top">born</th>
</tr>
</thead>
<tbody>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Keanu Reeves"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>1964</code></p></td>
</tr>
</tbody>
<tfoot>
<tr>
<td class="tableblock halign-left valign-top" colspan="2"><p class="tableblock">Rows: 1</p></td>
</tr>
</tfoot>
</table>
<div class="paragraph">
<p>It is also possible to query a graph for several nodes.
This query matches all nodes with the <code>Person</code> label, and limits the results to only include five rows.</p>
</div>
<div class="listingblock test-result-skip">
<div class="title">Query</div>
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (people:Person)
RETURN people
LIMIT 5</code></pre>
</div>
</div>
<table class="tableblock frame-all grid-all stretch queryresult">
<caption class="title">Table 2. Result</caption>
<colgroup>
<col style="width: 100%;">
</colgroup>
<thead>
<tr>
<th class="tableblock halign-left valign-top">people</th>
</tr>
</thead>
<tbody>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>{"born":1964,"name":"Keanu Reeves"}</code></p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>{"born":1967,"name":"Carrie-Anne Moss"}</code></p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>{"born":1961,"name":"Laurence Fishburne"}</code></p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>{"born":1960,"name":"Hugo Weaving"}</code></p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>{"born":1967,"name":"Lilly Wachowski"}</code></p></td>
</tr>
</tbody>
<tfoot>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock">Rows: 5</p></td>
</tr>
</tfoot>
</table>
</div>
</div>
<div class="sect1">
<h2 id="clause-composition-note"><a class="anchor" href="#clause-composition-note"></a>Note on clause composition</h2>
<div class="sectionbody">
<div class="paragraph">
<p>Similar to SQL, Cypher queries are constructed using various clauses which are chained together to feed intermediate results between each other.
Each clause has as input the state of the graph and a table of intermediate results consisting of the referenced variables.
The first clause takes as input the state of the graph before the query and an empty table of intermediate results.
The output of a clause is a new state of the graph and a new table of intermediate results, serving as input to the next clause.
The output of the last clause is the result of the query.</p>
</div>
<div class="paragraph">
<p>Note that if one of the clauses returns an empty table of intermediate results, there is nothing to pass on to subsequent clauses, thus ending the query.
(There are ways to circumvent this behaviour.
For example, by replacing a <code>MATCH</code> clause with <a href="../../clauses/optional-match/" class="xref page">OPTIONAL MATCH</a>.)</p>
</div>
<div class="paragraph">
<p>In the below example, the first <code>MATCH</code> clause finds all nodes with the <code>Person</code> label.
The second clause will then filter those nodes to find all <code>Person</code> nodes who were born in the 1980s.
The final clause returns the result in a descending chronological order.</p>
</div>
<div class="listingblock">
<div class="title">Query</div>
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (bornInEighties:Person)
WHERE bornInEighties.born &gt;= 1980 AND bornInEighties.born &lt; 1990
RETURN bornInEighties.name as name, bornInEighties.born as born
ORDER BY born DESC</code></pre>
</div>
</div>
<table class="tableblock frame-all grid-all stretch queryresult">
<caption class="title">Table 3. Result</caption>
<colgroup>
<col style="width: 50%;">
<col style="width: 50%;">
</colgroup>
<thead>
<tr>
<th class="tableblock halign-left valign-top">name</th>
<th class="tableblock halign-left valign-top">born</th>
</tr>
</thead>
<tbody>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Emile Hirsch"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>1985</code></p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Rain"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>1982</code></p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Natalie Portman"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>1981</code></p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Christina Ricci"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>1980</code></p></td>
</tr>
</tbody>
<tfoot>
<tr>
<td class="tableblock halign-left valign-top" colspan="2"><p class="tableblock">Rows: 4</p></td>
</tr>
</tfoot>
</table>
<div class="paragraph">
<p>For more details, see the section on <a href="../../clauses/clause_composition/" class="xref page">Clause composition</a>.</p>
</div>
</div>
</div>
<div class="sect1">
<h2 id="find-connected-nodes"><a class="anchor" href="#find-connected-nodes"></a>Finding connected nodes</h2>
<div class="sectionbody">
<div class="paragraph">
<p>To discover how nodes are connected to one another, relationships must be added to queries.
Queries can specify relationship types, properties, and direction, as well as the start and end nodes of the pattern.</p>
</div>
<div class="paragraph">
<p>For example, the following query matches the graph for the director of the movie the Matrix, and returns the <code>name</code> property of its directors.</p>
</div>
<div class="listingblock">
<div class="title">Query</div>
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (m:Movie {title: 'The Matrix'})&lt;-[d:DIRECTED]-(p:Person)
RETURN p.name as director</code></pre>
</div>
</div>
<table class="tableblock frame-all grid-all stretch queryresult">
<caption class="title">Table 4. Result</caption>
<colgroup>
<col style="width: 100%;">
</colgroup>
<thead>
<tr>
<th class="tableblock halign-left valign-top">director</th>
</tr>
</thead>
<tbody>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Lilly Wachowski"</code></p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Lana Wachowski"</code></p></td>
</tr>
</tbody>
<tfoot>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock">Rows: 2</p></td>
</tr>
</tfoot>
</table>
<div class="paragraph">
<p>It also possible to look for the type of relationships that connect nodes to one another.
The below query searches the graph for outgoing relationships from the <code>Tom Hanks</code> node to any <code>Movie</code> nodes, and returns the relationships and the titles of the movies connected to him.</p>
</div>
<div class="listingblock">
<div class="title">Query</div>
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (tom:Person {name:'Tom Hanks'})-[r]-&gt;(m:Movie)
RETURN type(r) AS type, m.title AS movie</code></pre>
</div>
</div>
<div class="paragraph">
<p>The result shows that he has 13 outgoing relationships connected to 12 different <code>Movie</code> nodes (12 have the <code>ACTED_IN</code> type and one has the <code>DIRECTED</code> type).</p>
</div>
<div class="imageblock middle">
<div class="content">
<img src="../../_images/introduction_example1.svg" alt="introduction example1" width="500">
</div>
</div>
<table class="tableblock frame-all grid-all stretch queryresult">
<caption class="title">Table 5. Result</caption>
<colgroup>
<col style="width: 50%;">
<col style="width: 50%;">
</colgroup>
<thead>
<tr>
<th class="tableblock halign-left valign-top">type</th>
<th class="tableblock halign-left valign-top">movie</th>
</tr>
</thead>
<tbody>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"ACTED_IN"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Apollo 13"</code></p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"ACTED_IN"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"You&#8217;ve Got Mail"</code></p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"ACTED_IN"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"A League of Their Own"</code></p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"ACTED_IN"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"That Thing You Do"</code></p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"ACTED_IN"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"The Da Vinci Code"</code></p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"ACTED_IN"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Cloud Atlas"</code></p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"ACTED_IN"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Joe versus the Volcano"</code></p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"ACTED_IN"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Cast Away"</code></p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"ACTED_IN"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"The Green Mile"</code></p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"ACTED_IN"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Sleepless in Seattle"</code></p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"ACTED_IN"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"The Polar Express"</code></p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"ACTED_IN"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Charlie Wilson&#8217;s War"</code></p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"DIRECTED"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"That Thing You Do"</code></p></td>
</tr>
</tbody>
<tfoot>
<tr>
<td class="tableblock halign-left valign-top" colspan="2"><p class="tableblock">Rows: 13</p></td>
</tr>
</tfoot>
</table>
<div class="paragraph">
<p>It is possible to further modify Cypher queries by adding label expressions to the clauses.
For example, the below query uses a <code>NOT</code> label expression (<code>!</code>) to return all relationships connected to <code>Tom Hanks</code> that are not of type <code>ACTED_IN</code>.</p>
</div>
<div class="listingblock">
<div class="title">Query</div>
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (:Person {name:'Tom Hanks'})-[r:!ACTED_IN]-&gt;(m:Movie)
Return type(r) AS type, m.title AS movies</code></pre>
</div>
</div>
<table class="tableblock frame-all grid-all stretch queryresult">
<caption class="title">Table 6. Result</caption>
<colgroup>
<col style="width: 50%;">
<col style="width: 50%;">
</colgroup>
<thead>
<tr>
<th class="tableblock halign-left valign-top">type</th>
<th class="tableblock halign-left valign-top">movie</th>
</tr>
</thead>
<tbody>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"DIRECTED"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"That Thing You Do"</code></p></td>
</tr>
</tbody>
<tfoot>
<tr>
<td class="tableblock halign-left valign-top" colspan="2"><p class="tableblock">Rows: 1</p></td>
</tr>
</tfoot>
</table>
<div class="paragraph">
<p>For more information about the different label expressions supported by Cypher, see the section on <a href="../../patterns/reference/#label-expressions" class="xref page">label expressions</a>.</p>
</div>
</div>
</div>
<div class="sect1">
<h2 id="find-paths"><a class="anchor" href="#find-paths"></a>Finding paths</h2>
<div class="sectionbody">
<div class="paragraph">
<p>There are several ways in which Cypher can be used to search a graph for paths between nodes.</p>
</div>
<div class="paragraph">
<p>To search for patterns of a fixed length, specify the distance (hops) between the nodes in the pattern by using a <a href="../../patterns/reference/#quantifiers" class="xref page">quantifier</a> (<code>{n}</code>).
For example, the following query matches all <code>Person</code> nodes exactly 2 hops away from <code>Tom Hanks</code> and returns the first five rows.
The <a href="../../syntax/operators/#syntax-using-the-distinct-operator" class="xref page">DISTINCT</a> operator ensures that the result contain no duplicate values.</p>
</div>
<div class="listingblock">
<div class="title">Query</div>
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (tom:Person {name:'Tom Hanks'})--{2}(colleagues:Person)
RETURN DISTINCT colleagues.name AS name, colleagues.born AS bornIn
ORDER BY bornIn
LIMIT 5</code></pre>
</div>
</div>
<table class="tableblock frame-all grid-all stretch queryresult">
<caption class="title">Table 7. Result</caption>
<colgroup>
<col style="width: 50%;">
<col style="width: 50%;">
</colgroup>
<thead>
<tr>
<th class="tableblock halign-left valign-top">name</th>
<th class="tableblock halign-left valign-top">bornIn</th>
</tr>
</thead>
<tbody>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Mike Nichols"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>1931</code></p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Ian McKellen"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>1939</code></p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"James Cromwell"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>1940</code></p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Nora Ephron"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>1941</code></p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Penny Marshall"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>1943</code></p></td>
</tr>
</tbody>
<tfoot>
<tr>
<td class="tableblock halign-left valign-top" colspan="2"><p class="tableblock">Rows: 5</p></td>
</tr>
</tfoot>
</table>
<div class="paragraph">
<p>It is also possible to match a graph for patterns of a variable length.
The below query matches all <code>Person</code> nodes between <code>1</code> and <code>4</code> hops away from <code>Tom Hanks</code> and returns the first five rows.</p>
</div>
<div class="listingblock test-result-skip">
<div class="title">Query</div>
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (p:Person {name:'Tom Hanks'})--{1,4}(colleagues:Person)
RETURN DISTINCT colleagues.name AS name, colleagues.born AS bornIn
ORDER BY bornIn, name
LIMIT 5</code></pre>
</div>
</div>
<table class="tableblock frame-all grid-all stretch queryresult">
<caption class="title">Table 8. Result</caption>
<colgroup>
<col style="width: 50%;">
<col style="width: 50%;">
</colgroup>
<thead>
<tr>
<th class="tableblock halign-left valign-top">name</th>
<th class="tableblock halign-left valign-top">bornIn</th>
</tr>
</thead>
<tbody>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Max von Sydow"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>1929</code></p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Clint Eastwood"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>1930</code></p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Gene Hackman"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>1930</code></p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Richard Harris"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>1930</code></p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Mike Nichols"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>1931</code></p></td>
</tr>
</tbody>
<tfoot>
<tr>
<td class="tableblock halign-left valign-top" colspan="2"><p class="tableblock">Rows: 5</p></td>
</tr>
</tfoot>
</table>
<div class="admonitionblock note">
<table>
<tr>
<td class="icon">
<i class="fa icon-note" title="Note"></i>
</td>
<td class="content">
<div class="paragraph">
<p>The quantifier used in the above two examples was introduced with the release of <a href="../../patterns/concepts/#quantified-path-patterns" class="xref page">quantified path patterns</a> in Neo4j 5.9.
Before that, the only way in Cypher to match paths of a variable length was with a variable-length relationship.
This syntax is still available in Cypher.
Read more about it <a href="../../patterns/reference/#variable-length-relationships" class="xref page">here</a>.</p>
</div>
</td>
</tr>
</table>
</div>
<div class="paragraph">
<p>To find the shortest possible path between two nodes, use the <code>shortestPath</code> algorithm.
For example, this query matches the shorest path in the graph between the two nodes <code>Tom Hanks</code> and <code>Keanu Reeves</code>:</p>
</div>
<div class="listingblock">
<div class="title">Query</div>
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH p=shortestPath(
(:Person {name:"Keanu Reeves"})-[*]-(:Person {name:"Tom Hanks"})
)
RETURN p</code></pre>
</div>
</div>
<div class="paragraph">
<p>This is the returned path:</p>
</div>
<div class="imageblock "middle">
<div class="content">
<img src="../../_images/introduction_example2.svg" alt="introduction example2" width="500">
</div>
</div>
<div class="paragraph">
<p>It shows that <code>Keanu Reeves</code> <code>ACTED_IN</code> the <code>Movie</code> <code>The Replacements</code>, which was <code>REVIEWED</code> by the movie critic <code>Jessica Thompson</code>, who also <code>REVIEWED</code> the <code>Movie</code> <code>The Da Vinci Code</code> which <code>Tom Hanks</code> <code>ACTED_IN</code>.</p>
</div>
<div class="paragraph">
<p>More information can be found in the section on <a href="../../patterns/" class="xref page">Patterns</a>.</p>
</div>
</div>
</div>
<div class="sect1">
<h2 id="find-recommendations"><a class="anchor" href="#find-recommendations"></a>Finding recommendations</h2>
<div class="sectionbody">
<div class="paragraph">
<p>Cypher allows for more complex queries.
The following query tries to recommend co-actors for <code>Keanu Reeves</code>, who he has yet to work with but who his co-actors have worked with.
The query then orders the results by how frequently a matched co-co-actor has collaborated with one of Keanu Reeves' co-actors.</p>
</div>
<div class="listingblock">
<div class="title">Query</div>
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (keanu:Person {name:'Keanu Reeves'})-[:ACTED_IN]-&gt;(m:Movie)&lt;-[:ACTED_IN]-(coActors:Person),
  (coActors:Person)-[:ACTED_IN]-&gt;(m2:Movie)&lt;-[:ACTED_IN]-(cocoActors:Person)
WHERE NOT (keanu)-[:ACTED_IN]-&gt;()&lt;-[:ACTED_IN]-(cocoActors) AND keanu &lt;&gt; cocoActors
RETURN cocoActors.name AS recommended, count(cocoActors) AS strength
ORDER BY strength DESC
LIMIT 7</code></pre>
</div>
</div>
<table class="tableblock frame-all grid-all stretch queryresult">
<caption class="title">Table 9. Result</caption>
<colgroup>
<col style="width: 50%;">
<col style="width: 50%;">
</colgroup>
<thead>
<tr>
<th class="tableblock halign-left valign-top">recommended</th>
<th class="tableblock halign-left valign-top">strength</th>
</tr>
</thead>
<tbody>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Tom Hanks"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>4</code></p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"John Hurt"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>3</code></p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Jim Broadbent"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>3</code></p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Halle Berry"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>3</code></p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Stephen Rea"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>3</code></p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Natalie Portman"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>3</code></p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Ben Miles"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>3</code></p></td>
</tr>
</tbody>
<tfoot>
<tr>
<td class="tableblock halign-left valign-top" colspan="2"><p class="tableblock">Rows: 5</p></td>
</tr>
</tfoot>
</table>
<div class="paragraph">
<p>There are several connections between the <code>Keanu Reeves</code> and <code>Tom Hanks</code> nodes in the movie database, but the two have never worked together in a film.
The following query matches coactors who could introduce the two, by looking for co-actors who have worked with both of them in separate movies:</p>
</div>
<div class="listingblock">
<div class="title">Query</div>
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (:Person {name: 'Keanu Reeves'})-[:ACTED_IN]-&gt;(:Movie)&lt;-[:ACTED_IN]-(coActor:Person),
  (coActor)-[:ACTED_IN]-&gt;(:Movie)&lt;-[:ACTED_IN]-(:Person {name:'Tom Hanks'})
RETURN DISTINCT coActor.name AS coActor</code></pre>
</div>
</div>
<table class="tableblock frame-all grid-all stretch queryresult">
<caption class="title">Table 10. Result</caption>
<colgroup>
<col style="width: 100%;">
</colgroup>
<thead>
<tr>
<th class="tableblock halign-left valign-top">coActor</th>
</tr>
</thead>
<tbody>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Charlize Theron"</code></p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Hugo Weaving"</code></p></td>
</tr>
</tbody>
<tfoot>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock">Rows: 2</p></td>
</tr>
</tfoot>
</table>
</div>
</div>
<div class="sect1">
<h2 id="delete-graph"><a class="anchor" href="#delete-graph"></a>Delete a graph</h2>
<div class="sectionbody">
<div class="paragraph">
<p>To delete all nodes and relationships in a graph, run the following query:</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (n)
DETACH DELETE n</code></pre>
</div>
</div>
<div class="paragraph">
<p>For more information, see the section on the <a href="../../clauses/delete/" class="xref page">DELETE</a> clause.</p>
</div>
</div>
</div>
<nav class="pagination">
  <span class="prev"><a href="../concepts/">Core concepts</a></span>

  <span class="next"><a href="../expressions/">Cypher expressions</a></span>
</nav>
    <div class="feedback">
    <div class="header question">
        <p><strong>Was this page helpful?</strong></p>

        <svg width="22px" height="22px" viewBox="0 0 22 22" role="button" class="no" aria-label="No, this page isn't helpful">
            <path
                d="M6.25,15.8333333 C6.25,13.7622655 7.92893219,12.0833333 10,12.0833333 C12.0710678,12.0833333 13.75,13.7622655 13.75,15.8333333"
                ></path>
            <circle  cx="10" cy="10" r="9.58333333"></circle>
            <path
                d="M12.5,4.58333333 C12.8934466,4.05873783 13.5109223,3.75 14.1666667,3.75 C14.822411,3.75 15.4398867,4.05873783 15.8333333,4.58333333"
                ></path>
            <line x1="4.58333333" y1="7.91666667" x2="7.08333333" y2="7.91666667" ></line>
            <path
                d="M7.08333333,8.54166667 C6.96827401,8.54166667 6.875,8.44839266 6.875,8.33333333 C6.875,8.21827401 6.96827401,8.125 7.08333333,8.125 C7.19839266,8.125 7.29166667,8.21827401 7.29166667,8.33333333 C7.29166667,8.44839266 7.19839266,8.54166667 7.08333333,8.54166667"
                ></path>
            <line x1="12.9166667" y1="7.91666667" x2="15.4166667" y2="7.91666667" ></line>
            <path
                d="M15.4166667,8.54166667 C15.3016073,8.54166667 15.2083333,8.44839266 15.2083333,8.33333333 C15.2083333,8.21827401 15.3016073,8.125 15.4166667,8.125 C15.531726,8.125 15.625,8.21827401 15.625,8.33333333 C15.625,8.44839266 15.531726,8.54166667 15.4166667,8.54166667"
                ></path>
            <path
                d="M4.16666667,4.58333333 C4.5601133,4.05873783 5.17758895,3.75 5.83333333,3.75 C6.48907772,3.75 7.10655337,4.05873783 7.5,4.58333333"
                ></path>
        </svg>

        <svg width="22px" height="22px" viewBox="0 0 22 22" role="button" class="yes" aria-label="Yes, this page is helpful">
            <circle  cx="10" cy="10" r="9.58333333"></circle>
            <path
                d="M5.41666667,8.125 C5.53172599,8.125 5.625,8.21827401 5.625,8.33333333 C5.625,8.44839266 5.53172599,8.54166667 5.41666667,8.54166667 C5.30160734,8.54166667 5.20833333,8.44839266 5.20833333,8.33333333 C5.20833333,8.21827401 5.30160734,8.125 5.41666667,8.125"
                ></path>
            <path
                d="M14.5833333,8.125 C14.468274,8.125 14.375,8.21827401 14.375,8.33333333 C14.375,8.44839266 14.468274,8.54166667 14.5833333,8.54166667 C14.6983927,8.54166667 14.7916667,8.44839266 14.7916667,8.33333333 C14.7916667,8.21827401 14.6983927,8.125 14.5833333,8.125"
                ></path>
            <path
                d="M13.2275,12.9166657 C13.4853075,12.9162808 13.7287776,13.035241 13.8869095,13.2388563 C14.0450415,13.4424715 14.1000278,13.7078123 14.0358333,13.9575 C13.562901,15.7999679 11.9021969,17.0882321 10,17.0882321 C8.09780311,17.0882321 6.43709903,15.7999679 5.96416667,13.9575 C5.89997223,13.7078123 5.95495852,13.4424715 6.11309045,13.2388563 C6.27122239,13.035241 6.51469246,12.9162808 6.7725,12.9166657 L13.2275,12.9166657 Z"
                ></path>
        </svg>
    </div>


</div></article>
<aside class="toc sidebar" data-title="Contents"
  data-levels="2">
  <div class="toc-menu">
    <div class="toc-menu-placeholder"></div>

      </div>
  </aside>  </div>
</main>
</div>
<footer class="footer">
  <div class="wrapper">
  <div class="column">
    <div class="logo-footer"></div>
    <p> <span id="footer-copyright-year">2023</span> Neo4j, Inc.<br>
      <a href="https://neo4j.com/terms/">Terms</a> | <a href="https://neo4j.com/privacy-policy/">Privacy </a> | <a href="https://neo4j.com/sitemap/">Sitemap</a></p>
    <p>Neo4j<sup></sup>, Neo Technology<sup></sup>, Cypher<sup></sup>, Neo4j<sup></sup> Bloom<sup></sup> and
      Neo4j<sup></sup> Aura<sup></sup> are registered trademarks
      of Neo4j, Inc. All other marks are owned by their respective companies.</p>
  </div>

  <div class="column">
    <h2><a href="https://neo4j.com/contact-us/?ref=footer">Contact Us </a></h2>
    <p>US: 1-855-636-4532<br>
      Sweden +46 171 480 113<br>
      UK: +44 20 3868 3223<br>
      France: +33 (0) 1 88 46 13 20<br>
      <!--Germany: +49 (0)89 26204 6300</p>-->
    </p>
  </div>
  <div class="column links">
    <h2>Learn</h2>
    <ul>
      <li><i class="fa fa-wrench" aria-hidden="true"></i> <a rel="noopener" href="https://neo4j.com/sandbox/?ref=developer-footer">Sandbox</a></li>
      <li><i class="fa fa-comments-o" aria-hidden="true"></i> <a rel="noopener" href="https://community.neo4j.com?ref=developer-footer" target="_blank">Neo4j Community Site</a></li>
      <li><i class="fa fa-book" aria-hidden="true"></i> <a rel="noopener" href="https://medium.com/neo4j" target="_blank">Neo4j Developer Blog</a></li>
      <li><i class="fa fa-youtube" aria-hidden="true"></i> <a rel="noopener" href="https://www.youtube.com/neo4j" target="_blank">Neo4j Videos</a></li>
      <li><i class="fa fa-graduation-cap" aria-hidden="true"></i> <a rel="noopener" href="https://neo4j.com/graphacademy/?ref=developer-footer">GraphAcademy</a></li>
      <li><i class="fa fa-flask" aria-hidden="true"></i> <a href="https://neo4j.com/labs/?ref=developer-footer">Neo4j Labs</a></li>
    </ul>
  </div>
  <div class="column links">
    <h2>Social</h2>
    <ul>
      <li><i class="fa fa-twitter" aria-hidden="true"></i> <a rel="noopener" href="https://twitter.com/neo4j" target="_blank">Twitter</a></li>
      <li><i class="fa fa-meetup" aria-hidden="true"></i> <a rel="noopener" href="https://www.meetup.com/Neo4j-Online-Meetup/" target="_blank">Meetups</a></li>
      <li><i class="fa fa-github" aria-hidden="true"></i> <a rel="noopener" href="https://github.com/neo4j/neo4j" target="_blank">Github</a></li>
      <li><i class="fa fa-stack-overflow" aria-hidden="true"></i> <a rel="noopener" href="https://stackoverflow.com/questions/tagged/neo4j" target="_blank">Stack Overflow</a></li>

      <li class="speaker-program"><a href="https://docs.google.com/forms/d/e/1FAIpQLSdEcNnMruES5iwvOVYovmS1D_P1ZL_HdUOitFrwrvruv5PZvA/viewform">Want to Speak?</a></li>
    </ul>
  </div>
</div>
</footer>

  <script src="../../../../assets/js/vendor/auth0.js"></script>
  <script src="../../../../assets/js/site.js"></script>
  <script async src="../../../../assets/js/vendor/highlight.js"></script>
  <script async src="../../../../assets/js/vendor/image-zoom.js"></script>


<div id="neo4j-algolia-search-v2"></div>
<script src="https://neo4j.com/wp-content/themes/neo4jweb/assets/neo4j-react-modules-assets/search-preact/chunkless/bundle.js"></script>
<script src="https://neo4j.com/wp-content/themes/neo4jweb/assets/neo4j-react-modules-assets/search-preact/chunkless/polyfill.js"></script>
<script>window.algoliaSearchOptions = {indexName: "docs",placeholder: "Search Documentation",template: "docs"}</script>  </body>
</html>
