<!DOCTYPE html>
<html lang="en">
  <head>
    <meta charset="utf-8">
    <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=5, minimum-scale=1">
    <meta name="msvalidate.01" content="B5163518CBE4A854B63801277FE5E35C" />
    <meta name="google-site-verification" content="ucqagxjVuq0lJZeLKs0F5AppzK111lNt3IoxU6mzlJE" />
    <meta name="robots" content="index, follow" />
    <meta name="googlebot" content="index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1" />
    <meta name="bingbot" content="index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1" />

    <meta property="og:locale" content="en_US" />
    <meta property="og:type" content="article" />

<script>(function(w,d,s,l,i){w[l]=w[l]||[];w[l].push({'gtm.start':new Date().getTime(),event:'gtm.js'});var f=d.getElementsByTagName(s)[0],j=d.createElement(s),dl=l!='dataLayer'?'&l='+l:'';j.async=true;j.src='https://www.googletagmanager.com/gtm.js?id='+i+dl;f.parentNode.insertBefore(j,f);})(window,document,'script','dataLayer','GTM-WK23PSS');</script>
    <title>CALL subqueries - Cypher Manual</title>
    <link rel="canonical" href="https://neo4j.com/docs/cypher-manual/25/subqueries/call-subquery/">

    <link rel="prev" href="../">
    <link rel="next" href="../subqueries-in-transactions/">

      <meta name="description" content="This page describes how to use Cypher&#x27;s &#x60;CALL&#x60; subquery.">
<link rel="stylesheet" href="https://neo4j.com/wp-content/themes/neo4jweb/assets/neo4j-react-modules-assets/search-preact/chunkless/bundle.css" />
<link rel="stylesheet" href="https://neo4j.com/wp-content/themes/neo4jweb/assets/neo4j-react-modules-assets/search-preact/chunkless/utilities.min.css" />



    <link rel="preload" href="../../../../assets/fonts/fontawesome-webfont.woff2?v=4.7.0" as="font">
    <link rel="stylesheet" href="../../../../assets/css/site.css">
    <link rel="preconnect" href="https://fonts.googleapis.com">
    <link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
    <link href="https://fonts.googleapis.com/css2?family=Public+Sans:wght@300;400;500;600;700&display=swap" rel="stylesheet">

    <link rel="shortcut icon" href="https://neo4j.com/wp-content/themes/neo4jweb/favicon.ico" />


    <meta property="neo:type" content="Docs">
    <meta property="neo:site" content="Reference Docs">


    <meta property="og:site_name" content="Neo4j Graph Data Platform" />
    <meta property="article:publisher" content="https://www.facebook.com/neo4j.graph.database" />
    <meta name="twitter:card" content="summary_large_image" />
    <meta name="twitter:creator" content="@neo4j" />
    <meta name="twitter:site" content="@neo4j" />
    <meta property="og:type" content="article" />
    <meta property="og:title" content="CALL subqueries - Cypher Manual" />
    <meta property="og:locale" content="en_US" />
    <meta property="og:image" content="https://dist.neo4j.com/wp-content/uploads/20240513110808/Neo4j-logo-social-preview.png" />
    <meta property="og:description" content="This page describes how to use Cypher's `CALL` subquery." />
    <meta property="og:url" content="https://neo4j.com/docs/cypher-manual/25/subqueries/call-subquery/" />
    <link rel="shortcut icon" href="https://neo4j.com/wp-content/themes/neo4jweb/favicon.ico" />
  </head>
  <body class="article docs">
<!-- Google Tag Manager (noscript) -->
<noscript><iframe src="https://www.googletagmanager.com/ns.html?id=GTM-WK23PSS"
height="0" width="0" style="display:none;visibility:hidden"></iframe></noscript>
<!-- End Google Tag Manager (noscript) -->
<script>(function(f,b){if(!b.__SV){var e,g,i,h;window.mixpanel=b;b._i=[];b.init=function(e,f,c){function g(a,d){var b=d.split(".");2==b.length&&(a=a[b[0]],d=b[1]);a[d]=function(){a.push([d].concat(Array.prototype.slice.call(arguments,0)))}}var a=b;"undefined"!==typeof c?a=b[c]=[]:c="mixpanel";a.people=a.people||[];a.toString=function(a){var d="mixpanel";"mixpanel"!==c&&(d+="."+c);a||(d+=" (stub)");return d};a.people.toString=function(){return a.toString(1)+".people (stub)"};i="disable time_event track track_pageview track_links track_forms track_with_groups add_group set_group remove_group register register_once alias unregister identify name_tag set_config reset opt_in_tracking opt_out_tracking has_opted_in_tracking has_opted_out_tracking clear_opt_in_out_tracking start_batch_senders people.set people.set_once people.unset people.increment people.append people.union people.track_charge people.clear_charges people.delete_user people.remove".split(" ");
for(h=0;h<i.length;h++)g(a,i[h]);var j="set set_once union unset remove delete".split(" ");a.get_group=function(){function b(c){d[c]=function(){call2_args=arguments;call2=[c].concat(Array.prototype.slice.call(call2_args,0));a.push([e,call2])}}for(var d={},e=["get_group"].concat(Array.prototype.slice.call(arguments,0)),c=0;c<j.length;c++)b(j[c]);return d};b._i.push([e,f,c])};b.__SV=1.2;e=f.createElement("script");e.type="text/javascript";e.async=!0;e.src="undefined"!==typeof MIXPANEL_CUSTOM_LIB_URL?
MIXPANEL_CUSTOM_LIB_URL:"file:"===f.location.protocol&&"//cdn.mxpnl.com/libs/mixpanel-2-latest.min.js".match(/^\/\//)?"https://cdn.mxpnl.com/libs/mixpanel-2-latest.min.js":"//cdn.mxpnl.com/libs/mixpanel-2-latest.min.js";g=f.getElementsByTagName("script")[0];g.parentNode.insertBefore(e,g)}})(document,window.mixpanel||[]);
mixpanel.init("4bfb2414ab973c741b6f067bf06d5575", {batch_requests: true})
mixpanel.track("Page View", {
    pathname: window.location.origin + window.location.pathname,
    search: window.location.search,
    hash: window.location.hash,
    referrer: document.referrer,
})
</script>
<header class="header">
  <nav class="navbar">
    <div class="navbar-brand">
      <a class="navbar-item" href="/">

        <img class="navbar-logo" src="https://dist.neo4j.com/wp-content/uploads/20230926084108/Logo_FullColor_RGB_TransBG.svg" alt="Neo4j Docs" />
      </a>
      <a href="/docs/" class="navbar-item no-left-padding" aria-label="Docs">
        Docs
      </a>

      </div>

      <button class="navbar-search search-button" data-target="topbar-nav" id="search_open_mobile" aria-label="Open Search">
        <svg width="23px" height="23px" viewBox="0 0 23 23" version="1.1" class="fill-current float-right" id="searchx" role="button" title="Search Website">
          <g stroke="none" stroke-width="1" fill="none" fill-rule="evenodd" stroke-linecap="round"
            stroke-linejoin="round">
            <g transform="translate(-2.000000, -2.000000)" stroke="#a0aec0" stroke-width="1.5">
              <circle
                transform="translate(11.389364, 11.388564) rotate(-23.025000) translate(-11.389364, -11.388564) "
                cx="11.3893642" cy="11.3885639" r="8.056"></circle>
              <path d="M17.0853333,17.0844444 L23.3333333,23.3333333" ></path>
            </g>
          </g>
        </svg>
      </button>
      <button class="navbar-burger" data-target="topbar-nav" aria-label="Mobile Navigation Button">
        <span></span>
        <span></span>
        <span></span>
      </button>
    </div>
    <div id="topbar-nav" class="navbar-menu">
            <div class="navbar-end">


        <div class="navbar-item has-dropdown is-hoverable docs">
          <a class="navbar-link" href="/docs/">Docs</a>
          <div class="navbar-dropdown">
            <div class="navbar-item project">
              <span class="project-name">Neo4j DBMS</span>
              <ul class="project-links">
                <li><a href="/docs/getting-started/current/" class="project-link">Getting Started</a></li>
                <li><a href="/docs/operations-manual/current/" class="project-link">Operations</a></li>
                <li><a href="/docs/migration-guide/current/" class="project-link">Migration and Upgrade</a></li>
                <li><a href="/docs/status-codes/current/" class="project-link">Status Codes</a></li>
                <li><a href="/docs/java-reference/current/" class="project-link">Java Reference</a></li>
                <li><a href="/docs/kerberos-add-on/current/" class="project-link">Kerberos Add-on</a></li>
              </ul>
            </div>

            <div class="navbar-item project">
              <a class="project-name" href="/docs/aura/">Neo4j Aura</a>
              <ul class="project-links">
                <li><a class="project-link" href="/docs/aura">Neo4j Aura</a></li>
                <li><a class="project-link" href="/docs/aura/auradb/">Neo4j AuraDB</a></li>
                <li><a class="project-link" href="/docs/aura/aurads/">Neo4j AuraDS</a></li>
              </ul>
            </div>

            <div class="navbar-item project">
              <span class="project-name">Neo4j Tools</span>
              <ul class="project-links">
                <li><a href="/docs/bloom-user-guide/current/" class="project-link">Neo4j Bloom</a></li>
                <li><a href="/docs/browser-manual/current/" class="project-link">Neo4j Browser</a></li>
                <li><a href="/docs/data-importer/current/" class="project-link">Neo4j Data Importer</a></li>
                <li><a href="/docs/desktop-manual/current/" class="project-link">Neo4j Desktop</a></li>
                <li><a href="/docs/ops-manager/current/" class="project-link">Neo4j Ops Manager</a></li>
                <li><a href="/docs/neodash-commercial/current/" class="project-link">Neodash commercial</a></li>
              </ul>
            </div>

            <div class="navbar-item project">
              <span class="project-name">Neo4j Graph Data Science</span>
              <ul class="project-links">
                <li><a href="/docs/graph-data-science/current/" class="project-link">Neo4j Graph Data Science Library</a></li>
                <li><a href="/docs/graph-data-science-client/current/" class="project-link">Neo4j Graph Data Science Client</a></li>
              </ul>
            </div>

            <div class="navbar-item project">
              <span class="project-name">Cypher Query Language</span>
              <ul class="project-links">
                <li><a href="/docs/cypher-manual/current/" class="project-link">Cypher</a></li>
                <li><a href="/docs/cypher-cheat-sheet/current/" class="project-link">Cypher Cheat Sheet</a></li>
                <li><a href="/docs/apoc/current/" class="project-link">APOC Library</a></li>
              </ul>
            </div>

           <div class="navbar-item project">
              <span class="project-name" href="/docs/genai">Generative AI</span>
              <ul class="project-links">
                <li><a href="/docs/neo4j-graphrag-python/current/" class="project-link">Neo4j GraphRAG for Python</a></li>
                <li><a href="/docs/genai/tutorials/embeddings-vector-indexes/" class="project-link">Embeddings and vector indexes tutorial</a></li>
                <li><a href="/docs/cypher-manual/current/genai-integrations/" class="project-link">GenAI integrations</a></li>
                <li><a href="/docs/cypher-manual/current/indexes/semantic-indexes/vector-indexes/" class="project-link">Vector search indexes</a></li>
                <li><a href="/docs/cypher-manual/current/functions/vector/" class="project-link">Vector search functions</a></li>
                <li><a href="/docs/graphql/5/directives/indexes-and-constraints/#_vector_index_search" class="project-link">GraphQL vector index search documentation</a></li>
              </ul>
            </div>
            
            <div class="navbar-item project">
              <span class="project-name" href="/docs/create-applications">Create applications</span>
              <ul class="project-links">
                <li><a href="/docs/python-manual/current/" class="project-link">Python Driver</a></li>
                <li><a href="/docs/go-manual/current/" class="project-link">Go Driver</a></li>
                <li><a href="/docs/java-manual/current/" class="project-link">Java Driver</a></li>
                <li><a href="/docs/jdbc-manual/current/" class="project-link">JDBC Driver</a></li>
                <li><a href="/docs/javascript-manual/current/" class="project-link">JavaScript Driver</a></li>
                <li><a href="/docs/dotnet-manual/current/" class="project-link">.Net Driver</a></li>
                <li><a href="/docs/graphql-manual/current/" class="project-link">Neo4j GraphQL Library</a></li>
                <li><a href="/docs/nvl/current/" class="project-link">Neo4j Visualization Library</a></li>
                <li><a href="/docs/ogm-manual/current/" class="project-link">OGM Library</a></li>
                <li><a href="https://docs.spring.io/spring-data/neo4j/docs/current/reference/html/#reference" class="project-link">Spring Data Neo4j</a></li>
                <li><a href="/docs/http-api/current/" class="project-link">HTTP API</a></li>
                <li><a href="/docs/query-api/current/" class="project-link">Neo4j Query API</a></li>
                <li><a href="/docs/bolt/current/" class="project-link">Bolt</a></li>
              </ul>
            </div>

            <div class="navbar-item project">
              <span class="project-name" href="/docs/connectors">Connect data sources</span>
              <ul class="project-links">
                <li><a href="/docs/spark/current/" class="project-link">Neo4j Connector for Apache Spark</a></li>
                <li><a href="/docs/kafka/" class="project-link">Neo4j Connector for Apache Kafka</a></li>
                <li><a href="/docs/cdc/" class="project-link">Change Data Capture (CDC)</a></li>
                <li><a href="/docs/dataflow-bigquery/" class="project-link">BigQuery to Neo4j</a></li>
                <li><a href="/docs/dataflow-google-cloud/" class="project-link">Google Cloud to Neo4j</a></li>
              </ul>
            </div>
          </div>
        </div>
        <div class="navbar-item has-dropdown is-hoverable labs">
          <a class="navbar-link" href="/labs/">Labs</a>
          <div class="navbar-dropdown">
            <div class="navbar-item project">
              <a class="project-name" href="/labs/genai-ecosystem/">GenAI Ecosystem</a>
              <ul class="project-links">
                <li><a href="/labs/genai-ecosystem/llm-graph-builder/" class="project-link">LLM Knowledge Graph Builder</a></li>
                <li><a href="/labs/genai-ecosystem/vector-search/" class="project-link">Vector Index &amp; Search</a></li>
                <li><a href="/labs/genai-ecosystem/langchain/" class="project-link">LangChain</a></li>
                <li><a href="/labs/genai-ecosystem/langchain-js/" class="project-link">LangChain.js</a></li>
                <li><a href="/labs/genai-ecosystem/llamaindex/" class="project-link">LlamaIndex</a></li>
                <li><a href="/labs/genai-ecosystem/haystack/" class="project-link">Haystack</a></li>
                <li><a href="/labs/genai-ecosystem/dspy/" class="project-link">DSPy</a></li>
              </ul>
            </div>

            <div class="navbar-item project">
              <strong class="project-name" href="/labs/apoc/">Developer Tools</strong>
              <ul class="project-links">
                <li><a href="/labs/apoc/" class="project-link">APOC Extended</a></li>
                <li><a class="project-link" href="/labs/aura-cli/">Aura CLI</a></li>
                <li><a class="project-link" href="/labs/arrows/">arrows.app</a></li>
                <li><a class="project-link" href="/labs/cypher-workbench/">Cypher Workbench</a></li>
                <li><a class="project-link" href="/labs/etl-tool/">ETL Tool</a></li>
                <li><a class="project-link" href="/labs/neodash/">NeoDash</a></li>
              </ul>
            </div>

            <div class="navbar-item project">
              <strong class="project-name">Frameworks &amp; Integrations</strong>
              <ul class="project-links">
                <li><a class="project-link" href="/labs/neo4j-needle-starterkit/">Needle Starter Kit</a></li>
                <li><a class="project-link" href="/labs/liquibase/">Neo4j Plugin for Liquibase</a></li>
                <li><a class="project-link" href="/labs/neo4j-migrations/">Neo4j Migrations</a></li>
                <li><a class="project-link" href="/labs/neomodel/">neomodel</a></li>
              </ul>
            </div>
            <div class="navbar-item project">
              <a class="project-name" href="/labs/neosemantics/">RDF &amp; Linked Data</a>
              <ul class="project-links">
                <li><a href="/labs/neosemantics/" class="project-link">Neosemantics (Java)</a></li>
                <li><a href="/labs/rdflib-neo4j/" class="project-link">RDFLib-Neo4j (Python)</a></li>
              </ul>
            </div>
            <div class="navbar-item project">
            </div>
          </div>
        </div>
        <div class="navbar-item has-dropdown is-hoverable developer">
          <a class="navbar-link" href="/developer/resources/">Get Help</a>
          <div class="navbar-dropdown">
            <div class="navbar-item project">
              <a class="project-name" href="https://dev.neo4j.com/forum" target="_blank">Community Forum</a>
            </div>
            <div class="navbar-item project">
              <a class="project-name" href="https://dev.neo4j.com/chat" target="_blank">Discord Chat</a>
            </div>
            <div class="navbar-item project">
              <a class="project-name" href="http://support.neo4j.com" target="_blank">Product Support</a>
            </div>
            <div class="navbar-item project">
              <a class="project-name" href="https://neo4j.com/blog/developer/" target="_blank">Neo4j Developer Blog</a>
            </div>
            <div class="navbar-item project">
              <a class="project-name" href="/videos/" target="_blank">Neo4j Videos</a>
            </div>
          </div>
        </div>
        <div class="navbar-item has-dropdown is-hoverable developer">
          <a class="navbar-link" href="https://graphacademy.neo4j.com/?ref=docs-nav">GraphAcademy</a>
          <div class="navbar-dropdown">
            <div class="navbar-item project">
              <a class="project-name" href="https://graphacademy.neo4j.com/categories/beginners/?ref=docs-nav" target="_blank">Beginners Courses</a>
              <ul class="project-links">
                <li><a class="project-link" href="https://graphacademy.neo4j.com/courses/neo4j-fundamentals/?ref=docs-nav">Neo4j Fundamentals</a></li>
                <li><a class="project-link" href="https://graphacademy.neo4j.com/courses/cypher-fundamentals/?ref=docs-nav">Cypher Fundamentals</a></li>
                <li><a class="project-link" href="https://graphacademy.neo4j.com/courses/importing-fundamentals/?ref=docs-nav">Importing Data Fundamentals</a></li>
                <li><a class="project-link" href="https://graphacademy.neo4j.com/courses/importing-csv-data/?ref=docs-nav">Importing CSV Data</a></li>
                <li><a class="project-link" href="https://graphacademy.neo4j.com/courses/modeling-fundamentals/?ref=docs-nav">Graph Data Modeling</a></li>
              </ul>
            </div>
            <div class="navbar-item project">
              <a class="project-name" href="https://graphacademy.neo4j.com/categories/data-scientist/?ref=docs-nav" target="_blank">Data Scientist Courses</a>
              <ul class="project-links">
                <li><a class="project-link" href="https://graphacademy.neo4j.com/courses/gds-product-introduction/?ref=docs-nav">Into to Graph Data Science</a></li>
                <li><a class="project-link" href="https://graphacademy.neo4j.com/courses/graph-data-science-fundamentals/?ref=docs-nav">Graph Data Science Fundamentals</a></li>
                <li><a class="project-link" href="https://graphacademy.neo4j.com/courses/gds-shortest-paths/?ref=docs-nav">Path Finding</a></li>
              </ul>
            </div>
            <div class="navbar-item project">
              <a class="project-name" href="https://graphacademy.neo4j.com/categories/llms/?ref=docs-nav" target="_blank">Generative AI Courses</a>
              <ul class="project-links">
                <li><a class="project-link" href="https://graphacademy.neo4j.com/courses/llm-fundamentals/?ref=docs-nav">Neo4j &amp; LLM Fundamentals</a></li>
                <li><a class="project-link" href="https://graphacademy.neo4j.com/courses/llm-vectors-unstructured/?ref=docs-nav">Vector Indexes &amp; Unstructured Data</a></li>
                <li><a class="project-link" href="https://graphacademy.neo4j.com/courses/llm-chatbot-python/?ref=docs-nav">Build a Chatbot with Python</a></li>
                <li><a class="project-link" href="https://graphacademy.neo4j.com/courses/llm-chatbot-typescript/?ref=docs-nav">Build a Chatbot with TypeScript</a></li>
              </ul>
            </div>
            <div class="navbar-item project">
              <a class="project-name" href="https://graphacademy.neo4j.com/certification/?ref=docs-nav" target="_blank">Neo4j Certification</a>
              <ul class="project-links">
                <li><a class="project-link" href="https://graphacademy.neo4j.com/certifications/neo4j-certification/?ref=docs-nav">Neo4j Certified Professional</a></li>
                <li><a class="project-link" href="https://graphacademy.neo4j.com/certifications/gds-certification/?ref=docs-nav">Neo4j Graph Data Science Certification</a></li>
              </ul>
            </div>
          </div>
        </div>
        <div class="navbar-item is-hoverable getting-started-cta">
          <a class="navbar-link primary" href="https://console.neo4j.io/?ref=docs-nav-get-started">Get Started Free</a>
        </div>
        <div class="navbar-item">
          <a class="navbar-link search-button" href="#search" id="search_open"><svg width="23px" height="23px" viewBox="0 0 23 23"
              version="1.1" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink"
              class="fill-current float-right" id="search" role="button" title="Search Website">
              <g stroke="none" stroke-width="1" fill="none" fill-rule="evenodd" stroke-linecap="round"
                stroke-linejoin="round">
                <g transform="translate(-2.000000, -2.000000)" stroke="#a0aec0" stroke-width="1.5">
                  <circle
                    transform="translate(11.389364, 11.388564) rotate(-23.025000) translate(-11.389364, -11.388564) "
                    cx="11.3893642" cy="11.3885639" r="8.056"></circle>
                  <path d="M17.0853333,17.0844444 L23.3333333,23.3333333" ></path>
                </g>
              </g>
            </svg><span class="navbar-mobile">Search</span></a>
        </div>
      </div>
    </div>
  </nav>

</header>
<div class="body">
    <a class="show-on-focus skip-link" href="#skip-to-content" title="Skip to content">Skip to content</a>
<div class="nav-container" data-component="cypher-manual" data-version="25">
  <aside class="nav">
    <div class="panels">
      <div class="component">
  <div class="nav-product">
    <span class="nav-product-name">Cypher Manual</span>
  </div>
</div>
      





      <div class="nav-panel-menu is-active has-feedback" data-panel="menu">
    <nav class="nav-menu">
    <ul class="nav-list">
    <li class="nav-item" data-module="ROOT" data-depth="0">
        <ul class="nav-list">
    <li class="nav-item" data-module="ROOT" data-depth="1">
      <a class="nav-link nav-item-toggle" href="../../introduction/">Introduction</a>
        <ul class="nav-list">
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../introduction/cypher-overview/">Overview</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../introduction/cypher-neo4j/">Cypher and Neo4j</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../introduction/cypher-aura/">Cypher and Aura</a>
            </li>
</ul>
    </li>
    <li class="nav-item" data-module="ROOT" data-depth="1">
      <a class="nav-link nav-item-toggle" href="../../queries/">Queries</a>
        <ul class="nav-list">
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../queries/concepts/">Core concepts</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../queries/basic/">Basic queries</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../queries/select-version/">Select Cypher version</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link nav-item-toggle" href="../../queries/composed-queries/">Composed queries</a>
        <ul class="nav-list">
    <li class="nav-item" data-module="ROOT" data-depth="3">
      <a class="nav-link" href="../../queries/composed-queries/combined-queries/">Combined queries (<code>UNION</code>)</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="3">
      <a class="nav-link" href="../../queries/composed-queries/conditional-queries/">Conditional queries (<code>WHEN</code>)</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="3">
      <a class="nav-link" href="../../queries/composed-queries/sequential-queries/">Sequential queries (<code>NEXT</code>)</a>
            </li>
</ul>
    </li>
</ul>
    </li>
    <li class="nav-item" data-module="ROOT" data-depth="1">
      <a class="nav-link nav-item-toggle" href="../../clauses/">Clauses</a>
        <ul class="nav-list">
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../clauses/clause-composition/">Clause composition</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../clauses/call/">CALL procedure</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../clauses/create/">CREATE</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../clauses/delete/">DELETE</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../clauses/filter/">FILTER</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../clauses/finish/">FINISH</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../clauses/foreach/">FOREACH</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../clauses/let/">LET</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../clauses/limit/">LIMIT</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../clauses/load-csv/">LOAD CSV</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../clauses/match/">MATCH</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../clauses/merge/">MERGE</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../clauses/optional-match/">OPTIONAL MATCH</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../clauses/order-by/">ORDER BY</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../clauses/remove/">REMOVE</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../clauses/return/">RETURN</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../clauses/set/">SET</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../clauses/listing-functions/">SHOW FUNCTIONS</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../clauses/listing-procedures/">SHOW PROCEDURES</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../clauses/listing-settings/">SHOW SETTINGS</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../clauses/transaction-clauses/#query-listing-transactions">SHOW TRANSACTIONS</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../clauses/skip/">SKIP</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../clauses/transaction-clauses/#query-terminate-transactions">TERMINATE TRANSACTIONS</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../clauses/unwind/">UNWIND</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../clauses/use/">USE</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../clauses/where/">WHERE</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../clauses/with/">WITH</a>
            </li>
</ul>
    </li>
    <li class="nav-item" data-module="ROOT" data-depth="1">
      <a class="nav-link nav-item-toggle" href="../">Subqueries</a>
        <ul class="nav-list">
    <li class="nav-item is-current-page" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="./">CALL subqueries</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../subqueries-in-transactions/">CALL subqueries in transactions</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../collect/">COLLECT subqueries</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../count/">COUNT subqueries</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../existential/">EXISTS subqueries</a>
            </li>
</ul>
    </li>
    <li class="nav-item" data-module="ROOT" data-depth="1">
      <a class="nav-link nav-item-toggle" href="../../patterns/">Patterns</a>
        <ul class="nav-list">
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../patterns/primer/">Primer</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../patterns/fixed-length-patterns/">Fixed-length patterns</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../patterns/variable-length-patterns/">Variable-length patterns</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../patterns/shortest-paths/">Shortest paths</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../patterns/non-linear-patterns/">Non-linear patterns</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../patterns/match-modes/">Match modes</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../patterns/reference/">Syntax and semantics</a>
            </li>
</ul>
    </li>
    <li class="nav-item" data-module="ROOT" data-depth="1">
      <a class="nav-link nav-item-toggle" href="../../values-and-types/">Values and types</a>
        <ul class="nav-list">
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../values-and-types/property-structural-constructed/">Property, structural, and constructed values</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../values-and-types/boolean-numeric-string/">Boolean, numeric, and string literals</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../values-and-types/temporal/">Temporal values</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../values-and-types/spatial/">Spatial values</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../values-and-types/lists/">Lists</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../values-and-types/maps/">Maps</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../values-and-types/graph-references/">Graph references</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../values-and-types/working-with-null/">Working with <code>null</code></a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../values-and-types/casting-data/">Casting data values</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../values-and-types/ordering-equality-comparison/">Equality, ordering, and comparison of value types</a>
            </li>
</ul>
    </li>
    <li class="nav-item" data-module="ROOT" data-depth="1">
      <a class="nav-link nav-item-toggle" href="../../expressions/">Expressions</a>
        <ul class="nav-list">
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link nav-item-toggle" href="../../expressions/predicates/">Predicates</a>
        <ul class="nav-list">
    <li class="nav-item" data-module="ROOT" data-depth="3">
      <a class="nav-link" href="../../expressions/predicates/boolean-operators/">Boolean operators</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="3">
      <a class="nav-link" href="../../expressions/predicates/comparison-operators/">Comparison operators</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="3">
      <a class="nav-link" href="../../expressions/predicates/list-operators/">List operators</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="3">
      <a class="nav-link" href="../../expressions/predicates/string-operators/">String operators</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="3">
      <a class="nav-link" href="../../expressions/predicates/path-pattern-expressions/">Path pattern expressions</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="3">
      <a class="nav-link" href="../../expressions/predicates/type-predicate-expressions/">Type predicate expressions</a>
            </li>
</ul>
    </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../expressions/node-relationship-operators/">Node and relationship operators</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../expressions/mathematical-operators/">Mathematical operators</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../expressions/string-operators/">String concatenation operators</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../expressions/temporal-operators/">Temporal operators</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../expressions/list-expressions/">List expressions</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../expressions/map-expressions/">Map expressions</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../expressions/conditional-expressions/">Conditional expressions (CASE)</a>
            </li>
</ul>
    </li>
    <li class="nav-item" data-module="ROOT" data-depth="1">
      <a class="nav-link nav-item-toggle" href="../../functions/">Functions</a>
        <ul class="nav-list">
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../functions/aggregating/">Aggregating functions</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../functions/database/">Database functions</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../functions/graph/">Graph functions</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../functions/list/">List functions</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../functions/load-csv/">LOAD CSV functions</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../functions/mathematical-logarithmic/">Mathematical functions - logarithmic</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../functions/mathematical-numeric/">Mathematical functions - numeric</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../functions/mathematical-trigonometric/">Mathematical functions - trigonometric</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../functions/predicate/">Predicate functions</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../functions/scalar/">Scalar functions</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../functions/spatial/">Spatial functions</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../functions/string/">String functions</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../functions/temporal/duration/">Temporal functions - duration</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../functions/temporal/">Temporal functions - instant types</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../functions/user-defined/">User-defined functions</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../functions/vector/">Vector functions</a>
            </li>
</ul>
    </li>
    <li class="nav-item" data-module="ROOT" data-depth="1">
      <a class="nav-link" href="../../genai-integrations/">GenAI integrations</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="1">
      <a class="nav-link nav-item-toggle" href="../../indexes/">Indexes</a>
        <ul class="nav-list">
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link nav-item-toggle" href="../../indexes/search-performance-indexes/overview/">Search-performance indexes</a>
        <ul class="nav-list">
    <li class="nav-item" data-module="ROOT" data-depth="3">
      <a class="nav-link" href="../../indexes/search-performance-indexes/managing-indexes/">Create, show, and delete indexes</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="3">
      <a class="nav-link" href="../../indexes/search-performance-indexes/using-indexes/">The impact of indexes on query performance</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="3">
      <a class="nav-link" href="../../indexes/search-performance-indexes/index-hints/">Index hints for the Cypher planner</a>
            </li>
</ul>
    </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link nav-item-toggle" href="../../indexes/semantic-indexes/overview/">Semantic indexes</a>
        <ul class="nav-list">
    <li class="nav-item" data-module="ROOT" data-depth="3">
      <a class="nav-link" href="../../indexes/semantic-indexes/full-text-indexes/">Full-text indexes</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="3">
      <a class="nav-link" href="../../indexes/semantic-indexes/vector-indexes/">Vector indexes</a>
            </li>
</ul>
    </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../indexes/syntax/">Syntax</a>
            </li>
</ul>
    </li>
    <li class="nav-item" data-module="ROOT" data-depth="1">
      <a class="nav-link nav-item-toggle" href="../../constraints/">Constraints</a>
        <ul class="nav-list">
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../constraints/managing-constraints/">Create, show, and drop constraints</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../constraints/syntax/">Syntax</a>
            </li>
</ul>
    </li>
    <li class="nav-item" data-module="ROOT" data-depth="1">
      <a class="nav-link nav-item-toggle" href="../../planning-and-tuning/">Execution plans and query tuning</a>
        <ul class="nav-list">
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../planning-and-tuning/execution-plans/">Understanding execution plans</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link nav-item-toggle" href="../../planning-and-tuning/operators/">Operators</a>
        <ul class="nav-list">
    <li class="nav-item" data-module="ROOT" data-depth="3">
      <a class="nav-link" href="../../planning-and-tuning/operators/operators-detail/">Operators in detail</a>
            </li>
</ul>
    </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link nav-item-toggle" href="../../planning-and-tuning/runtimes/">Cypher runtimes</a>
        <ul class="nav-list">
    <li class="nav-item" data-module="ROOT" data-depth="3">
      <a class="nav-link" href="../../planning-and-tuning/runtimes/concepts/">Concepts</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="3">
      <a class="nav-link" href="../../planning-and-tuning/runtimes/reference/">Parallel runtime: reference</a>
            </li>
</ul>
    </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../planning-and-tuning/query-tuning/">Query tuning</a>
            </li>
</ul>
    </li>
    <li class="nav-item" data-module="ROOT" data-depth="1">
      <a class="nav-link nav-item-toggle" href="../../query-caches/">Query caches</a>
        <ul class="nav-list">
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../query-caches/unified-query-caches/">Unifying query caches</a>
            </li>
</ul>
    </li>
    <li class="nav-item" data-module="ROOT" data-depth="1">
      <a class="nav-link" href="../../administration/">Administration</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="1">
      <a class="nav-link nav-item-toggle" href="../../syntax/">Syntax</a>
        <ul class="nav-list">
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../syntax/parsing/">Parsing</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../syntax/naming/">Naming rules and recommendations</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../syntax/variables/">Variables</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../syntax/keywords/">Keywords</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../syntax/parameters/">Parameters</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../syntax/comments/">Comments</a>
            </li>
</ul>
    </li>
    <li class="nav-item" data-module="ROOT" data-depth="1">
      <a class="nav-link" href="../../deprecations-additions-removals-compatibility/">Additions, deprecations, removals, and compatibility</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="1">
      <span class="nav-text nav-item-toggle">Appendix</span>
        <ul class="nav-list">
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../styleguide/">Cypher styleguide</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link nav-item-toggle" href="../../appendix/gql-conformance/">GQL conformance</a>
        <ul class="nav-list">
    <li class="nav-item" data-module="ROOT" data-depth="3">
      <a class="nav-link" href="../../appendix/gql-conformance/supported-mandatory/">Supported mandatory GQL features</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="3">
      <a class="nav-link" href="../../appendix/gql-conformance/unsupported-mandatory/">Currently unsupported mandatory GQL features</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="3">
      <a class="nav-link" href="../../appendix/gql-conformance/supported-optional/">Supported optional GQL features</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="3">
      <a class="nav-link" href="../../appendix/gql-conformance/analogous-cypher/">Optional GQL features and analogous Cypher</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="3">
      <a class="nav-link" href="../../appendix/gql-conformance/additional-cypher/">Additional Cypher features</a>
            </li>
</ul>
    </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link nav-item-toggle" href="../../appendix/tutorials/">Tutorials and extended examples</a>
        <ul class="nav-list">
    <li class="nav-item" data-module="ROOT" data-depth="3">
      <a class="nav-link" href="../../appendix/tutorials/basic-query-tuning/">Basic query tuning example</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="3">
      <a class="nav-link" href="../../appendix/tutorials/advanced-query-tuning/">Advanced query tuning example</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="3">
      <a class="nav-link" href="../../appendix/tutorials/shortestpath-planning/">Shortest path planning</a>
            </li>
</ul>
    </li>
</ul>
    </li>
</ul>
    </li>
</ul>

  </nav>
</div>
        <div class="feedback" style="height: var(--feedback-height);">
    <div class="header question">
        <p><strong>Is this page helpful?</strong></p>

        <svg width="22px" height="22px" viewBox="0 0 22 22" role="button" class="no" aria-label="No, this page isn't helpful">
            <path
                d="M6.25,15.8333333 C6.25,13.7622655 7.92893219,12.0833333 10,12.0833333 C12.0710678,12.0833333 13.75,13.7622655 13.75,15.8333333"
                ></path>
            <circle  cx="10" cy="10" r="9.58333333"></circle>
            <path
                d="M12.5,4.58333333 C12.8934466,4.05873783 13.5109223,3.75 14.1666667,3.75 C14.822411,3.75 15.4398867,4.05873783 15.8333333,4.58333333"
                ></path>
            <line x1="4.58333333" y1="7.91666667" x2="7.08333333" y2="7.91666667" ></line>
            <path
                d="M7.08333333,8.54166667 C6.96827401,8.54166667 6.875,8.44839266 6.875,8.33333333 C6.875,8.21827401 6.96827401,8.125 7.08333333,8.125 C7.19839266,8.125 7.29166667,8.21827401 7.29166667,8.33333333 C7.29166667,8.44839266 7.19839266,8.54166667 7.08333333,8.54166667"
                ></path>
            <line x1="12.9166667" y1="7.91666667" x2="15.4166667" y2="7.91666667" ></line>
            <path
                d="M15.4166667,8.54166667 C15.3016073,8.54166667 15.2083333,8.44839266 15.2083333,8.33333333 C15.2083333,8.21827401 15.3016073,8.125 15.4166667,8.125 C15.531726,8.125 15.625,8.21827401 15.625,8.33333333 C15.625,8.44839266 15.531726,8.54166667 15.4166667,8.54166667"
                ></path>
            <path
                d="M4.16666667,4.58333333 C4.5601133,4.05873783 5.17758895,3.75 5.83333333,3.75 C6.48907772,3.75 7.10655337,4.05873783 7.5,4.58333333"
                ></path>
        </svg>

        <svg width="22px" height="22px" viewBox="0 0 22 22" role="button" class="yes" aria-label="Yes, this page is helpful">
            <circle  cx="10" cy="10" r="9.58333333"></circle>
            <path
                d="M5.41666667,8.125 C5.53172599,8.125 5.625,8.21827401 5.625,8.33333333 C5.625,8.44839266 5.53172599,8.54166667 5.41666667,8.54166667 C5.30160734,8.54166667 5.20833333,8.44839266 5.20833333,8.33333333 C5.20833333,8.21827401 5.30160734,8.125 5.41666667,8.125"
                ></path>
            <path
                d="M14.5833333,8.125 C14.468274,8.125 14.375,8.21827401 14.375,8.33333333 C14.375,8.44839266 14.468274,8.54166667 14.5833333,8.54166667 C14.6983927,8.54166667 14.7916667,8.44839266 14.7916667,8.33333333 C14.7916667,8.21827401 14.6983927,8.125 14.5833333,8.125"
                ></path>
            <path
                d="M13.2275,12.9166657 C13.4853075,12.9162808 13.7287776,13.035241 13.8869095,13.2388563 C14.0450415,13.4424715 14.1000278,13.7078123 14.0358333,13.9575 C13.562901,15.7999679 11.9021969,17.0882321 10,17.0882321 C8.09780311,17.0882321 6.43709903,15.7999679 5.96416667,13.9575 C5.89997223,13.7078123 5.95495852,13.4424715 6.11309045,13.2388563 C6.27122239,13.035241 6.51469246,12.9162808 6.7725,12.9166657 L13.2275,12.9166657 Z"
                ></path>
        </svg>
    </div>


</div>
    </div>
  </aside>
</div>
<main class="article">
<div class="toolbar" role="navigation">
  <div class="toolbar-wrapper">
    <button class="nav-toggle" aria-label="Toggle Table of Contents"></button>
    
    

    
    <a href="https://neo4j.com/docs" class="home-link" aria-label="Go to docs home page"></a>
    


    <nav class="breadcrumbs" aria-label="breadcrumbs menu">
  <ul>

    <li><a href="../../introduction/">Cypher Manual</a></li>

    <li><a href="../">
        Subqueries
    </a></li>
    <li><a href="./">
        CALL subqueries
    </a></li>
  </ul>
</nav>
      </div>
</div>

  
  <div class="content">
    <div id="skip-to-content"></div>
<article class="doc">
<div class="sect-header">
  <h1 class="page">CALL subqueries</h1>
</div>





<div id="preamble">
<div class="sectionbody">
<div class="paragraph">
<p>The <code>CALL</code> clause can be used to invoke subqueries that execute operations within a defined scope, thereby optimizing data handling and query efficiency.
Unlike other subqueries in Cypher<sup>&reg;</sup>, <code>CALL</code> subqueries can be used to perform changes to the database (e.g. <a href="../../clauses/create/" class="xref page">CREATE</a> new nodes).</p>
</div>
<div class="admonitionblock note">
<table>
<tr>
<td class="icon">
<i class="fa icon-note" title="Note"></i>
</td>
<td class="content">
The <code>CALL</code> clause is also used for calling procedures.
For descriptions of the <code>CALL</code> clause in this context, refer to the <a href="../../clauses/call/" class="xref page"><code>CALL</code> procedure</a>.
</td>
</tr>
</table>
</div>
</div>
</div>
<div class="sect1">
<h2 id="call-example-graph"><a class="anchor" href="#call-example-graph"></a>Example graph</h2>
<div class="sectionbody">
<div class="paragraph">
<p>A graph with the following schema is used for the examples below:</p>
</div>
<div class="imageblock popup">
<div class="content">
<img src="../../_images/call-subquery-graph.svg" alt="Example graph showing a play node connecting to a team node via a plays for relationship and an owes relationship coming from and back to the team node" width="600">
</div>
</div>
<div class="paragraph">
<p>To recreate the graph, run the following query in an empty Neo4j database:</p>
</div>
<div class="listingblock test-setup">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">CREATE (teamA:Team {name: 'Team A'}),
       (teamB:Team {name: 'Team B'}),
       (teamC:Team {name: 'Team C'}),
       (playerA:Player {name: 'Player A', age: 21}),
       (playerB:Player {name: 'Player B', age: 23}),
       (playerC:Player {name: 'Player C', age: 19}),
       (playerD:Player {name: 'Player D', age: 30}),
       (playerE:Player {name: 'Player E', age: 25}),
       (playerF:Player {name: 'Player F', age: 35}),
       (playerA)-[:PLAYS_FOR]-&gt;(teamA),
       (playerB)-[:PLAYS_FOR]-&gt;(teamA),
       (playerD)-[:PLAYS_FOR]-&gt;(teamB),
       (playerE)-[:PLAYS_FOR]-&gt;(teamC),
       (playerF)-[:PLAYS_FOR]-&gt;(teamC),
       (teamA)-[:OWES {dollars: 1500}]-&gt;(teamB),
       (teamA)-[:OWES {dollars: 3000}]-&gt;(teamB),
       (teamB)-[:OWES {dollars: 1700}]-&gt;(teamC),
       (teamC)-[:OWES {dollars: 5000}]-&gt;(teamB)</code></pre>
</div>
</div>
</div>
</div>
<div class="sect1">
<h2 id="_semantics_and_performance"><a class="anchor" href="#_semantics_and_performance"></a>Semantics and performance</h2>
<div class="sectionbody">
<div class="paragraph">
<p>A <code>CALL</code> subquery is executed once for each incoming row.
The variables returned in a subquery are available to the outer scope of the enclosing query.</p>
</div>
<div class="exampleblock">
<div class="title">Example 1. Basic example</div>
<div class="content">
<div class="paragraph">
<p>In this example, the <code>CALL</code> subquery executes three times, one for each row that the <a href="../../clauses/unwind/" class="xref page"><code>UNWIND</code></a> clause outputs.</p>
</div>
<div class="listingblock">
<div class="title">Query</div>
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">UNWIND [0, 1, 2] AS x
CALL () {
  RETURN 'hello' AS innerReturn
}
RETURN innerReturn</code></pre>
</div>
</div>
<table class="tableblock frame-all grid-all stretch queryresult">
<caption class="title">Table 1. Result</caption>
<colgroup>
<col style="width: 100%;">
</colgroup>
<thead>
<tr>
<th class="tableblock halign-left valign-top">innerReturn</th>
</tr>
</thead>
<tbody>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>'hello'</code></p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>'hello'</code></p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>'hello'</code></p></td>
</tr>
</tbody>
<tfoot>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock">Rows: 3</p></td>
</tr>
</tfoot>
</table>
</div>
</div>
<div class="paragraph">
<p>Each execution of a <code>CALL</code> subquery can observe changes from previous executions.
This allows for the accumulation of results and the progressive transformation of data within a single Cypher query.</p>
</div>
<div class="exampleblock">
<div class="title">Example 2. Incremental updates</div>
<div class="content">
<div class="paragraph">
<p>In this example, each iteration of the <code>CALL</code> subquery adds 1 to the <code>age</code> of <code>Player A</code> and the returned <code>newAge</code> reflects the <code>age</code> after each increment.</p>
</div>
<div class="listingblock">
<div class="title">Incrementally update the age property of a Player</div>
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">UNWIND [1, 2, 3] AS x
CALL () {
    MATCH (p:Player {name: 'Player A'})
    SET p.age = p.age + 1
    RETURN p.age AS newAge
}
MATCH (p:Player {name: 'Player A'})
RETURN x AS iteration, newAge, p.age AS totalAge</code></pre>
</div>
</div>
<table class="tableblock frame-all grid-all stretch queryresult">
<caption class="title">Table 2. Result</caption>
<colgroup>
<col style="width: 33.3333%;">
<col style="width: 33.3333%;">
<col style="width: 33.3334%;">
</colgroup>
<thead>
<tr>
<th class="tableblock halign-left valign-top">iteration</th>
<th class="tableblock halign-left valign-top">newAge</th>
<th class="tableblock halign-left valign-top">totalAge</th>
</tr>
</thead>
<tbody>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock">1</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">22</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">24</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock">2</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">23</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">24</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock">3</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">24</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">24</p></td>
</tr>
</tbody>
<tfoot>
<tr>
<td class="tableblock halign-left valign-top" colspan="3"><p class="tableblock">Rows: 3</p></td>
</tr>
</tfoot>
</table>
</div>
</div>
<div class="paragraph">
<p>The scoping effect of a <code>CALL</code> subquery means that the work performed during each execution of each row can be cleaned up as soon its execution ends, before proceeding to the next row.
This allows for efficient resource management and reduces memory overhead by ensuring that temporary data structures created during the subquery execution do not persist beyond their usefulness.
As a result, <code>CALL</code> subqueries can help maintain optimal performance and scalability, especially in complex or large-scale queries.</p>
</div>
<div class="exampleblock">
<div class="title">Example 3. Performance</div>
<div class="content">
<div class="paragraph">
<p>In this example, a <code>CALL</code> subquery is used to <a href="../../functions/aggregating/#functions-collect" class="xref page"><code>collect</code></a> a <code>LIST</code> containing all players who play for a particular team.</p>
</div>
<div class="listingblock">
<div class="title">Collect a list of all players playing for a particular team</div>
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (t:Team)
CALL (t) {
  MATCH (p:Player)-[:PLAYS_FOR]-&gt;(t)
  RETURN collect(p) as players
}
RETURN t AS team, players</code></pre>
</div>
</div>
<table class="tableblock frame-all grid-all stretch queryresult">
<caption class="title">Table 3. Result</caption>
<colgroup>
<col style="width: 33.3333%;">
<col style="width: 66.6667%;">
</colgroup>
<thead>
<tr>
<th class="tableblock halign-left valign-top">team</th>
<th class="tableblock halign-left valign-top">players</th>
</tr>
</thead>
<tbody>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>(:Team {name: "Team A"})</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>(:Player {name: "Player B", age: 23}), (:Player {name: "Player A", age: 24})]</code></p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>(:Team {name: "Team B"})</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>[(:Player {name: "Player D", age: 30})]</code></p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>(:Team {name: "Team C"})</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>[(:Player {name: "Player F", age: 35}), (:Player {name: "Player E", age: 25})]</code></p></td>
</tr>
</tbody>
<tfoot>
<tr>
<td class="tableblock halign-left valign-top" colspan="2"><p class="tableblock">Rows: 3</p></td>
</tr>
</tfoot>
</table>
<div class="paragraph">
<p>The <code>CALL</code> subquery ensures that each <code>Team</code> is processed separately (one row per <code>Team</code> node), rather than having to hold every <code>Team</code> and <code>Player</code> node in heap memory simultaneously before collecting them into lists.
Using a <code>CALL</code> subquery can therefore reduce the amount of heap memory required for an operation.</p>
</div>
</div>
</div>
</div>
</div>
<div class="sect1">
<h2 id="import-variables"><a class="anchor" href="#import-variables"></a>Importing variables</h2>
<div class="sectionbody">
<div class="paragraph">
<p>Variables from the outer scope must be explicitly imported into the inner scope of the <code>CALL</code> subquery, either by using a <a href="#variable-scope-clause">variable scope clause</a> or an <a href="#importing-with">importing <code>WITH</code> clause</a> (deprecated).
As the subquery is evaluated for each incoming input row, the imported variables are assigned the corresponding values from that row.</p>
</div>
<div class="sect2">
<h3 id="variable-scope-clause"><a class="anchor" href="#variable-scope-clause"></a>The variable scope clause</h3>
<div class="paragraph">
<p>Variables can be imported into a <code>CALL</code> subquery using a scope clause: <code>CALL (&lt;variable&gt;)</code>.
Using the scope clause disables the deprecated <a href="#importing-with">importing <code>WITH</code></a> clause.</p>
</div>
<div class="paragraph">
<p>A scope clause can be used to import all, specific, or none of the variables from the outer scope.</p>
</div>
<div class="exampleblock">
<div class="title">Example 4. Import specific variables from the outer scope</div>
<div class="content">
<div class="paragraph">
<p>This example only imports the <code>p</code> variable from the outer scope and uses it to create a new, randomly generated, <code>rating</code> property for each <code>Player</code> node.
It then returns the <code>Player</code> node with the highest <code>rating</code>.</p>
</div>
<div class="listingblock test-result-skip">
<div class="title">Import one variable from the outer scope</div>
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (p:Player), (t:Team)
CALL (p) {
  WITH rand() AS random
  SET p.rating = random
  RETURN p.name AS playerName, p.rating AS rating
}
RETURN playerName, rating, t AS team
ORDER BY rating
LIMIT 1</code></pre>
</div>
</div>
<table class="tableblock frame-all grid-all stretch queryresult">
<caption class="title">Table 4. Result</caption>
<colgroup>
<col style="width: 33.3333%;">
<col style="width: 33.3333%;">
<col style="width: 33.3334%;">
</colgroup>
<thead>
<tr>
<th class="tableblock halign-left valign-top">playerName</th>
<th class="tableblock halign-left valign-top">rating</th>
<th class="tableblock halign-left valign-top">team</th>
</tr>
</thead>
<tbody>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Player C"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>0.9307432039870395</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Team A"</code></p></td>
</tr>
</tbody>
<tfoot>
<tr>
<td class="tableblock halign-left valign-top" colspan="3"><p class="tableblock">Rows: 1</p></td>
</tr>
</tfoot>
</table>
<div class="paragraph">
<p>To import additional variables, include them within the parentheses after <code>CALL</code>, separated by commas.
For example, to import both variables from the <code>MATCH</code> clause in the above query, modify the scope clause accordingly: <code>CALL (p, t)</code>.</p>
</div>
</div>
</div>
<div class="exampleblock">
<div class="title">Example 5. Import all variables</div>
<div class="content">
<div class="paragraph">
<p>To import all variables from the outer scope, use <code>CALL (*)</code>.
This example imports both the <code>p</code> and <code>t</code> variables and sets a new <code>lastUpdated</code> property on both.</p>
</div>
<div class="listingblock test-result-skip">
<div class="title">Import all variables from the outer scope</div>
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (p:Player), (t:Team)
CALL (*) {
  SET p.lastUpdated = timestamp()
  SET t.lastUpdated = timestamp()
}
RETURN p.name AS playerName,
       p.lastUpdated AS playerUpdated,
       t.name AS teamName,
       t.lastUpdated AS teamUpdated
LIMIT 1</code></pre>
</div>
</div>
<table class="tableblock frame-all grid-all stretch queryresult">
<caption class="title">Table 5. Result</caption>
<colgroup>
<col style="width: 25%;">
<col style="width: 25%;">
<col style="width: 25%;">
<col style="width: 25%;">
</colgroup>
<thead>
<tr>
<th class="tableblock halign-left valign-top">playerName</th>
<th class="tableblock halign-left valign-top">playerUpdated</th>
<th class="tableblock halign-left valign-top">teamName</th>
<th class="tableblock halign-left valign-top">teamUpdated</th>
</tr>
</thead>
<tbody>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Player A"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>1719304206653</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Team A"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>1719304206653</code></p></td>
</tr>
</tbody>
<tfoot>
<tr>
<td class="tableblock halign-left valign-top" colspan="4"><p class="tableblock">Rows: 1</p></td>
</tr>
</tfoot>
</table>
</div>
</div>
<div class="exampleblock">
<div class="title">Example 6. Import no variables</div>
<div class="content">
<div class="paragraph">
<p>To import no variables from the outer scope, use <code>CALL ()</code>.</p>
</div>
<div class="listingblock">
<div class="title">Import no variables from the outer scope</div>
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (t:Team)
CALL () {
  MATCH (p:Player)
  RETURN count(p) AS totalPlayers
}
RETURN count(t) AS totalTeams, totalPlayers</code></pre>
</div>
</div>
<table class="tableblock frame-all grid-all stretch queryresult">
<caption class="title">Table 6. Result</caption>
<colgroup>
<col style="width: 50%;">
<col style="width: 50%;">
</colgroup>
<thead>
<tr>
<th class="tableblock halign-left valign-top">totalTeams</th>
<th class="tableblock halign-left valign-top">totalPlayers</th>
</tr>
</thead>
<tbody>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>3</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>6</code></p></td>
</tr>
</tbody>
<tfoot>
<tr>
<td class="tableblock halign-left valign-top" colspan="2"><p class="tableblock">Rows: 1</p></td>
</tr>
</tfoot>
</table>
</div>
</div>
<div class="admonitionblock note">
<table>
<tr>
<td class="icon">
<i class="fa icon-note" title="Note"></i>
</td>
<td class="content">
<div class="paragraph">
<p><code>CALL</code> subqueries without a variable scope clause are deprecated.</p>
</div>
<div class="listingblock">
<div class="title">Deprecated</div>
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (t:Team)
CALL {
  MATCH (p:Player)
  RETURN count(p) AS totalPlayers
}
RETURN count(t) AS totalTeams, totalPlayers</code></pre>
</div>
</div>
</td>
</tr>
</table>
</div>
<div class="sect3">
<h4 id="variable-scope-rules"><a class="anchor" href="#variable-scope-rules"></a>Rules</h4>
<div class="ulist">
<ul>
<li>
<p>The scope clauses variables can be globally referenced in the subquery.
A subsequent <code>WITH</code> within the subquery cannot delist an imported variable.
The deprecated <a href="#importing-with">importing <code>WITH</code> clause</a> behaves differently because imported variables can only be referenced from the first line and can be delisted by subsequent clauses.</p>
</li>
<li>
<p>Variables cannot be aliased in the scope clause.
Only simple variable references are allowed.</p>
</li>
</ul>
</div>
<div class="listingblock test-fail">
<div class="title">Not allowed</div>
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (t:Team)
CALL (t AS teams) {
  MATCH (p:Player)-[:PLAYS_FOR]-&gt;(teams)
  RETURN collect(p) as players
}
RETURN t AS teams, players</code></pre>
</div>
</div>
<div class="ulist">
<ul>
<li>
<p>The scope clauses variables cannot be re-declared in the subquery.</p>
</li>
</ul>
</div>
<div class="listingblock test-fail">
<div class="title">Not allowed</div>
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (t:Team)
CALL (t) {
  WITH 'New team' AS t
  MATCH (p:Player)-[:PLAYS_FOR]-&gt;(t)
  RETURN collect(p) as players
}
RETURN t AS team, players</code></pre>
</div>
</div>
<div class="ulist">
<ul>
<li>
<p>The subquery cannot return a variable name which already exists in the outer scope.
To return imported variables they must be renamed.</p>
</li>
</ul>
</div>
<div class="listingblock test-fail">
<div class="title">Not allowed</div>
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (t:Team)
CALL () {
  RETURN 1 AS t
}
RETURN t</code></pre>
</div>
</div>
</div>
</div>
<div class="sect2 label--deprecated">
<h3 id="importing-with"><a class="anchor" href="#importing-with"></a>Importing <code>WITH</code> clause</h3>
<div class="paragraph">
<p>Variables can also be imported into a <code>CALL</code> subquery using an importing <code>WITH</code> clause.
Note that this syntax is not <a href="../../appendix/gql-conformance/" class="xref page">GQL conformant</a>.</p>
</div>
<div class="listingblock">
<div class="title">Variables imported by <code>WITH</code> clause</div>
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (t:Team)
CALL {
  WITH t
  MATCH (p:Player)-[:PLAYS_FOR]-&gt;(t)
  RETURN collect(p) as players
}
RETURN t AS teams, players</code></pre>
</div>
</div>
<details>
<summary class="title">Click to read more about importing variables using the <code>WITH</code> clause</summary>
<div class="content">
<div class="ulist">
<ul>
<li>
<p>Just as when using a variable scope clause, a subquery using an importing <code>WITH</code> clause cannot return a variable name which already exists in the outer scope.
To return imported variables they must be renamed.</p>
</li>
<li>
<p>The importing <code>WITH</code> clause must the first clause of a subquery (or the second clause, if directly following a <code>USE</code> clause).</p>
</li>
<li>
<p>It is not possible to follow an importing <code>WITH</code> clause with any of the following clauses: <code>DISTINCT</code>, <code>ORDER BY</code>, <code>WHERE</code>, <code>SKIP</code>, and <code>LIMIT</code>.</p>
</li>
</ul>
</div>
<div class="paragraph">
<p>Attempting any of the above, will throw an error.
For example, the following query using a <code>WHERE</code> clause after an importing <code>WITH</code> clause will throw an error:</p>
</div>
<div class="listingblock test-fail">
<div class="title">Not Allowed</div>
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">UNWIND [[1,2],[1,2,3,4],[1,2,3,4,5]] AS l
CALL {
  WITH l
  WHERE size(l) &gt; 2
  RETURN l AS largeLists
}
RETURN largeLists</code></pre>
</div>
</div>
<div class="listingblock">
<div class="title">Error message</div>
<div class="content">
<pre class="highlightjs highlight"><code class="language-error hljs" data-lang="error">Importing WITH should consist only of simple references to outside variables.
WHERE is not allowed.</code></pre>
</div>
</div>
<div class="paragraph">
<p>A solution to this restriction, necessary for any filtering or ordering of an importing <code>WITH</code> clause, is to declare a second <code>WITH</code> clause after the importing <code>WITH</code> clause.
This second <code>WITH</code> clause will act as a regular <code>WITH</code> clause.
For example, the following query will not throw an error:</p>
</div>
<div class="listingblock">
<div class="title">Allowed</div>
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">UNWIND [[1,2],[1,2,3,4],[1,2,3,4,5]] AS l
CALL {
  WITH l
	WITH l
	WHERE size(l) &gt; 2
  RETURN l AS largeLists
}
RETURN largeLists</code></pre>
</div>
</div>
<table class="tableblock frame-all grid-all stretch queryresult">
<caption class="title">Table 7. Result</caption>
<colgroup>
<col style="width: 100%;">
</colgroup>
<thead>
<tr>
<th class="tableblock halign-left valign-top">largeLists</th>
</tr>
</thead>
<tbody>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>[1, 2, 3, 4]</code></p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>[1, 2, 3, 4, 5]</code></p></td>
</tr>
</tbody>
<tfoot>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock">Rows: 2</p></td>
</tr>
</tfoot>
</table>
</div>
</details>
</div>
</div>
</div>
<div class="sect1">
<h2 id="optional-call"><a class="anchor" href="#optional-call"></a>Optional subquery calls</h2>
<div class="sectionbody">
<div class="paragraph">
<p><code>OPTIONAL CALL</code> allows for optional execution of a <code>CALL</code> subquery.
Similar to <a href="../../clauses/optional-match/" class="xref page"><code>OPTIONAL MATCH</code></a> any empty rows produced by the <code>OPTIONAL CALL</code> subquery will return <code>null</code>.</p>
</div>
<div class="exampleblock">
<div class="title">Example 7. Difference between using <code>CALL</code> and <code>OPTIONAL CALL</code></div>
<div class="content">
<div class="paragraph">
<p>This example, which finds the team that each <code>Player</code> plays for, highlights the difference between using <code>CALL</code> and <code>OPTIONAL CALL</code>.</p>
</div>
<div class="listingblock">
<div class="title">Regular subquery <code>CALL</code></div>
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (p:Player)
CALL (p) {
    MATCH (p)-[:PLAYS_FOR]-&gt;(team:Team)
    RETURN team
}
RETURN p.name AS playerName, team.name AS team</code></pre>
</div>
</div>
<table class="tableblock frame-all grid-all stretch queryresult">
<caption class="title">Table 8. Result</caption>
<colgroup>
<col style="width: 50%;">
<col style="width: 50%;">
</colgroup>
<thead>
<tr>
<th class="tableblock halign-left valign-top">playerName</th>
<th class="tableblock halign-left valign-top">team</th>
</tr>
</thead>
<tbody>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Player A"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Team A"</code></p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Player B"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Team A"</code></p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Player D"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Team B"</code></p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Player E"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Team C"</code></p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Player F"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Team C"</code></p></td>
</tr>
</tbody>
<tfoot>
<tr>
<td class="tableblock halign-left valign-top" colspan="2"><p class="tableblock">Rows: 5</p></td>
</tr>
</tfoot>
</table>
<div class="paragraph">
<p>Note that no results are returned for <code>Player C</code>, since they are not connected to any <code>Team</code> with a <code>PLAYS_FOR</code> relationship.</p>
</div>
<div class="listingblock">
<div class="title">Query using regular <code>OPTIONAL CALL</code></div>
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (p:Player)
OPTIONAL CALL (p) {
    MATCH (p)-[:PLAYS_FOR]-&gt;(team:Team)
    RETURN team
}
RETURN p.name AS playerName, team.name AS team</code></pre>
</div>
</div>
<div class="paragraph">
<p>Now all <code>Player</code> nodes, regardless of whether they have any <code>PLAYS_FOR</code> relationships connected to a <code>Team</code>, are returned.</p>
</div>
<table class="tableblock frame-all grid-all stretch queryresult">
<caption class="title">Table 9. Result</caption>
<colgroup>
<col style="width: 50%;">
<col style="width: 50%;">
</colgroup>
<thead>
<tr>
<th class="tableblock halign-left valign-top">playerName</th>
<th class="tableblock halign-left valign-top">team</th>
</tr>
</thead>
<tbody>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Player A"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Team A"</code></p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Player B"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Team A"</code></p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Player C"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>null</code></p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Player D"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Team B"</code></p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Player E"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Team C"</code></p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Player F"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Team C"</code></p></td>
</tr>
</tbody>
<tfoot>
<tr>
<td class="tableblock halign-left valign-top" colspan="2"><p class="tableblock">Rows: 6</p></td>
</tr>
</tfoot>
</table>
</div>
</div>
</div>
</div>
<div class="sect1 label--new-2025.06">
<h2 id="conditional-call"><a class="anchor" href="#conditional-call"></a>Conditional <code>CALL</code> subqueries</h2>
<div class="sectionbody">
<div class="paragraph">
<p><code>WHEN</code> can be used inside <code>CALL</code> subqueries to execute branches conditionally when a predicate evaluates to <code>true</code>.
Note that the names and the number of columns returned by the different <code>WHEN</code> branches must be identical.
For more information, see <a href="../../queries/composed-queries/conditional-queries/#conditional-subqueries" class="xref page">Conditional queries &#8594; Conditional subqueries</a>.</p>
</div>
<div class="exampleblock">
<div class="title">Example 8. Conditional <code>CALL</code> subqueries</div>
<div class="content">
<div class="paragraph">
<p>This example uses conditional logic to categorize players based on age by executing <code>WHEN</code>/<code>ELSE</code> branches, setting the <code>ageGroup</code> property as either <code>"Senior"</code> or <code>"Junior"</code> for each player depending on their age.</p>
</div>
<div class="listingblock">
<div class="title">Categorize players by age using a conditional WHEN and ELSE for each team.</div>
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (t:Team)
OPTIONAL MATCH (p:Player)-[:PLAYS_FOR]-&gt;(t)
CALL (*) {
  WHEN p.age &gt; 25 THEN {
    SET p.ageGroup = "Senior"
    RETURN p.name AS player, p.ageGroup AS ageGroup
  }
  ELSE {
     SET p.ageGroup = "Junior"
     RETURN p.name AS player, p.ageGroup AS ageGroup
  }
}
RETURN player, ageGroup</code></pre>
</div>
</div>
<table class="tableblock frame-all grid-all stretch queryresult">
<caption class="title">Table 10. Result</caption>
<colgroup>
<col style="width: 50%;">
<col style="width: 50%;">
</colgroup>
<thead>
<tr>
<th class="tableblock halign-left valign-top">player</th>
<th class="tableblock halign-left valign-top">ageGroup</th>
</tr>
</thead>
<tbody>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Player A"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Junior"</code></p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Player B"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Junior"</code></p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Player D"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Senior"</code></p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Player E"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Junior"</code></p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Player F"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Senior"</code></p></td>
</tr>
</tbody>
<tfoot>
<tr>
<td class="tableblock halign-left valign-top" colspan="2"><p class="tableblock">Rows: 5</p></td>
</tr>
</tfoot>
</table>
</div>
</div>
</div>
</div>
<div class="sect1">
<h2 id="call-execution-order"><a class="anchor" href="#call-execution-order"></a>Execution order of CALL subqueries</h2>
<div class="sectionbody">
<div class="paragraph">
<p>The order in which rows from the outer scope are passed into subqueries is not defined.
If the results of the subquery depend on the order of these rows, use an <code>ORDER BY</code> clause before the <code>CALL</code> clause to guarantee a specific processing order for the rows.</p>
</div>
<div class="exampleblock">
<div class="title">Example 9. Ordering results before <code>CALL</code> subquery</div>
<div class="content">
<div class="paragraph">
<p>This example creates a linked list of all <code>Player</code> nodes in order of ascending <code>age</code>.</p>
</div>
<div class="paragraph">
<p>The <code>CALL</code> clause is relying on the incoming row ordering to ensure that a correctly ordered linked list is created, thus the incoming rows must be ordered with a preceding <code>ORDER BY</code> clause.</p>
</div>
<div class="listingblock">
<div class="title">Order results before a <code>CALL</code> subquery</div>
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (player:Player)
WITH player
ORDER BY player.age ASC LIMIT 1
  SET player:ListHead
WITH *
MATCH (nextPlayer: Player&amp;!ListHead)
WITH nextPlayer
ORDER BY nextPlayer.age
CALL (nextPlayer) {
  MATCH (current:ListHead)
    REMOVE current:ListHead
    SET nextPlayer:ListHead
    CREATE(current)-[:IS_YOUNGER_THAN]-&gt;(nextPlayer)
  RETURN current AS from, nextPlayer AS to
}
RETURN
  from.name AS name,
  from.age AS age,
  to.name AS closestOlderName,
  to.age AS closestOlderAge</code></pre>
</div>
</div>
<table class="tableblock frame-all grid-all stretch queryresult">
<caption class="title">Table 11. Result</caption>
<colgroup>
<col style="width: 25%;">
<col style="width: 25%;">
<col style="width: 25%;">
<col style="width: 25%;">
</colgroup>
<thead>
<tr>
<th class="tableblock halign-left valign-top">name</th>
<th class="tableblock halign-left valign-top">age</th>
<th class="tableblock halign-left valign-top">closestOlderName</th>
<th class="tableblock halign-left valign-top">closestOlderAge</th>
</tr>
</thead>
<tbody>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Player C"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>19</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Player B"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>23</code></p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Player B"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>23</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Player A"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>24</code></p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Player A"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>24</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Player E"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>25</code></p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Player E"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>25</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Player D"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>30</code></p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Player D"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>30</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Player F"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>35</code></p></td>
</tr>
</tbody>
<tfoot>
<tr>
<td class="tableblock halign-left valign-top" colspan="4"><p class="tableblock">Rows: 5</p></td>
</tr>
</tfoot>
</table>
</div>
</div>
</div>
</div>
<div class="sect1">
<h2 id="call-post-union"><a class="anchor" href="#call-post-union"></a>Post-union processing</h2>
<div class="sectionbody">
<div class="paragraph">
<p>Call subqueries can be used to further process the results of a <a href="../../queries/composed-queries/combined-queries/" class="xref page"><code>UNION</code></a> query.</p>
</div>
<div class="exampleblock">
<div class="title">Example 10. Using <code>UNION</code> within a <code>CALL</code> subquery</div>
<div class="content">
<div class="paragraph">
<p>This example query finds the youngest and the oldest <code>Player</code> in the graph.</p>
</div>
<div class="listingblock">
<div class="title">Find the oldest and youngest players</div>
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">CALL () {
  MATCH (p:Player)
  RETURN p
  ORDER BY p.age ASC
  LIMIT 1
UNION
  MATCH (p:Player)
  RETURN p
  ORDER BY p.age DESC
  LIMIT 1
}
RETURN p.name AS playerName, p.age AS age</code></pre>
</div>
</div>
<table class="tableblock frame-all grid-all stretch queryresult">
<caption class="title">Table 12. Result</caption>
<colgroup>
<col style="width: 50%;">
<col style="width: 50%;">
</colgroup>
<thead>
<tr>
<th class="tableblock halign-left valign-top">playerName</th>
<th class="tableblock halign-left valign-top">age</th>
</tr>
</thead>
<tbody>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Player C"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>19</code></p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Player F"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>35</code></p></td>
</tr>
</tbody>
<tfoot>
<tr>
<td class="tableblock halign-left valign-top" colspan="2"><p class="tableblock">Rows: 2</p></td>
</tr>
</tfoot>
</table>
<div class="paragraph">
<p>If different parts of a result should be matched differently, with some aggregation over the whole result, subqueries need to be used.
The example below query uses a <code>CALL</code> subquery in combination with <code>UNION ALL</code> to determine how much each <code>Team</code> in the graph owes or is owed.</p>
</div>
<div class="listingblock">
<div class="title">Find how much every team is owed</div>
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (t:Team)
CALL (t) {
  OPTIONAL MATCH (t)-[o:OWES]-&gt;(other:Team)
  RETURN o.dollars * -1 AS moneyOwed
  UNION ALL
  OPTIONAL MATCH (other)-[o:OWES]-&gt;(t)
  RETURN o.dollars AS moneyOwed
}
RETURN t.name AS team, sum(moneyOwed) AS amountOwed
ORDER BY amountOwed DESC</code></pre>
</div>
</div>
<table class="tableblock frame-all grid-all stretch queryresult">
<caption class="title">Table 13. Result</caption>
<colgroup>
<col style="width: 50%;">
<col style="width: 50%;">
</colgroup>
<thead>
<tr>
<th class="tableblock halign-left valign-top">team</th>
<th class="tableblock halign-left valign-top">amountOwed</th>
</tr>
</thead>
<tbody>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Team B"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>7800</code></p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Team C"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>-3300</code></p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Team A"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>-4500</code></p></td>
</tr>
</tbody>
<tfoot>
<tr>
<td class="tableblock halign-left valign-top" colspan="2"><p class="tableblock">Rows: 3</p></td>
</tr>
</tfoot>
</table>
</div>
</div>
</div>
</div>
<div class="sect1">
<h2 id="call-aggregation"><a class="anchor" href="#call-aggregation"></a>Aggregations</h2>
<div class="sectionbody">
<div class="paragraph">
<p>Returning subqueries change the number of results of the query.
The result of the <code>CALL</code> subquery is the combined result of evaluating the subquery for each input row.</p>
</div>
<div class="exampleblock">
<div class="title">Example 11. <code>CALL</code> subquery changing returned rows of outer query</div>
<div class="content">
<div class="paragraph">
<p>The following example finds the name of each <code>Player</code> and the team they play for.
No rows are returned for <code>Player C</code>, since they are not connected to a <code>Team</code> with a <code>PLAYS_FOR</code> relationship.
The number of results of the subquery thus changed the number of results of the enclosing query.</p>
</div>
<div class="listingblock">
<div class="title">Find the friends of players</div>
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (p:Player)
CALL (p) {
  MATCH (p)-[:PLAYS_FOR]-&gt;(team:Team)
  RETURN team.name AS team
}
RETURN p.name AS playerName, team</code></pre>
</div>
</div>
<table class="tableblock frame-all grid-all stretch queryresult">
<caption class="title">Table 14. Result</caption>
<colgroup>
<col style="width: 50%;">
<col style="width: 50%;">
</colgroup>
<thead>
<tr>
<th class="tableblock halign-left valign-top">playerName</th>
<th class="tableblock halign-left valign-top">team</th>
</tr>
</thead>
<tbody>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Player A"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Team A"</code></p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Player B"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Team A"</code></p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Player D"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Team B"</code></p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Player E"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Team C"</code></p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Player F"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Team C"</code></p></td>
</tr>
</tbody>
<tfoot>
<tr>
<td class="tableblock halign-left valign-top" colspan="2"><p class="tableblock">Rows: 5</p></td>
</tr>
</tfoot>
</table>
</div>
</div>
<div class="exampleblock">
<div class="title">Example 12. <code>CALL</code> subqueries and isolated aggregations</div>
<div class="content">
<div class="paragraph">
<p>Subqueries can also perform isolated aggregations.
The below example uses the <a href="../../functions/aggregating/#functions-sum" class="xref page">sum()</a> function to count how much money is owed between the <code>Team</code> nodes in the graph.
Note that the <code>owedAmount</code> for <code>Team A</code> is the aggregated results of two <code>OWES</code> relationships to <code>Team B</code>.</p>
</div>
<div class="listingblock">
<div class="title">Find how much each team owes</div>
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (t:Team)
CALL (t) {
  MATCH (t)-[o:OWES]-&gt;(t2:Team)
  RETURN sum(o.dollars) AS owedAmount, t2.name AS owedTeam
}
RETURN t.name AS owingTeam, owedAmount, owedTeam</code></pre>
</div>
</div>
<table class="tableblock frame-all grid-all stretch queryresult">
<caption class="title">Table 15. Result</caption>
<colgroup>
<col style="width: 33.3333%;">
<col style="width: 33.3333%;">
<col style="width: 33.3334%;">
</colgroup>
<thead>
<tr>
<th class="tableblock halign-left valign-top">owingTeam</th>
<th class="tableblock halign-left valign-top">owedAmount</th>
<th class="tableblock halign-left valign-top">owedTeam</th>
</tr>
</thead>
<tbody>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Team A"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>4500</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Team B"</code></p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Team B"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>1700</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Team C"</code></p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Team C"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>5000</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Team B"</code></p></td>
</tr>
</tbody>
<tfoot>
<tr>
<td class="tableblock halign-left valign-top" colspan="3"><p class="tableblock">Rows: 4</p></td>
</tr>
</tfoot>
</table>
</div>
</div>
</div>
</div>
<div class="sect1">
<h2 id="call-returning-unit"><a class="anchor" href="#call-returning-unit"></a>Note on returning subqueries and unit subqueries</h2>
<div class="sectionbody">
<div class="paragraph">
<p>The examples above have all used subqueries which end with a <code>RETURN</code> clause.
These subqueries are called <em>returning subqueries</em>.</p>
</div>
<div class="paragraph">
<p>A subquery is evaluated for each incoming input row.
Every output row of a returning subquery is combined with the input row to build the result of the subquery.
That means that a returning subquery will influence the number of rows.
If the subquery does not return any rows, there will be no rows available after the subquery.</p>
</div>
<div class="paragraph">
<p>Subqueries without a <code>RETURN</code> statement are called <em>unit subqueries</em>.
Unit subqueries are used for their ability to alter the graph with clauses such as <code>CREATE</code>, <code>MERGE</code>, <code>SET</code>, and <code>DELETE</code>.
They do not explicitly return anything, and this means that the number of rows present after the subquery is the same as was going into the subquery.</p>
</div>
</div>
</div>
<div class="sect1">
<h2 id="call-unit-subqueries"><a class="anchor" href="#call-unit-subqueries"></a>Unit subqueries</h2>
<div class="sectionbody">
<div class="paragraph">
<p>Unit subqueries are used for their ability to alter the graph with updating clauses.
They do not impact the amount of rows returned by the enclosing query.</p>
</div>
<div class="paragraph">
<p>This example query creates 3 clones of each existing <code>Player</code> node in the graph.
As the subquery is a unit subquery, it does not change the number of rows of the enclosing query.</p>
</div>
<div class="listingblock">
<div class="title">Create cloned nodes</div>
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (p:Player)
CALL (p) {
  UNWIND range (1, 3) AS i
  CREATE (:Person {name: p.name})
}
RETURN count(*)</code></pre>
</div>
</div>
<table class="tableblock frame-all grid-all stretch queryresult">
<caption class="title">Table 16. Result</caption>
<colgroup>
<col style="width: 100%;">
</colgroup>
<thead>
<tr>
<th class="tableblock halign-left valign-top">count(*)</th>
</tr>
</thead>
<tbody>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>6</code></p></td>
</tr>
</tbody>
<tfoot>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock">Rows: 1<br>
Nodes created: 18<br>
Properties set: 18<br>
Labels added: 18</p></td>
</tr>
</tfoot>
</table>
</div>
</div>
<div class="sect1">
<h2 id="call-rules"><a class="anchor" href="#call-rules"></a>Summary</h2>
<div class="sectionbody">
<div class="ulist">
<ul>
<li>
<p><code>CALL</code> subqueries optimize data handling and query efficiency, and can perform changes to the database.</p>
</li>
<li>
<p><code>CALL</code> subqueries allow for row-by-row data transformation and enable the accumulation of results across multiple rows, facilitating complex operations that depend on intermediate or aggregated data.</p>
</li>
<li>
<p><code>CALL</code> subqueries can only refer to variables from the enclosing query if they are explicitly imported by either a variable scope clause or an importing <code>WITH</code> clause (deprecated).</p>
</li>
<li>
<p>All variables that are returned from a <code>CALL</code> subquery are afterwards available in the enclosing query.</p>
</li>
<li>
<p>Returning subqueries (with <code>RETURN</code> clause) influence the number of output rows, while unit subqueries (without <code>RETURN</code> clause) perform graph updates without changing the number of rows.</p>
</li>
<li>
<p>An <code>ORDER BY</code> clause can be used before <code>CALL</code> subqueries to ensure a specific order.</p>
</li>
<li>
<p><code>CALL</code> subqueries can be used in combination with <code>UNION</code> to process and aggregate different parts of a query result.</p>
</li>
</ul>
</div>
</div>
</div>
<nav class="pagination" aria-label="pagination links">
  <span class="prev"><a href="../" aria-label="Previous: Subqueries">Subqueries</a></span>

  <span class="next"><a href="../subqueries-in-transactions/" aria-label="Next: CALL subqueries in transactions">CALL subqueries in transactions</a></span>
</nav>
</article>
    <aside class="toc sidebar" data-title="Contents"
  data-levels="2">
  <div class="toc-menu">
    <div class="toc-menu-placeholder"></div>

      </div>
  </aside>  </div>
  
</main>
</div>
<footer class="footer">
  <div class="wrapper">

  <div class="column logo">
    <div class="logo-footer"></div>
  </div>
  
  <div class="column links">
    <h2>Learn</h2>
    <ul>
      <li><i class="fa fa-wrench" aria-hidden="true"></i> <a rel="noopener" href="https://neo4j.com/sandbox/?ref=developer-footer">Sandbox</a></li>
      <li><i class="fa fa-comments-o" aria-hidden="true"></i> <a rel="noopener" href="https://community.neo4j.com?ref=developer-footer" target="_blank">Neo4j Community Site</a></li>
      <li><i class="fa fa-book" aria-hidden="true"></i> <a rel="noopener" href="https://medium.com/neo4j" target="_blank">Neo4j Developer Blog</a></li>
      <li><i class="fa fa-youtube" aria-hidden="true"></i> <a rel="noopener" href="https://www.youtube.com/neo4j" target="_blank">Neo4j Videos</a></li>
      <li><i class="fa fa-graduation-cap" aria-hidden="true"></i> <a rel="noopener" href="https://neo4j.com/graphacademy/?ref=developer-footer">GraphAcademy</a></li>
      <li><i class="fa fa-flask" aria-hidden="true"></i> <a href="https://neo4j.com/labs/?ref=developer-footer">Neo4j Labs</a></li>
    </ul>
  </div>
  <div class="column links">
    <h2>Social</h2>
    <ul>
      <li><i class="fa fa-twitter" aria-hidden="true"></i> <a rel="noopener" href="https://twitter.com/neo4j" target="_blank">Twitter</a></li>
      <li><i class="fa fa-meetup" aria-hidden="true"></i> <a rel="noopener" href="https://www.meetup.com/Neo4j-Online-Meetup/" target="_blank">Meetups</a></li>
      <li><i class="fa fa-github" aria-hidden="true"></i> <a rel="noopener" href="https://github.com/neo4j/neo4j" target="_blank">Github</a></li>
      <li><i class="fa fa-stack-overflow" aria-hidden="true"></i> <a rel="noopener" href="https://stackoverflow.com/questions/tagged/neo4j" target="_blank">Stack Overflow</a></li>

      <li class="speaker-program"><a href="https://docs.google.com/forms/d/e/1FAIpQLSdEcNnMruES5iwvOVYovmS1D_P1ZL_HdUOitFrwrvruv5PZvA/viewform">Want to Speak?</a></li>
    </ul>
  </div>
  <div class="column links">
    <h2><a href="https://neo4j.com/contact-us/?ref=footer">Contact Us </a></h2>
    <ul>
      <li>US: 1-855-636-4532</li>
      <li>Sweden +46 171 480 113</li>
      <li>UK: +44 20 3868 3223</li>
      <li>France: +33 (0) 1 88 46 13 20</li>
    </ul>
  </div>

    <div class="column">
    <p> <span id="footer-copyright-year">2025</span> Neo4j, Inc.<br>
      <a href="https://neo4j.com/terms/">Terms</a> | <a href="https://neo4j.com/privacy-policy/">Privacy </a> | <a href="https://neo4j.com/sitemap/">Sitemap</a></p>
    <p>Neo4j<sup></sup>, Neo Technology<sup></sup>, Cypher<sup></sup>, Neo4j<sup></sup> Bloom<sup></sup> and
      Neo4j<sup></sup> Aura<sup></sup> are registered trademarks
      of Neo4j, Inc. All other marks are owned by their respective companies.</p>
  </div>

  
</div>
</footer>

  <script src="../../../../assets/js/vendor/auth0.js"></script>
  <script src="../../../../assets/js/site.js"></script>
  <script async src="../../../../assets/js/vendor/highlight.js"></script>
  <script async src="../../../../assets/js/vendor/image-zoom.js"></script>



<div id="neo4j-algolia-search-v2"></div>
<script src="https://neo4j.com/wp-content/themes/neo4jweb/assets/neo4j-react-modules-assets/search-preact/chunkless/bundle.js"></script>
<script src="https://neo4j.com/wp-content/themes/neo4jweb/assets/neo4j-react-modules-assets/search-preact/chunkless/polyfill.js"></script>
<script>window.algoliaSearchOptions = {indexName: "docs",placeholder: "Search Documentation",template: "docs"}</script>
  </body>
</html>
