:description: This section contains an overview of operators.
[[query-operators]]
= Operators

This page contains an overview of the available Cypher operators.

[[query-operators-summary]]
== Operators at a glance

[subs=none]
|===
| xref::syntax/operators.adoc#query-operators-aggregation[Aggregation operators] | `DISTINCT`
| xref::syntax/operators.adoc#query-operators-property[Property operators] | `.` for static property access, `[]` for dynamic property access, `=` for replacing all properties, `+=` for mutating specific properties
| xref::syntax/operators.adoc#query-operators-map[Map operators]       |  `.` for static value access by key, `[]` for dynamic value access by key
|===


[[query-operators-aggregation]]
== Aggregation operators

The aggregation operators comprise:

* remove duplicates values: `DISTINCT`

[[syntax-using-the-distinct-operator]]
=== Using the `DISTINCT` operator

Retrieve the unique eye colors from `Person` nodes.

.Query
[source, cypher]
----
CREATE
  (a:Person {name: 'Anne', eyeColor: 'blue'}),
  (b:Person {name: 'Bill', eyeColor: 'brown'}),
  (c:Person {name: 'Carol', eyeColor: 'blue'})
WITH [a, b, c] AS ps
UNWIND ps AS p
RETURN DISTINCT p.eyeColor
----

Even though both *'Anne'* and *'Carol'* have blue eyes, *'blue'* is only returned once.

.Result
[role="queryresult",options="header,footer",cols="1*<m"]
|===
| +p.eyeColor+
| +"blue"+
| +"brown"+

1+d|Rows: 2
|===

`DISTINCT` is commonly used in conjunction with xref::functions/aggregating.adoc[aggregating functions].


[[query-operators-property]]
== Property operators

The property operators pertain to a node or a relationship, and comprise:

* statically access the property of a node or relationship using the dot operator: `.`
* dynamically access the property of a node or relationship using the subscript operator: `[]`
* property replacement `=` for replacing all properties of a node or relationship
* property mutation operator `+=` for setting specific properties of a node or relationship


[[syntax-accessing-the-property-of-a-node-or-relationship]]
=== Statically accessing a property of a node or relationship using the `.` operator

////
[source, cypher, role=test-setup]
----
Match (a:Person) delete a;
----
////

.Query
[source, cypher]
----
CREATE
  (a:Person {name: 'Jane', livesIn: 'London'}),
  (b:Person {name: 'Tom', livesIn: 'Copenhagen'})
WITH a, b
MATCH (p:Person)
RETURN  p.name
----

.Result
[role="queryresult",options="header,footer",cols="1*<m"]
|===
| +p.name+
| +"Jane"+
| +"Tom"+

1+d|Rows: 2
|===


[[syntax-filtering-on-a-dynamically-computed-property-key]]
=== Filtering on a dynamically-computed property key using the `[]` operator

.Query
[source, cypher]
----
CREATE
  (a:Restaurant {name: 'Hungry Jo', rating_hygiene: 10, rating_food: 7}),
  (b:Restaurant {name: 'Buttercup Tea Rooms', rating_hygiene: 5, rating_food: 6}),
  (c1:Category {name: 'hygiene'}),
  (c2:Category {name: 'food'})
WITH a, b, c1, c2
MATCH (restaurant:Restaurant), (category:Category)
WHERE restaurant["rating_" + category.name] > 6
RETURN DISTINCT restaurant.name
----

.Result
[role="queryresult",options="header,footer",cols="1*<m"]
|===
| +restaurant.name+
| +"Hungry Jo"+

1+d|Rows: 1
|===

See also xref::clauses/where.adoc#filter-on-dynamic-properties[`WHERE` -> Filter on dynamic properties].

[NOTE]
====
The behavior of the `[]` operator with respect to `null` is detailed xref::values-and-types/working-with-null.adoc#cypher-null-bracket-operator[here].
====


[[syntax-property-replacement-operator]]
=== Replacing all properties of a node or relationship using the `=` operator

.Query
[source, cypher]
----
CREATE (a:Person {name: 'Sofia', age: 20})
WITH a
MATCH (p:Person {name: 'Sofia'})
SET p = {name: 'Ellen', livesIn: 'London'}
RETURN p.name, p.age, p.livesIn
----

All the existing properties on the node are replaced by those provided in the map; i.e. the `name` property is updated from `Sofia` to `Ellen`, the `age` property is deleted, and the `livesIn` property is added.

.Result
[role="queryresult",options="header,footer",cols="3*<m"]
|===
| +p.name+ | +p.age+ | +p.livesIn+
| +"Ellen"+ | +<null>+ | +"London"+

3+d|Rows: 1
|===

See xref::clauses/set.adoc#set-replace-properties-using-map[Replace all properties using a map and `=`] for more details on using the property replacement operator `=`.


[[syntax-property-mutation-operator]]
=== Mutating specific properties of a node or relationship using the `+=` operator

.Query
[source, cypher]
----
CREATE (a:Person {name: 'Sofia', age: 20})
WITH a
MATCH (p:Person {name: 'Sofia'})
SET p += {name: 'Ellen', livesIn: 'London'}
RETURN p.name, p.age, p.livesIn
----

The properties on the node are updated as follows by those provided in the map: the `name` property is updated from `Sofia` to `Ellen`, the `age` property is left untouched, and the `livesIn` property is added.

.Result
[role="queryresult",options="header,footer",cols="3*<m"]
|===
| +p.name+ | +p.age+ | +p.livesIn+
| +"Ellen"+ | +20+ | +"London"+

3+d|Rows: 1
|===

See xref::clauses/set.adoc#set-setting-properties-using-map[Mutate specific properties using a map and `+=`] for more details on using the property mutation operator `+=`.


[[query-operators-map]]
== Map operators

The map operators comprise:

* statically access the value of a map by key using the dot operator: `.`
* dynamically access the value of a map by key using the subscript operator: `[]`


[NOTE]
====
The behavior of the `[]` operator with respect to `null` is detailed in the xref::values-and-types/working-with-null.adoc#cypher-null-bracket-operator[working with null] page.
====


[[syntax-accessing-the-value-of-a-nested-map]]
=== Statically accessing the value of a nested map by key using the `.` operator

.Query
[source, cypher]
----
WITH {person: {name: 'Anne', age: 25}} AS p
RETURN  p.person.name
----

.Result
[role="queryresult",options="header,footer",cols="1*<m"]
|===
| +p.person.name+
| +"Anne"+

1+d|Rows: 1
|===


[[syntax-accessing-dynamic-map-parameter]]
=== Dynamically accessing the value of a map by key using the `[]` operator and a parameter

A parameter may be used to specify the key of the value to access:

.Parameters
[source, parameters]
----
{
  "myKey" : "name"
}
----

.Query
[source, cypher]
----
WITH {name: 'Anne', age: 25} AS a
RETURN a[$myKey] AS result
----

.Result
[role="queryresult",options="header,footer",cols="1*<m"]
|===
| +result+
| +"Anne"+

1+d|Rows: 1
|===

More information can be found in the xref::values-and-types/maps.adoc[Maps chapter].
