<!DOCTYPE html>
<html lang="en">
  <head>
    <meta charset="utf-8">
    <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=5, minimum-scale=1">
    <meta name="msvalidate.01" content="B5163518CBE4A854B63801277FE5E35C" />
    <meta name="google-site-verification" content="ucqagxjVuq0lJZeLKs0F5AppzK111lNt3IoxU6mzlJE" />
    <meta name="robots" content="index, follow" />
    <meta name="googlebot" content="index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1" />
    <meta name="bingbot" content="index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1" />

    <meta property="og:locale" content="en_US" />
    <meta property="og:type" content="article" />

<script>(function(w,d,s,l,i){w[l]=w[l]||[];w[l].push({'gtm.start':new Date().getTime(),event:'gtm.js'});var f=d.getElementsByTagName(s)[0],j=d.createElement(s),dl=l!='dataLayer'?'&l='+l:'';j.async=true;j.src='https://www.googletagmanager.com/gtm.js?id='+i+dl;f.parentNode.insertBefore(j,f);})(window,document,'script','dataLayer','GTM-WK23PSS');</script>
    <title>LET - Cypher Manual</title>
    <link rel="canonical" href="https://neo4j.com/docs/cypher-manual/25/clauses/let/">

    <link rel="prev" href="../foreach/">
    <link rel="next" href="../limit/">

      <meta name="description" content="Information about Cypher&#x27;s &#x60;LET&#x60; clause.">
<link rel="stylesheet" href="https://neo4j.com/wp-content/themes/neo4jweb/assets/neo4j-react-modules-assets/search-preact/chunkless/bundle.css" />
<link rel="stylesheet" href="https://neo4j.com/wp-content/themes/neo4jweb/assets/neo4j-react-modules-assets/search-preact/chunkless/utilities.min.css" />



    <link rel="preload" href="../../../../assets/fonts/fontawesome-webfont.woff2?v=4.7.0" as="font">
    <link rel="stylesheet" href="../../../../assets/css/site.css">
    <link rel="preconnect" href="https://fonts.googleapis.com">
    <link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
    <link href="https://fonts.googleapis.com/css2?family=Public+Sans:wght@300;400;500;600;700&display=swap" rel="stylesheet">

    <link rel="shortcut icon" href="https://neo4j.com/wp-content/themes/neo4jweb/favicon.ico" />


    <meta property="neo:type" content="Docs">
    <meta property="neo:site" content="Reference Docs">


    <meta property="og:site_name" content="Neo4j Graph Data Platform" />
    <meta property="article:publisher" content="https://www.facebook.com/neo4j.graph.database" />
    <meta name="twitter:card" content="summary_large_image" />
    <meta name="twitter:creator" content="@neo4j" />
    <meta name="twitter:site" content="@neo4j" />
    <meta property="og:type" content="article" />
    <meta property="og:title" content="LET - Cypher Manual" />
    <meta property="og:locale" content="en_US" />
    <meta property="og:image" content="https://dist.neo4j.com/wp-content/uploads/20240513110808/Neo4j-logo-social-preview.png" />
    <meta property="og:description" content="Information about Cypher's `LET` clause." />
    <meta property="og:url" content="https://neo4j.com/docs/cypher-manual/25/clauses/let/" />
    <link rel="shortcut icon" href="https://neo4j.com/wp-content/themes/neo4jweb/favicon.ico" />
  </head>
  <body class="article new-2025.06 docs">
<!-- Google Tag Manager (noscript) -->
<noscript><iframe src="https://www.googletagmanager.com/ns.html?id=GTM-WK23PSS"
height="0" width="0" style="display:none;visibility:hidden"></iframe></noscript>
<!-- End Google Tag Manager (noscript) -->
<script>(function(f,b){if(!b.__SV){var e,g,i,h;window.mixpanel=b;b._i=[];b.init=function(e,f,c){function g(a,d){var b=d.split(".");2==b.length&&(a=a[b[0]],d=b[1]);a[d]=function(){a.push([d].concat(Array.prototype.slice.call(arguments,0)))}}var a=b;"undefined"!==typeof c?a=b[c]=[]:c="mixpanel";a.people=a.people||[];a.toString=function(a){var d="mixpanel";"mixpanel"!==c&&(d+="."+c);a||(d+=" (stub)");return d};a.people.toString=function(){return a.toString(1)+".people (stub)"};i="disable time_event track track_pageview track_links track_forms track_with_groups add_group set_group remove_group register register_once alias unregister identify name_tag set_config reset opt_in_tracking opt_out_tracking has_opted_in_tracking has_opted_out_tracking clear_opt_in_out_tracking start_batch_senders people.set people.set_once people.unset people.increment people.append people.union people.track_charge people.clear_charges people.delete_user people.remove".split(" ");
for(h=0;h<i.length;h++)g(a,i[h]);var j="set set_once union unset remove delete".split(" ");a.get_group=function(){function b(c){d[c]=function(){call2_args=arguments;call2=[c].concat(Array.prototype.slice.call(call2_args,0));a.push([e,call2])}}for(var d={},e=["get_group"].concat(Array.prototype.slice.call(arguments,0)),c=0;c<j.length;c++)b(j[c]);return d};b._i.push([e,f,c])};b.__SV=1.2;e=f.createElement("script");e.type="text/javascript";e.async=!0;e.src="undefined"!==typeof MIXPANEL_CUSTOM_LIB_URL?
MIXPANEL_CUSTOM_LIB_URL:"file:"===f.location.protocol&&"//cdn.mxpnl.com/libs/mixpanel-2-latest.min.js".match(/^\/\//)?"https://cdn.mxpnl.com/libs/mixpanel-2-latest.min.js":"//cdn.mxpnl.com/libs/mixpanel-2-latest.min.js";g=f.getElementsByTagName("script")[0];g.parentNode.insertBefore(e,g)}})(document,window.mixpanel||[]);
mixpanel.init("4bfb2414ab973c741b6f067bf06d5575", {batch_requests: true})
mixpanel.track("Page View", {
    pathname: window.location.origin + window.location.pathname,
    search: window.location.search,
    hash: window.location.hash,
    referrer: document.referrer,
})
</script>
<header class="header">
  <nav class="navbar">
    <div class="navbar-brand">
      <a class="navbar-item" href="/">

        <img class="navbar-logo" src="https://dist.neo4j.com/wp-content/uploads/20230926084108/Logo_FullColor_RGB_TransBG.svg" alt="Neo4j Docs" />
      </a>
      <a href="/docs/" class="navbar-item no-left-padding" aria-label="Docs">
        Docs
      </a>

      </div>

      <button class="navbar-search search-button" data-target="topbar-nav" id="search_open_mobile" aria-label="Open Search">
        <svg width="23px" height="23px" viewBox="0 0 23 23" version="1.1" class="fill-current float-right" id="searchx" role="button" title="Search Website">
          <g stroke="none" stroke-width="1" fill="none" fill-rule="evenodd" stroke-linecap="round"
            stroke-linejoin="round">
            <g transform="translate(-2.000000, -2.000000)" stroke="#a0aec0" stroke-width="1.5">
              <circle
                transform="translate(11.389364, 11.388564) rotate(-23.025000) translate(-11.389364, -11.388564) "
                cx="11.3893642" cy="11.3885639" r="8.056"></circle>
              <path d="M17.0853333,17.0844444 L23.3333333,23.3333333" ></path>
            </g>
          </g>
        </svg>
      </button>
      <button class="navbar-burger" data-target="topbar-nav" aria-label="Mobile Navigation Button">
        <span></span>
        <span></span>
        <span></span>
      </button>
    </div>
    <div id="topbar-nav" class="navbar-menu">
            <div class="navbar-end">


        <div class="navbar-item has-dropdown is-hoverable docs">
          <a class="navbar-link" href="/docs/">Docs</a>
          <div class="navbar-dropdown">
            <div class="navbar-item project">
              <span class="project-name">Neo4j DBMS</span>
              <ul class="project-links">
                <li><a href="/docs/getting-started/current/" class="project-link">Getting Started</a></li>
                <li><a href="/docs/operations-manual/current/" class="project-link">Operations</a></li>
                <li><a href="/docs/migration-guide/current/" class="project-link">Migration and Upgrade</a></li>
                <li><a href="/docs/status-codes/current/" class="project-link">Status Codes</a></li>
                <li><a href="/docs/java-reference/current/" class="project-link">Java Reference</a></li>
                <li><a href="/docs/kerberos-add-on/current/" class="project-link">Kerberos Add-on</a></li>
              </ul>
            </div>

            <div class="navbar-item project">
              <a class="project-name" href="/docs/aura/">Neo4j Aura</a>
              <ul class="project-links">
                <li><a class="project-link" href="/docs/aura">Neo4j Aura</a></li>
                <li><a class="project-link" href="/docs/aura/auradb/">Neo4j AuraDB</a></li>
                <li><a class="project-link" href="/docs/aura/aurads/">Neo4j AuraDS</a></li>
              </ul>
            </div>

            <div class="navbar-item project">
              <span class="project-name">Neo4j Tools</span>
              <ul class="project-links">
                <li><a href="/docs/bloom-user-guide/current/" class="project-link">Neo4j Bloom</a></li>
                <li><a href="/docs/browser-manual/current/" class="project-link">Neo4j Browser</a></li>
                <li><a href="/docs/data-importer/current/" class="project-link">Neo4j Data Importer</a></li>
                <li><a href="/docs/desktop-manual/current/" class="project-link">Neo4j Desktop</a></li>
                <li><a href="/docs/ops-manager/current/" class="project-link">Neo4j Ops Manager</a></li>
                <li><a href="/docs/neodash-commercial/current/" class="project-link">Neodash commercial</a></li>
              </ul>
            </div>

            <div class="navbar-item project">
              <span class="project-name">Neo4j Graph Data Science</span>
              <ul class="project-links">
                <li><a href="/docs/graph-data-science/current/" class="project-link">Neo4j Graph Data Science Library</a></li>
                <li><a href="/docs/graph-data-science-client/current/" class="project-link">Neo4j Graph Data Science Client</a></li>
              </ul>
            </div>

            <div class="navbar-item project">
              <span class="project-name">Cypher Query Language</span>
              <ul class="project-links">
                <li><a href="/docs/cypher-manual/current/" class="project-link">Cypher</a></li>
                <li><a href="/docs/cypher-cheat-sheet/current/" class="project-link">Cypher Cheat Sheet</a></li>
                <li><a href="/docs/apoc/current/" class="project-link">APOC Library</a></li>
              </ul>
            </div>

           <div class="navbar-item project">
              <span class="project-name" href="/docs/genai">Generative AI</span>
              <ul class="project-links">
                <li><a href="/docs/neo4j-graphrag-python/current/" class="project-link">Neo4j GraphRAG for Python</a></li>
                <li><a href="/docs/genai/tutorials/embeddings-vector-indexes/" class="project-link">Embeddings and vector indexes tutorial</a></li>
                <li><a href="/docs/cypher-manual/current/genai-integrations/" class="project-link">GenAI integrations</a></li>
                <li><a href="/docs/cypher-manual/current/indexes/semantic-indexes/vector-indexes/" class="project-link">Vector search indexes</a></li>
                <li><a href="/docs/cypher-manual/current/functions/vector/" class="project-link">Vector search functions</a></li>
                <li><a href="/docs/graphql/5/directives/indexes-and-constraints/#_vector_index_search" class="project-link">GraphQL vector index search documentation</a></li>
              </ul>
            </div>
            
            <div class="navbar-item project">
              <span class="project-name" href="/docs/create-applications">Create applications</span>
              <ul class="project-links">
                <li><a href="/docs/python-manual/current/" class="project-link">Python Driver</a></li>
                <li><a href="/docs/go-manual/current/" class="project-link">Go Driver</a></li>
                <li><a href="/docs/java-manual/current/" class="project-link">Java Driver</a></li>
                <li><a href="/docs/jdbc-manual/current/" class="project-link">JDBC Driver</a></li>
                <li><a href="/docs/javascript-manual/current/" class="project-link">JavaScript Driver</a></li>
                <li><a href="/docs/dotnet-manual/current/" class="project-link">.Net Driver</a></li>
                <li><a href="/docs/graphql-manual/current/" class="project-link">Neo4j GraphQL Library</a></li>
                <li><a href="/docs/nvl/current/" class="project-link">Neo4j Visualization Library</a></li>
                <li><a href="/docs/ogm-manual/current/" class="project-link">OGM Library</a></li>
                <li><a href="https://docs.spring.io/spring-data/neo4j/docs/current/reference/html/#reference" class="project-link">Spring Data Neo4j</a></li>
                <li><a href="/docs/http-api/current/" class="project-link">HTTP API</a></li>
                <li><a href="/docs/query-api/current/" class="project-link">Neo4j Query API</a></li>
                <li><a href="/docs/bolt/current/" class="project-link">Bolt</a></li>
              </ul>
            </div>

            <div class="navbar-item project">
              <span class="project-name" href="/docs/connectors">Connect data sources</span>
              <ul class="project-links">
                <li><a href="/docs/spark/current/" class="project-link">Neo4j Connector for Apache Spark</a></li>
                <li><a href="/docs/kafka/" class="project-link">Neo4j Connector for Apache Kafka</a></li>
                <li><a href="/docs/cdc/" class="project-link">Change Data Capture (CDC)</a></li>
                <li><a href="/docs/dataflow-bigquery/" class="project-link">BigQuery to Neo4j</a></li>
                <li><a href="/docs/dataflow-google-cloud/" class="project-link">Google Cloud to Neo4j</a></li>
              </ul>
            </div>
          </div>
        </div>
        <div class="navbar-item has-dropdown is-hoverable labs">
          <a class="navbar-link" href="/labs/">Labs</a>
          <div class="navbar-dropdown">
            <div class="navbar-item project">
              <a class="project-name" href="/labs/genai-ecosystem/">GenAI Ecosystem</a>
              <ul class="project-links">
                <li><a href="/labs/genai-ecosystem/llm-graph-builder/" class="project-link">LLM Knowledge Graph Builder</a></li>
                <li><a href="/labs/genai-ecosystem/vector-search/" class="project-link">Vector Index &amp; Search</a></li>
                <li><a href="/labs/genai-ecosystem/langchain/" class="project-link">LangChain</a></li>
                <li><a href="/labs/genai-ecosystem/langchain-js/" class="project-link">LangChain.js</a></li>
                <li><a href="/labs/genai-ecosystem/llamaindex/" class="project-link">LlamaIndex</a></li>
                <li><a href="/labs/genai-ecosystem/haystack/" class="project-link">Haystack</a></li>
                <li><a href="/labs/genai-ecosystem/dspy/" class="project-link">DSPy</a></li>
              </ul>
            </div>

            <div class="navbar-item project">
              <strong class="project-name" href="/labs/apoc/">Developer Tools</strong>
              <ul class="project-links">
                <li><a href="/labs/apoc/" class="project-link">APOC Extended</a></li>
                <li><a class="project-link" href="/labs/aura-cli/">Aura CLI</a></li>
                <li><a class="project-link" href="/labs/arrows/">arrows.app</a></li>
                <li><a class="project-link" href="/labs/cypher-workbench/">Cypher Workbench</a></li>
                <li><a class="project-link" href="/labs/etl-tool/">ETL Tool</a></li>
                <li><a class="project-link" href="/labs/neodash/">NeoDash</a></li>
              </ul>
            </div>

            <div class="navbar-item project">
              <strong class="project-name">Frameworks &amp; Integrations</strong>
              <ul class="project-links">
                <li><a class="project-link" href="/labs/neo4j-needle-starterkit/">Needle Starter Kit</a></li>
                <li><a class="project-link" href="/labs/liquibase/">Neo4j Plugin for Liquibase</a></li>
                <li><a class="project-link" href="/labs/neo4j-migrations/">Neo4j Migrations</a></li>
                <li><a class="project-link" href="/labs/neomodel/">neomodel</a></li>
              </ul>
            </div>
            <div class="navbar-item project">
              <a class="project-name" href="/labs/neosemantics/">RDF &amp; Linked Data</a>
              <ul class="project-links">
                <li><a href="/labs/neosemantics/" class="project-link">Neosemantics (Java)</a></li>
                <li><a href="/labs/rdflib-neo4j/" class="project-link">RDFLib-Neo4j (Python)</a></li>
              </ul>
            </div>
            <div class="navbar-item project">
            </div>
          </div>
        </div>
        <div class="navbar-item has-dropdown is-hoverable developer">
          <a class="navbar-link" href="/developer/resources/">Get Help</a>
          <div class="navbar-dropdown">
            <div class="navbar-item project">
              <a class="project-name" href="https://dev.neo4j.com/forum" target="_blank">Community Forum</a>
            </div>
            <div class="navbar-item project">
              <a class="project-name" href="https://dev.neo4j.com/chat" target="_blank">Discord Chat</a>
            </div>
            <div class="navbar-item project">
              <a class="project-name" href="http://support.neo4j.com" target="_blank">Product Support</a>
            </div>
            <div class="navbar-item project">
              <a class="project-name" href="https://neo4j.com/blog/developer/" target="_blank">Neo4j Developer Blog</a>
            </div>
            <div class="navbar-item project">
              <a class="project-name" href="/videos/" target="_blank">Neo4j Videos</a>
            </div>
          </div>
        </div>
        <div class="navbar-item has-dropdown is-hoverable developer">
          <a class="navbar-link" href="https://graphacademy.neo4j.com/?ref=docs-nav">GraphAcademy</a>
          <div class="navbar-dropdown">
            <div class="navbar-item project">
              <a class="project-name" href="https://graphacademy.neo4j.com/categories/beginners/?ref=docs-nav" target="_blank">Beginners Courses</a>
              <ul class="project-links">
                <li><a class="project-link" href="https://graphacademy.neo4j.com/courses/neo4j-fundamentals/?ref=docs-nav">Neo4j Fundamentals</a></li>
                <li><a class="project-link" href="https://graphacademy.neo4j.com/courses/cypher-fundamentals/?ref=docs-nav">Cypher Fundamentals</a></li>
                <li><a class="project-link" href="https://graphacademy.neo4j.com/courses/importing-fundamentals/?ref=docs-nav">Importing Data Fundamentals</a></li>
                <li><a class="project-link" href="https://graphacademy.neo4j.com/courses/importing-csv-data/?ref=docs-nav">Importing CSV Data</a></li>
                <li><a class="project-link" href="https://graphacademy.neo4j.com/courses/modeling-fundamentals/?ref=docs-nav">Graph Data Modeling</a></li>
              </ul>
            </div>
            <div class="navbar-item project">
              <a class="project-name" href="https://graphacademy.neo4j.com/categories/data-scientist/?ref=docs-nav" target="_blank">Data Scientist Courses</a>
              <ul class="project-links">
                <li><a class="project-link" href="https://graphacademy.neo4j.com/courses/gds-product-introduction/?ref=docs-nav">Into to Graph Data Science</a></li>
                <li><a class="project-link" href="https://graphacademy.neo4j.com/courses/graph-data-science-fundamentals/?ref=docs-nav">Graph Data Science Fundamentals</a></li>
                <li><a class="project-link" href="https://graphacademy.neo4j.com/courses/gds-shortest-paths/?ref=docs-nav">Path Finding</a></li>
              </ul>
            </div>
            <div class="navbar-item project">
              <a class="project-name" href="https://graphacademy.neo4j.com/categories/llms/?ref=docs-nav" target="_blank">Generative AI Courses</a>
              <ul class="project-links">
                <li><a class="project-link" href="https://graphacademy.neo4j.com/courses/llm-fundamentals/?ref=docs-nav">Neo4j &amp; LLM Fundamentals</a></li>
                <li><a class="project-link" href="https://graphacademy.neo4j.com/courses/llm-vectors-unstructured/?ref=docs-nav">Vector Indexes &amp; Unstructured Data</a></li>
                <li><a class="project-link" href="https://graphacademy.neo4j.com/courses/llm-chatbot-python/?ref=docs-nav">Build a Chatbot with Python</a></li>
                <li><a class="project-link" href="https://graphacademy.neo4j.com/courses/llm-chatbot-typescript/?ref=docs-nav">Build a Chatbot with TypeScript</a></li>
              </ul>
            </div>
            <div class="navbar-item project">
              <a class="project-name" href="https://graphacademy.neo4j.com/certification/?ref=docs-nav" target="_blank">Neo4j Certification</a>
              <ul class="project-links">
                <li><a class="project-link" href="https://graphacademy.neo4j.com/certifications/neo4j-certification/?ref=docs-nav">Neo4j Certified Professional</a></li>
                <li><a class="project-link" href="https://graphacademy.neo4j.com/certifications/gds-certification/?ref=docs-nav">Neo4j Graph Data Science Certification</a></li>
              </ul>
            </div>
          </div>
        </div>
        <div class="navbar-item is-hoverable getting-started-cta">
          <a class="navbar-link primary" href="https://console.neo4j.io/?ref=docs-nav-get-started">Get Started Free</a>
        </div>
        <div class="navbar-item">
          <a class="navbar-link search-button" href="#search" id="search_open"><svg width="23px" height="23px" viewBox="0 0 23 23"
              version="1.1" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink"
              class="fill-current float-right" id="search" role="button" title="Search Website">
              <g stroke="none" stroke-width="1" fill="none" fill-rule="evenodd" stroke-linecap="round"
                stroke-linejoin="round">
                <g transform="translate(-2.000000, -2.000000)" stroke="#a0aec0" stroke-width="1.5">
                  <circle
                    transform="translate(11.389364, 11.388564) rotate(-23.025000) translate(-11.389364, -11.388564) "
                    cx="11.3893642" cy="11.3885639" r="8.056"></circle>
                  <path d="M17.0853333,17.0844444 L23.3333333,23.3333333" ></path>
                </g>
              </g>
            </svg><span class="navbar-mobile">Search</span></a>
        </div>
      </div>
    </div>
  </nav>

</header>
<div class="body">
    <a class="show-on-focus skip-link" href="#skip-to-content" title="Skip to content">Skip to content</a>
<div class="nav-container" data-component="cypher-manual" data-version="25">
  <aside class="nav">
    <div class="panels">
      <div class="component">
  <div class="nav-product">
    <span class="nav-product-name">Cypher Manual</span>
  </div>
</div>
      





      <div class="nav-panel-menu is-active has-feedback" data-panel="menu">
    <nav class="nav-menu">
    <ul class="nav-list">
    <li class="nav-item" data-module="ROOT" data-depth="0">
        <ul class="nav-list">
    <li class="nav-item" data-module="ROOT" data-depth="1">
      <a class="nav-link nav-item-toggle" href="../../introduction/">Introduction</a>
        <ul class="nav-list">
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../introduction/cypher-overview/">Overview</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../introduction/cypher-neo4j/">Cypher and Neo4j</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../introduction/cypher-aura/">Cypher and Aura</a>
            </li>
</ul>
    </li>
    <li class="nav-item" data-module="ROOT" data-depth="1">
      <a class="nav-link nav-item-toggle" href="../../queries/">Queries</a>
        <ul class="nav-list">
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../queries/concepts/">Core concepts</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../queries/basic/">Basic queries</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../queries/select-version/">Select Cypher version</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link nav-item-toggle" href="../../queries/composed-queries/">Composed queries</a>
        <ul class="nav-list">
    <li class="nav-item" data-module="ROOT" data-depth="3">
      <a class="nav-link" href="../../queries/composed-queries/combined-queries/">Combined queries (<code>UNION</code>)</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="3">
      <a class="nav-link" href="../../queries/composed-queries/conditional-queries/">Conditional queries (<code>WHEN</code>)</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="3">
      <a class="nav-link" href="../../queries/composed-queries/sequential-queries/">Sequential queries (<code>NEXT</code>)</a>
            </li>
</ul>
    </li>
</ul>
    </li>
    <li class="nav-item" data-module="ROOT" data-depth="1">
      <a class="nav-link nav-item-toggle" href="../">Clauses</a>
        <ul class="nav-list">
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../clause-composition/">Clause composition</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../call/">CALL procedure</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../create/">CREATE</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../delete/">DELETE</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../filter/">FILTER</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../finish/">FINISH</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../foreach/">FOREACH</a>
            </li>
    <li class="nav-item is-current-page" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="./">LET</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../limit/">LIMIT</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../load-csv/">LOAD CSV</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../match/">MATCH</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../merge/">MERGE</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../optional-match/">OPTIONAL MATCH</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../order-by/">ORDER BY</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../remove/">REMOVE</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../return/">RETURN</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../set/">SET</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../listing-functions/">SHOW FUNCTIONS</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../listing-procedures/">SHOW PROCEDURES</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../listing-settings/">SHOW SETTINGS</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../transaction-clauses/#query-listing-transactions">SHOW TRANSACTIONS</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../skip/">SKIP</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../transaction-clauses/#query-terminate-transactions">TERMINATE TRANSACTIONS</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../unwind/">UNWIND</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../use/">USE</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../where/">WHERE</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../with/">WITH</a>
            </li>
</ul>
    </li>
    <li class="nav-item" data-module="ROOT" data-depth="1">
      <a class="nav-link nav-item-toggle" href="../../subqueries/">Subqueries</a>
        <ul class="nav-list">
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../subqueries/call-subquery/">CALL subqueries</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../subqueries/subqueries-in-transactions/">CALL subqueries in transactions</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../subqueries/collect/">COLLECT subqueries</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../subqueries/count/">COUNT subqueries</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../subqueries/existential/">EXISTS subqueries</a>
            </li>
</ul>
    </li>
    <li class="nav-item" data-module="ROOT" data-depth="1">
      <a class="nav-link nav-item-toggle" href="../../patterns/">Patterns</a>
        <ul class="nav-list">
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../patterns/primer/">Primer</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../patterns/fixed-length-patterns/">Fixed-length patterns</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../patterns/variable-length-patterns/">Variable-length patterns</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../patterns/shortest-paths/">Shortest paths</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../patterns/non-linear-patterns/">Non-linear patterns</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../patterns/match-modes/">Match modes</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../patterns/reference/">Syntax and semantics</a>
            </li>
</ul>
    </li>
    <li class="nav-item" data-module="ROOT" data-depth="1">
      <a class="nav-link nav-item-toggle" href="../../values-and-types/">Values and types</a>
        <ul class="nav-list">
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../values-and-types/property-structural-constructed/">Property, structural, and constructed values</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../values-and-types/boolean-numeric-string/">Boolean, numeric, and string literals</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../values-and-types/temporal/">Temporal values</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../values-and-types/spatial/">Spatial values</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../values-and-types/lists/">Lists</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../values-and-types/maps/">Maps</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../values-and-types/graph-references/">Graph references</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../values-and-types/working-with-null/">Working with <code>null</code></a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../values-and-types/casting-data/">Casting data values</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../values-and-types/ordering-equality-comparison/">Equality, ordering, and comparison of value types</a>
            </li>
</ul>
    </li>
    <li class="nav-item" data-module="ROOT" data-depth="1">
      <a class="nav-link nav-item-toggle" href="../../expressions/">Expressions</a>
        <ul class="nav-list">
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link nav-item-toggle" href="../../expressions/predicates/">Predicates</a>
        <ul class="nav-list">
    <li class="nav-item" data-module="ROOT" data-depth="3">
      <a class="nav-link" href="../../expressions/predicates/boolean-operators/">Boolean operators</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="3">
      <a class="nav-link" href="../../expressions/predicates/comparison-operators/">Comparison operators</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="3">
      <a class="nav-link" href="../../expressions/predicates/list-operators/">List operators</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="3">
      <a class="nav-link" href="../../expressions/predicates/string-operators/">String operators</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="3">
      <a class="nav-link" href="../../expressions/predicates/path-pattern-expressions/">Path pattern expressions</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="3">
      <a class="nav-link" href="../../expressions/predicates/type-predicate-expressions/">Type predicate expressions</a>
            </li>
</ul>
    </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../expressions/node-relationship-operators/">Node and relationship operators</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../expressions/mathematical-operators/">Mathematical operators</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../expressions/string-operators/">String concatenation operators</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../expressions/temporal-operators/">Temporal operators</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../expressions/list-expressions/">List expressions</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../expressions/map-expressions/">Map expressions</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../expressions/conditional-expressions/">Conditional expressions (CASE)</a>
            </li>
</ul>
    </li>
    <li class="nav-item" data-module="ROOT" data-depth="1">
      <a class="nav-link nav-item-toggle" href="../../functions/">Functions</a>
        <ul class="nav-list">
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../functions/aggregating/">Aggregating functions</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../functions/database/">Database functions</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../functions/graph/">Graph functions</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../functions/list/">List functions</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../functions/load-csv/">LOAD CSV functions</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../functions/mathematical-logarithmic/">Mathematical functions - logarithmic</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../functions/mathematical-numeric/">Mathematical functions - numeric</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../functions/mathematical-trigonometric/">Mathematical functions - trigonometric</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../functions/predicate/">Predicate functions</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../functions/scalar/">Scalar functions</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../functions/spatial/">Spatial functions</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../functions/string/">String functions</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../functions/temporal/duration/">Temporal functions - duration</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../functions/temporal/">Temporal functions - instant types</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../functions/user-defined/">User-defined functions</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../functions/vector/">Vector functions</a>
            </li>
</ul>
    </li>
    <li class="nav-item" data-module="ROOT" data-depth="1">
      <a class="nav-link" href="../../genai-integrations/">GenAI integrations</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="1">
      <a class="nav-link nav-item-toggle" href="../../indexes/">Indexes</a>
        <ul class="nav-list">
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link nav-item-toggle" href="../../indexes/search-performance-indexes/">Search-performance indexes</a>
        <ul class="nav-list">
    <li class="nav-item" data-module="ROOT" data-depth="3">
      <a class="nav-link" href="../../indexes/search-performance-indexes/managing-indexes/">Create, show, and delete indexes</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="3">
      <a class="nav-link" href="../../indexes/search-performance-indexes/using-indexes/">The impact of indexes on query performance</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="3">
      <a class="nav-link" href="../../indexes/search-performance-indexes/index-hints/">Index hints for the Cypher planner</a>
            </li>
</ul>
    </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link nav-item-toggle" href="../../indexes/semantic-indexes/">Semantic indexes</a>
        <ul class="nav-list">
    <li class="nav-item" data-module="ROOT" data-depth="3">
      <a class="nav-link" href="../../indexes/semantic-indexes/full-text-indexes/">Full-text indexes</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="3">
      <a class="nav-link" href="../../indexes/semantic-indexes/vector-indexes/">Vector indexes</a>
            </li>
</ul>
    </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../indexes/syntax/">Syntax</a>
            </li>
</ul>
    </li>
    <li class="nav-item" data-module="ROOT" data-depth="1">
      <a class="nav-link nav-item-toggle" href="../../constraints/">Constraints</a>
        <ul class="nav-list">
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../constraints/managing-constraints/">Create, show, and drop constraints</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../constraints/syntax/">Syntax</a>
            </li>
</ul>
    </li>
    <li class="nav-item" data-module="ROOT" data-depth="1">
      <a class="nav-link nav-item-toggle" href="../../planning-and-tuning/">Execution plans and query tuning</a>
        <ul class="nav-list">
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../planning-and-tuning/execution-plans/">Understanding execution plans</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link nav-item-toggle" href="../../planning-and-tuning/operators/">Operators</a>
        <ul class="nav-list">
    <li class="nav-item" data-module="ROOT" data-depth="3">
      <a class="nav-link" href="../../planning-and-tuning/operators/operators-detail/">Operators in detail</a>
            </li>
</ul>
    </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link nav-item-toggle" href="../../planning-and-tuning/runtimes/">Cypher runtimes</a>
        <ul class="nav-list">
    <li class="nav-item" data-module="ROOT" data-depth="3">
      <a class="nav-link" href="../../planning-and-tuning/runtimes/concepts/">Concepts</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="3">
      <a class="nav-link" href="../../planning-and-tuning/runtimes/reference/">Parallel runtime: reference</a>
            </li>
</ul>
    </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../planning-and-tuning/query-tuning/">Query tuning</a>
            </li>
</ul>
    </li>
    <li class="nav-item" data-module="ROOT" data-depth="1">
      <a class="nav-link nav-item-toggle" href="../../query-caches/">Query caches</a>
        <ul class="nav-list">
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../query-caches/unified-query-caches/">Unifying query caches</a>
            </li>
</ul>
    </li>
    <li class="nav-item" data-module="ROOT" data-depth="1">
      <a class="nav-link" href="../../administration/">Administration</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="1">
      <a class="nav-link nav-item-toggle" href="../../syntax/">Syntax</a>
        <ul class="nav-list">
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../syntax/parsing/">Parsing</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../syntax/naming/">Naming rules and recommendations</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../syntax/variables/">Variables</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../syntax/keywords/">Keywords</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../syntax/parameters/">Parameters</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../syntax/comments/">Comments</a>
            </li>
</ul>
    </li>
    <li class="nav-item" data-module="ROOT" data-depth="1">
      <a class="nav-link" href="../../deprecations-additions-removals-compatibility/">Additions, deprecations, removals, and compatibility</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="1">
      <span class="nav-text nav-item-toggle">Appendix</span>
        <ul class="nav-list">
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link" href="../../styleguide/">Cypher styleguide</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link nav-item-toggle" href="../../appendix/gql-conformance/">GQL conformance</a>
        <ul class="nav-list">
    <li class="nav-item" data-module="ROOT" data-depth="3">
      <a class="nav-link" href="../../appendix/gql-conformance/supported-mandatory/">Supported mandatory GQL features</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="3">
      <a class="nav-link" href="../../appendix/gql-conformance/unsupported-mandatory/">Currently unsupported mandatory GQL features</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="3">
      <a class="nav-link" href="../../appendix/gql-conformance/supported-optional/">Supported optional GQL features</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="3">
      <a class="nav-link" href="../../appendix/gql-conformance/analogous-cypher/">Optional GQL features and analogous Cypher</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="3">
      <a class="nav-link" href="../../appendix/gql-conformance/additional-cypher/">Additional Cypher features</a>
            </li>
</ul>
    </li>
    <li class="nav-item" data-module="ROOT" data-depth="2">
      <a class="nav-link nav-item-toggle" href="../../appendix/tutorials/">Tutorials and extended examples</a>
        <ul class="nav-list">
    <li class="nav-item" data-module="ROOT" data-depth="3">
      <a class="nav-link" href="../../appendix/tutorials/basic-query-tuning/">Basic query tuning example</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="3">
      <a class="nav-link" href="../../appendix/tutorials/advanced-query-tuning/">Advanced query tuning example</a>
            </li>
    <li class="nav-item" data-module="ROOT" data-depth="3">
      <a class="nav-link" href="../../appendix/tutorials/shortestpath-planning/">Shortest path planning</a>
            </li>
</ul>
    </li>
</ul>
    </li>
</ul>
    </li>
</ul>

  </nav>
</div>
        <div class="feedback" style="height: var(--feedback-height);">
    <div class="header question">
        <p><strong>Is this page helpful?</strong></p>

        <svg width="22px" height="22px" viewBox="0 0 22 22" role="button" class="no" aria-label="No, this page isn't helpful">
            <path
                d="M6.25,15.8333333 C6.25,13.7622655 7.92893219,12.0833333 10,12.0833333 C12.0710678,12.0833333 13.75,13.7622655 13.75,15.8333333"
                ></path>
            <circle  cx="10" cy="10" r="9.58333333"></circle>
            <path
                d="M12.5,4.58333333 C12.8934466,4.05873783 13.5109223,3.75 14.1666667,3.75 C14.822411,3.75 15.4398867,4.05873783 15.8333333,4.58333333"
                ></path>
            <line x1="4.58333333" y1="7.91666667" x2="7.08333333" y2="7.91666667" ></line>
            <path
                d="M7.08333333,8.54166667 C6.96827401,8.54166667 6.875,8.44839266 6.875,8.33333333 C6.875,8.21827401 6.96827401,8.125 7.08333333,8.125 C7.19839266,8.125 7.29166667,8.21827401 7.29166667,8.33333333 C7.29166667,8.44839266 7.19839266,8.54166667 7.08333333,8.54166667"
                ></path>
            <line x1="12.9166667" y1="7.91666667" x2="15.4166667" y2="7.91666667" ></line>
            <path
                d="M15.4166667,8.54166667 C15.3016073,8.54166667 15.2083333,8.44839266 15.2083333,8.33333333 C15.2083333,8.21827401 15.3016073,8.125 15.4166667,8.125 C15.531726,8.125 15.625,8.21827401 15.625,8.33333333 C15.625,8.44839266 15.531726,8.54166667 15.4166667,8.54166667"
                ></path>
            <path
                d="M4.16666667,4.58333333 C4.5601133,4.05873783 5.17758895,3.75 5.83333333,3.75 C6.48907772,3.75 7.10655337,4.05873783 7.5,4.58333333"
                ></path>
        </svg>

        <svg width="22px" height="22px" viewBox="0 0 22 22" role="button" class="yes" aria-label="Yes, this page is helpful">
            <circle  cx="10" cy="10" r="9.58333333"></circle>
            <path
                d="M5.41666667,8.125 C5.53172599,8.125 5.625,8.21827401 5.625,8.33333333 C5.625,8.44839266 5.53172599,8.54166667 5.41666667,8.54166667 C5.30160734,8.54166667 5.20833333,8.44839266 5.20833333,8.33333333 C5.20833333,8.21827401 5.30160734,8.125 5.41666667,8.125"
                ></path>
            <path
                d="M14.5833333,8.125 C14.468274,8.125 14.375,8.21827401 14.375,8.33333333 C14.375,8.44839266 14.468274,8.54166667 14.5833333,8.54166667 C14.6983927,8.54166667 14.7916667,8.44839266 14.7916667,8.33333333 C14.7916667,8.21827401 14.6983927,8.125 14.5833333,8.125"
                ></path>
            <path
                d="M13.2275,12.9166657 C13.4853075,12.9162808 13.7287776,13.035241 13.8869095,13.2388563 C14.0450415,13.4424715 14.1000278,13.7078123 14.0358333,13.9575 C13.562901,15.7999679 11.9021969,17.0882321 10,17.0882321 C8.09780311,17.0882321 6.43709903,15.7999679 5.96416667,13.9575 C5.89997223,13.7078123 5.95495852,13.4424715 6.11309045,13.2388563 C6.27122239,13.035241 6.51469246,12.9162808 6.7725,12.9166657 L13.2275,12.9166657 Z"
                ></path>
        </svg>
    </div>


</div>
    </div>
  </aside>
</div>
<main class="article">
<div class="toolbar" role="navigation">
  <div class="toolbar-wrapper">
    <button class="nav-toggle" aria-label="Toggle Table of Contents"></button>
    
    

    
    <a href="https://neo4j.com/docs" class="home-link" aria-label="Go to docs home page"></a>
    


    <nav class="breadcrumbs" aria-label="breadcrumbs menu">
  <ul>

    <li><a href="../../introduction/">Cypher Manual</a></li>

    <li><a href="../">
        Clauses
    </a></li>
    <li><a href="./">
        LET
    </a></li>
  </ul>
</nav>
      </div>
</div>

  
  <div class="content">
    <div id="skip-to-content"></div>
<article class="doc">
<div class="sect-header">
  <h1 class="page label--new-2025.06">LET</h1>
</div>





<div id="preamble">
<div class="sectionbody">
<div class="paragraph">
<p><code>LET</code> binds expressions to variables.
For queries involving several chained expressions, it can be a more succinct and readable alternative to <a href="../with/" class="xref page"><code>WITH</code></a>.
Unlike <code>WITH</code>, <code>LET</code> does not drop variables from the scope of subsequent clauses.
Nor can it be used for aggregations or in combination with <code>DISTINCT</code>; it can only be used to bind new variables.</p>
</div>
</div>
</div>
<div class="sect1">
<h2 id="example-graph"><a class="anchor" href="#example-graph"></a>Example graph</h2>
<div class="sectionbody">
<div class="paragraph">
<p>A graph with the following schema is used for the examples below:</p>
</div>
<div class="imageblock popup">
<div class="content">
<img src="../../_images/let-graph.svg" alt="Example graph connecting suppliers" width="600" height="and customers">
</div>
</div>
<div class="paragraph">
<p>To recreate the graph, run the following query against an empty Neo4j database.</p>
</div>
<div class="listingblock test-setup">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">CREATE (techCorp:Supplier {name: 'TechCorp', email: 'contact@techcorp.com'}),
       (foodies:Supplier {name: 'Foodies Inc.', email: 'info@foodies.com'}),

       (laptop:Product {name: 'Laptop', price: 1000}),
       (phone:Product {name: 'Phone', price: 500}),
       (headphones:Product {name: 'Headphones', price: 250}),
       (chocolate:Product {name: 'Chocolate', price: 5}),
       (coffee:Product {name: 'Coffee', price: 10}),

       (amir:Customer {firstName: 'Amir', lastName: 'Rahman', email: 'amir.rahman@example.com', discount: 0.1}),
       (keisha:Customer {firstName: 'Keisha', lastName: 'Nguyen', email: 'keisha.nguyen@example.com', discount: 0.2}),
       (mateo:Customer {firstName: 'Mateo', lastName: 'Ortega', email: 'mateo.ortega@example.com', discount: 0.05}),
       (hannah:Customer {firstName: 'Hannah', lastName: 'Connor', email: 'hannah.connor@example.com', discount: 0.15}),
       (leila:Customer {firstName: 'Leila', lastName: 'Haddad', email: 'leila.haddad@example.com', discount: 0.1}),
       (niko:Customer {firstName: 'Niko', lastName: 'Petrov', email: 'niko.petrov@example.com', discount: 0.25}),
       (yusuf:Customer {firstName: 'Yusuf', lastName: 'Abdi', email: 'yusuf.abdi@example.com', discount: 0.1}),

       (amir)-[:BUYS {date: date('2024-10-09')}]-&gt;(laptop),
       (amir)-[:BUYS {date: date('2025-01-10')}]-&gt;(chocolate),
       (keisha)-[:BUYS {date: date('2023-07-09')}]-&gt;(headphones),
       (mateo)-[:BUYS {date: date('2025-03-05')}]-&gt;(chocolate),
       (mateo)-[:BUYS {date: date('2025-03-05')}]-&gt;(coffee),
       (mateo)-[:BUYS {date: date('2024-04-11')}]-&gt;(laptop),
       (hannah)-[:BUYS {date: date('2023-12-11')}]-&gt;(coffee),
       (hannah)-[:BUYS {date: date('2024-06-02')}]-&gt;(headphones),
       (leila)-[:BUYS {date: date('2023-05-17')}]-&gt;(laptop),
       (niko)-[:BUYS {date: date('2025-02-27')}]-&gt;(phone),
       (niko)-[:BUYS {date: date('2024-08-23')}]-&gt;(headphones),
       (niko)-[:BUYS {date: date('2024-12-24')}]-&gt;(coffee),
       (yusuf)-[:BUYS {date: date('2024-12-24')}]-&gt;(chocolate),
       (yusuf)-[:BUYS {date: date('2025-01-02')}]-&gt;(laptop),

       (techCorp)-[:SUPPLIES]-&gt;(laptop),
       (techCorp)-[:SUPPLIES]-&gt;(phone),
       (techCorp)-[:SUPPLIES]-&gt;(headphones),
       (foodies)-[:SUPPLIES]-&gt;(chocolate),
       (foodies)-[:SUPPLIES]-&gt;(coffee)</code></pre>
</div>
</div>
</div>
</div>
<div class="sect1">
<h2 id="assigning-expressions-to-variables"><a class="anchor" href="#assigning-expressions-to-variables"></a>Bind values to variables</h2>
<div class="sectionbody">
<div class="paragraph">
<p><code>LET</code> is used to bind variables to the results of expressions.</p>
</div>
<div class="listingblock">
<div class="title">Syntax</div>
<div class="content">
<pre class="highlightjs highlight"><code class="language-syntax hljs" data-lang="syntax">LET variable = expression, variable = expression</code></pre>
</div>
</div>
<div class="listingblock">
<div class="title">Using <code>LET</code> to bind a variable</div>
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (c:Customer)
LET fullName = c.firstName + ' ' + c.lastName
RETURN fullName</code></pre>
</div>
</div>
<table class="tableblock frame-all grid-all stretch queryresult">
<caption class="title">Result</caption>
<colgroup>
<col style="width: 100%;">
</colgroup>
<thead>
<tr>
<th class="tableblock halign-left valign-top">fullName</th>
</tr>
</thead>
<tbody>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Amir Rahman"</code></p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Keisha Nguyen"</code></p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Mateo Ortega"</code></p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Hannah Connor"</code></p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Leila Haddad"</code></p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Niko Petrov"</code></p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Yusuf Abdi"</code></p></td>
</tr>
</tbody>
<tfoot>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock">Rows: 7</p></td>
</tr>
</tfoot>
</table>
<div class="listingblock">
<div class="title">Using <code>LET</code> to bind several variables</div>
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (s:Supplier)-[:SUPPLIES]-&gt;(p:Product)
LET supplier = s.name, product = p.name
RETURN supplier, product</code></pre>
</div>
</div>
<table class="tableblock frame-all grid-all stretch queryresult">
<caption class="title">Result</caption>
<colgroup>
<col style="width: 50%;">
<col style="width: 50%;">
</colgroup>
<thead>
<tr>
<th class="tableblock halign-left valign-top">supplier</th>
<th class="tableblock halign-left valign-top">product</th>
</tr>
</thead>
<tbody>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"TechCorp"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Laptop"</code></p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"TechCorp"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Phone"</code></p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"TechCorp"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Headphones"</code></p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Foodies Inc."</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Chocolate"</code></p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Foodies Inc."</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Coffee"</code></p></td>
</tr>
</tbody>
<tfoot>
<tr>
<td class="tableblock halign-left valign-top" colspan="2"><p class="tableblock">Rows: 4</p></td>
</tr>
</tfoot>
</table>
</div>
</div>
<div class="sect1">
<h2 id="let-and-with-differences"><a class="anchor" href="#let-and-with-differences"></a>Differences between <code>LET</code> and <code>WITH</code></h2>
<div class="sectionbody">
<div class="paragraph">
<p>There are important differences between <code>LET</code> and <code>WITH</code> that can be divided into the following categories:</p>
</div>
<div class="ulist">
<ul>
<li>
<p><a href="#variable-scope">Variables in scope</a></p>
</li>
<li>
<p><a href="#chaining-expressions">Chaining expressions</a></p>
</li>
<li>
<p><a href="#aggregations-distinct">Aggregations and <code>DISTINCT</code></a></p>
</li>
</ul>
</div>
<div class="sect2">
<h3 id="variable-scope"><a class="anchor" href="#variable-scope"></a>Variables in scope</h3>
<div class="paragraph">
<p><code>LET</code> does not drop variables from the scope of subsequent clauses, while <code>WITH</code> does.
As such, <code>LET &lt;variable&gt; = &lt;expression&gt;</code> is a substitute for <code>WITH *, &lt;expression&gt; AS &lt;variable&gt;</code>, not <code>WITH &lt;expression&gt; AS &lt;variable&gt;</code> (which would drop any variables present in the preceding clause not referenced in <code>&lt;expression&gt;</code>).</p>
</div>
<div class="exampleblock">
<div class="title">Example 1. Variables in scope: comparing <code>LET</code> and <code>WITH</code></div>
<div class="content">
<div class="paragraph">
<p>Any variable not explicitly referenced by <code>WITH</code> (or carried over by <code>WITH *</code>) is dropped from the scope of subsequent clauses.</p>
</div>
<div class="listingblock test-fail">
<div class="title">Not allowed&#8201;&#8212;&#8201;Referencing a variable dropped by <code>WITH</code></div>
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (s:Supplier)-[:SUPPLIES]-&gt;(p:Product)
WITH s.name AS supplier
RETURN supplier, p.name AS product</code></pre>
</div>
</div>
<div class="listingblock">
<div class="title">Error message</div>
<div class="content">
<pre class="highlightjs highlight"><code class="language-error hljs" data-lang="error">Variable `p` not defined</code></pre>
</div>
</div>
<div class="paragraph">
<p><code>LET</code>, however, cannot regulate which variables are in scope.
Replacing <code>WITH</code> with <code>LET</code> in the above query would, therefore, return results.</p>
</div>
<div class="listingblock">
<div class="title"><code>LET</code> does not drop variables</div>
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (s:Supplier)-[:SUPPLIES]-&gt;(p:Product)
LET supplier =  s.name
RETURN supplier, p.name AS product</code></pre>
</div>
</div>
<table class="tableblock frame-all grid-all stretch queryresult">
<caption class="title">Result</caption>
<colgroup>
<col style="width: 50%;">
<col style="width: 50%;">
</colgroup>
<thead>
<tr>
<th class="tableblock halign-left valign-top">supplier</th>
<th class="tableblock halign-left valign-top">product</th>
</tr>
</thead>
<tbody>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"TechCorp"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Laptop"</code></p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"TechCorp"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Phone"</code></p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"TechCorp"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Headphones"</code></p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Foodies Inc."</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Chocolate"</code></p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Foodies Inc."</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Coffee"</code></p></td>
</tr>
</tbody>
<tfoot>
<tr>
<td class="tableblock halign-left valign-top" colspan="2"><p class="tableblock">Rows: 5</p></td>
</tr>
</tfoot>
</table>
</div>
</div>
</div>
<div class="sect2">
<h3 id="chaining-expressions"><a class="anchor" href="#chaining-expressions"></a>Chaining expressions</h3>
<div class="paragraph">
<p>The fact that <code>LET</code> does not drop variables means that it can be used to chain expressions in a clear and concise manner, where variables bound in one <code>LET</code> clause can be referenced by subsequent clauses.</p>
</div>
<div class="exampleblock">
<div class="title">Example 2. Chaining expressions: comparing <code>LET</code> and <code>WITH</code></div>
<div class="content">
<div class="paragraph">
<p>The below query shows that variables bound by a <code>LET</code> clause can be referenced by subsequent clauses without being explicitly carried over.
Specifically, the variable <code>isExpensive</code> is created in the first <code>LET</code> clause and referenced again in the subsequent clauses.
Note also that the variable <code>p</code>, bound in the <code>MATCH</code> clause, is available in the final <code>RETURN</code> clause despite not being referenced in any of <code>LET</code> clauses.</p>
</div>
<div class="listingblock">
<div class="title"><code>LET</code> referencing variables assigned in previous a <code>LET</code></div>
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (p:Product)
LET isExpensive = p.price &gt;= 500
LET isAffordable = NOT isExpensive
LET discountCategory = CASE
    WHEN isExpensive THEN 'High-end'
    ELSE 'Budget'
END
RETURN p.name AS product, p.price AS price, isAffordable, discountCategory
ORDER BY price</code></pre>
</div>
</div>
<table class="tableblock frame-all grid-all stretch queryresult">
<caption class="title">Result</caption>
<colgroup>
<col style="width: 25%;">
<col style="width: 25%;">
<col style="width: 25%;">
<col style="width: 25%;">
</colgroup>
<thead>
<tr>
<th class="tableblock halign-left valign-top">product</th>
<th class="tableblock halign-left valign-top">price</th>
<th class="tableblock halign-left valign-top">isAffordable</th>
<th class="tableblock halign-left valign-top">discountCategory</th>
</tr>
</thead>
<tbody>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Chocolate"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>5</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>TRUE</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>'Budget'</code></p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Coffee"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>10</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>TRUE</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>'Budget'</code></p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Headphones"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>250</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>TRUE</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>'Budget'</code></p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Phone"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>500</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>FALSE</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>'High-end'</code></p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Laptop"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>1000</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>FALSE</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>'High-end'</code></p></td>
</tr>
</tbody>
<tfoot>
<tr>
<td class="tableblock halign-left valign-top" colspan="4"><p class="tableblock">Rows: 5</p></td>
</tr>
</tfoot>
</table>
<div class="paragraph">
<p>Using <code>WITH</code>, the same query would become less succinct, as <code>WITH</code> would have to explicitly carry over each variable in between clauses:</p>
</div>
<div class="listingblock">
<div class="title">Less succinct <code>WITH</code> equivalent</div>
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (p:Product)
WITH p, p.price &gt;= 500 AS isExpensive
WITH p, isExpensive, NOT isExpensive AS isAffordable
WITH p, isExpensive, isAffordable,
     CASE
         WHEN isExpensive THEN 'High-end'
         ELSE 'Budget'
     END AS discountCategory
RETURN p.name AS product, p.price AS price, isAffordable, discountCategory
ORDER BY price</code></pre>
</div>
</div>
</div>
</div>
</div>
<div class="sect2">
<h3 id="aggregations-distinct"><a class="anchor" href="#aggregations-distinct"></a>Aggregations and <code>DISTINCT</code></h3>
<div class="paragraph">
<p>Unlike <code>WITH</code>, <code>LET</code> cannot perform aggregations or be combined with <code>DISTINCT</code>.
For example, in the following query, <code>WITH</code> could not be replaced by <code>LET</code>:</p>
</div>
<div class="listingblock">
<div class="title">Combining <code>WITH DISTINCT</code> and aggregations on expressions</div>
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (c:Customer)-[:BUYS]-&gt;(p:Product)
WITH DISTINCT c, sum(p.price) AS totalSpent
RETURN c.firstName AS customer, totalSpent</code></pre>
</div>
</div>
<table class="tableblock frame-all grid-all stretch queryresult">
<caption class="title">Result</caption>
<colgroup>
<col style="width: 50%;">
<col style="width: 50%;">
</colgroup>
<thead>
<tr>
<th class="tableblock halign-left valign-top">customer</th>
<th class="tableblock halign-left valign-top">totalSpent</th>
</tr>
</thead>
<tbody>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Amir"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>1005</code></p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Keisha"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>250</code></p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Mateo"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>1015</code></p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Hannah"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>260</code></p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Leila"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>1000</code></p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Niko"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>760</code></p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Yusuf"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>1005</code></p></td>
</tr>
</tbody>
<tfoot>
<tr>
<td class="tableblock halign-left valign-top" colspan="2"><p class="tableblock">Rows: 7</p></td>
</tr>
</tfoot>
</table>
<div class="listingblock">
<div class="title">Combining <code>WITH</code> and <code>LET</code></div>
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (c:Customer)-[:BUYS]-&gt;(p:Product)
WITH DISTINCT c, sum(p.price) AS totalSpent
LET fullName = c.firstName + ' ' + c.lastName
RETURN fullName, totalSpent</code></pre>
</div>
</div>
<table class="tableblock frame-all grid-all stretch queryresult">
<caption class="title">Result</caption>
<colgroup>
<col style="width: 50%;">
<col style="width: 50%;">
</colgroup>
<thead>
<tr>
<th class="tableblock halign-left valign-top">customer</th>
<th class="tableblock halign-left valign-top">totalSpent</th>
</tr>
</thead>
<tbody>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Amir Rahman"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>1005</code></p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Keisha Nguyen"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>250</code></p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Mateo Ortega"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>1015</code></p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Hannah Connor"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>260</code></p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Leila Haddad"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>1000</code></p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Niko Petrov"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>760</code></p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Yusuf Abdi"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>1005</code></p></td>
</tr>
</tbody>
<tfoot>
<tr>
<td class="tableblock halign-left valign-top" colspan="2"><p class="tableblock">Rows: 7</p></td>
</tr>
</tfoot>
</table>
</div>
</div>
</div>
<div class="sect1">
<h2 id="advanced-examples"><a class="anchor" href="#advanced-examples"></a>Advanced examples</h2>
<div class="sectionbody">
<div class="paragraph">
<p>The following examples demonstrates how <code>LET</code>, and its ability to chain expressions, can be used in more advanced queries:</p>
</div>
<div class="exampleblock">
<div class="title">Example 3. Scenario 1: Supplier notification on customer purchases and discounts</div>
<div class="content">
<div class="paragraph">
<p>This example retrieves information about what <code>Product</code> a <code>Customer</code> has bought, and from what <code>Supplier</code>.
It then calculates the <code>price</code> after applying the <code>discount</code> and constructs a <code>message</code> for each purchase, including the <code>fullName</code> of each <code>Customer</code> and the <code>effectivePrice</code> of a <code>Product</code> after a discount, sent to the <code>Supplier</code> <code>email</code>.</p>
</div>
<div class="paragraph">
<p>This example highlights that <code>LET</code> does not drop variables.
All variables introduced in the <code>MATCH</code> and subsequent <code>LET</code> clauses are available in the final <code>RETURN</code> clause.</p>
</div>
<div class="listingblock">
<div class="title">Retrieve <code>Customer</code> purchase details, including discount information</div>
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (c:Customer)-[b:BUYS]-&gt;(p:Product)&lt;--(s:Supplier)
LET fullname = c.firstName + ' ' + c.lastName,
    effectivePrice = p.price * (1 - c.discount)
LET message = fullname + " bought " + p.name + " for $" + effectivePrice + " after a " + (c.discount * 100) + "% discount"
RETURN b.date AS date, message, s.email AS toSupplier
ORDER BY date</code></pre>
</div>
</div>
<table class="tableblock frame-all grid-all stretch queryresult">
<caption class="title">Result</caption>
<colgroup>
<col style="width: 25%;">
<col style="width: 50%;">
<col style="width: 25%;">
</colgroup>
<thead>
<tr>
<th class="tableblock halign-left valign-top">date</th>
<th class="tableblock halign-left valign-top">message</th>
<th class="tableblock halign-left valign-top">toSupplier</th>
</tr>
</thead>
<tbody>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>2023-05-17</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Leila Haddad bought Laptop for $900.0 after a 10.0% discount"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"<a href="mailto:contact@techcorp.com">contact@techcorp.com</a>"</code></p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>2023-07-09</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Keisha Nguyen bought Headphones for $200.0 after a 20.0% discount"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"<a href="mailto:contact@techcorp.com">contact@techcorp.com</a>"</code></p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>2023-12-11</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Hannah Connor bought Coffee for $8.5 after a 15.0% discount"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"<a href="mailto:info@foodies.com">info@foodies.com</a>"</code></p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>2024-04-11</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Mateo Ortega bought Laptop for $950.0 after a 5.0% discount"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"<a href="mailto:contact@techcorp.com">contact@techcorp.com</a>"</code></p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>2024-06-02</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Hannah Connor bought Headphones for $212.5 after a 15.0% discount"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"<a href="mailto:contact@techcorp.com">contact@techcorp.com</a>"</code></p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>2024-08-23</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Niko Petrov bought Headphones for $187.5 after a 25.0% discount"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"<a href="mailto:contact@techcorp.com">contact@techcorp.com</a>"</code></p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>2024-10-09</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Amir Rahman bought Laptop for $900.0 after a 10.0% discount"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"<a href="mailto:contact@techcorp.com">contact@techcorp.com</a>"</code></p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>2024-12-24</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Yusuf Abdi bought Chocolate for $4.5 after a 10.0% discount"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"<a href="mailto:info@foodies.com">info@foodies.com</a>"</code></p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>2024-12-24</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Niko Petrov bought Coffee for $7.5 after a 25.0% discount"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"<a href="mailto:info@foodies.com">info@foodies.com</a>"</code></p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>2025-01-02</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Yusuf Abdi bought Laptop for $900.0 after a 10.0% discount"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"<a href="mailto:contact@techcorp.com">contact@techcorp.com</a>"</code></p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>2025-01-10</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Amir Rahman bought Chocolate for $4.5 after a 10.0% discount"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"<a href="mailto:info@foodies.com">info@foodies.com</a>"</code></p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>2025-02-27</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Niko Petrov bought Phone for $375.0 after a 25.0% discount"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"<a href="mailto:contact@techcorp.com">contact@techcorp.com</a>"</code></p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>2025-03-05</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Mateo Ortega bought Chocolate for $4.75 after a 5.0% discount"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"<a href="mailto:info@foodies.com">info@foodies.com</a>"</code></p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>2025-03-05</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Mateo Ortega bought Coffee for $9.5 after a 5.0% discount"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"<a href="mailto:info@foodies.com">info@foodies.com</a>"</code></p></td>
</tr>
</tbody>
<tfoot>
<tr>
<td class="tableblock halign-left valign-top" colspan="3"><p class="tableblock">Rows: 14</p></td>
</tr>
</tfoot>
</table>
</div>
</div>
<div class="exampleblock">
<div class="title">Example 4. Scenario 2: Supplier gift card distribution based on customer spending</div>
<div class="content">
<div class="paragraph">
<p>The example calculates the <code>customerRevenue</code> for each <code>Customer</code> after applying their <code>discount</code> on each <code>Product</code> they bought. Customers are then categorized into three groups based on their total spending: Category <code>A</code> for those who spent more than <code>850</code>, Category <code>B</code> for those who spent more than <code>350</code> but less than or equal to <code>850</code>, and Category <code>C</code> for those who spent <code>350</code> or less.
Category <code>C</code> customers are excluded from the results using the <a href="../filter/" class="xref page"><code>FILTER</code></a> clause, leaving only Category <code>A</code> and <code>B</code> customers eligible for a gift card.
The <code>amount</code> in the gift card is assigned based on the category, with with Category <code>A</code> receiving <code>20</code> and Category <code>B</code> receiving <code>10</code>.
The details of the gift card are then sent to the <code>email</code> of the relevant customers.</p>
</div>
<div class="paragraph">
<p>This example highlights how <code>LET</code> can be used to succinctly chain expressions, and also that it cannot be used to perform aggregations.</p>
</div>
<div class="listingblock">
<div class="title">Calculate customer gift card distribution based on spending</div>
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (customer:Customer)-[bought:BUYS]-&gt;(product:Product)
LET effectivePrice = product.price * (1 - customer.discount)
WITH customer, bought, sum(effectivePrice) AS customerRevenue
LET category = CASE
    WHEN customerRevenue &gt; 850 THEN 'A'
    WHEN customerRevenue &gt; 350 THEN 'B'
    ELSE 'C'
  END
FILTER category &lt;&gt; 'C'
LET amount = CASE
    WHEN category = 'A' THEN 20
    WHEN category = 'B' THEN 10
END
LET message = {
    type: 'giftcard',
    addressee: customer.firstName + ' ' + customer.lastName,
    amount: amount,
    year: bought.date.year
}
RETURN message, customer.email AS toCustomer, customerRevenue
ORDER BY amount</code></pre>
</div>
</div>
<table class="tableblock frame-all grid-all stretch queryresult">
<caption class="title">Result</caption>
<colgroup>
<col style="width: 50%;">
<col style="width: 33.3333%;">
<col style="width: 16.6667%;">
</colgroup>
<thead>
<tr>
<th class="tableblock halign-left valign-top">message</th>
<th class="tableblock halign-left valign-top">toCustomer</th>
<th class="tableblock halign-left valign-top">customerRevenue</th>
</tr>
</thead>
<tbody>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>{amount: 10, addressee: "Niko Petrov", type: "giftcard", year: 2025}</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"<a href="mailto:niko.petrov@example.com">niko.petrov@example.com</a>"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>375.0</code></p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>{amount: 20, addressee: "Amir Rahman", type: "giftcard", year: 2024}</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"<a href="mailto:amir.rahman@example.com">amir.rahman@example.com</a>"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>900.0</code></p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>{amount: 20, addressee: "Mateo Ortega", type: "giftcard", year: 2024}</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"<a href="mailto:mateo.ortega@example.com">mateo.ortega@example.com</a>"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>950.0</code></p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>{amount: 20, addressee: "Leila Haddad", type: "giftcard", year: 2023}</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"<a href="mailto:leila.haddad@example.com">leila.haddad@example.com</a>"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>900.0</code></p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>{amount: 20, addressee: "Yusuf Abdi", type: "giftcard", year: 2025}</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"<a href="mailto:yusuf.abdi@example.com">yusuf.abdi@example.com</a>"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>900.0</code></p></td>
</tr>
</tbody>
<tfoot>
<tr>
<td class="tableblock halign-left valign-top" colspan="3"><p class="tableblock">Rows: 5</p></td>
</tr>
</tfoot>
</table>
</div>
</div>
</div>
</div>
<nav class="pagination" aria-label="pagination links">
  <span class="prev"><a href="../foreach/" aria-label="Previous: FOREACH">FOREACH</a></span>

  <span class="next"><a href="../limit/" aria-label="Next: LIMIT">LIMIT</a></span>
</nav>
</article>
    <aside class="toc sidebar" data-title="Contents"
  data-levels="2">
  <div class="toc-menu">
    <div class="toc-menu-placeholder"></div>

      </div>
  </aside>  </div>
  
</main>
</div>
<footer class="footer">
  <div class="wrapper">

  <div class="column logo">
    <div class="logo-footer"></div>
  </div>
  
  <div class="column links">
    <h2>Learn</h2>
    <ul>
      <li><i class="fa fa-wrench" aria-hidden="true"></i> <a rel="noopener" href="https://neo4j.com/sandbox/?ref=developer-footer">Sandbox</a></li>
      <li><i class="fa fa-comments-o" aria-hidden="true"></i> <a rel="noopener" href="https://community.neo4j.com?ref=developer-footer" target="_blank">Neo4j Community Site</a></li>
      <li><i class="fa fa-book" aria-hidden="true"></i> <a rel="noopener" href="https://medium.com/neo4j" target="_blank">Neo4j Developer Blog</a></li>
      <li><i class="fa fa-youtube" aria-hidden="true"></i> <a rel="noopener" href="https://www.youtube.com/neo4j" target="_blank">Neo4j Videos</a></li>
      <li><i class="fa fa-graduation-cap" aria-hidden="true"></i> <a rel="noopener" href="https://neo4j.com/graphacademy/?ref=developer-footer">GraphAcademy</a></li>
      <li><i class="fa fa-flask" aria-hidden="true"></i> <a href="https://neo4j.com/labs/?ref=developer-footer">Neo4j Labs</a></li>
    </ul>
  </div>
  <div class="column links">
    <h2>Social</h2>
    <ul>
      <li><i class="fa fa-twitter" aria-hidden="true"></i> <a rel="noopener" href="https://twitter.com/neo4j" target="_blank">Twitter</a></li>
      <li><i class="fa fa-meetup" aria-hidden="true"></i> <a rel="noopener" href="https://www.meetup.com/Neo4j-Online-Meetup/" target="_blank">Meetups</a></li>
      <li><i class="fa fa-github" aria-hidden="true"></i> <a rel="noopener" href="https://github.com/neo4j/neo4j" target="_blank">Github</a></li>
      <li><i class="fa fa-stack-overflow" aria-hidden="true"></i> <a rel="noopener" href="https://stackoverflow.com/questions/tagged/neo4j" target="_blank">Stack Overflow</a></li>

      <li class="speaker-program"><a href="https://docs.google.com/forms/d/e/1FAIpQLSdEcNnMruES5iwvOVYovmS1D_P1ZL_HdUOitFrwrvruv5PZvA/viewform">Want to Speak?</a></li>
    </ul>
  </div>
  <div class="column links">
    <h2><a href="https://neo4j.com/contact-us/?ref=footer">Contact Us </a></h2>
    <ul>
      <li>US: 1-855-636-4532</li>
      <li>Sweden +46 171 480 113</li>
      <li>UK: +44 20 3868 3223</li>
      <li>France: +33 (0) 1 88 46 13 20</li>
    </ul>
  </div>

    <div class="column">
    <p> <span id="footer-copyright-year">2025</span> Neo4j, Inc.<br>
      <a href="https://neo4j.com/terms/">Terms</a> | <a href="https://neo4j.com/privacy-policy/">Privacy </a> | <a href="https://neo4j.com/sitemap/">Sitemap</a></p>
    <p>Neo4j<sup></sup>, Neo Technology<sup></sup>, Cypher<sup></sup>, Neo4j<sup></sup> Bloom<sup></sup> and
      Neo4j<sup></sup> Aura<sup></sup> are registered trademarks
      of Neo4j, Inc. All other marks are owned by their respective companies.</p>
  </div>

  
</div>
</footer>

  <script src="../../../../assets/js/vendor/auth0.js"></script>
  <script src="../../../../assets/js/site.js"></script>
  <script async src="../../../../assets/js/vendor/highlight.js"></script>
  <script async src="../../../../assets/js/vendor/image-zoom.js"></script>



<div id="neo4j-algolia-search-v2"></div>
<script src="https://neo4j.com/wp-content/themes/neo4jweb/assets/neo4j-react-modules-assets/search-preact/chunkless/bundle.js"></script>
<script src="https://neo4j.com/wp-content/themes/neo4jweb/assets/neo4j-react-modules-assets/search-preact/chunkless/polyfill.js"></script>
<script>window.algoliaSearchOptions = {indexName: "docs",placeholder: "Search Documentation",template: "docs"}</script>
  </body>
</html>
