<!DOCTYPE html>
<html lang="en">
  <head>
    <meta charset="utf-8">
    <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=5, minimum-scale=1">
    <meta name="msvalidate.01" content="B5163518CBE4A854B63801277FE5E35C" />
    <meta name="google-site-verification" content="ucqagxjVuq0lJZeLKs0F5AppzK111lNt3IoxU6mzlJE" />
    <meta name="robots" content="index, follow" />
    <meta name="googlebot" content="index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1" />
    <meta name="bingbot" content="index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1" />

    <meta property="og:locale" content="en_US" />
    <meta property="og:type" content="article" />

<script>(function(w,d,s,l,i){w[l]=w[l]||[];w[l].push({'gtm.start':new Date().getTime(),event:'gtm.js'});var f=d.getElementsByTagName(s)[0],j=d.createElement(s),dl=l!='dataLayer'?'&l='+l:'';j.async=true;j.src='https://www.googletagmanager.com/gtm.js?id='+i+dl;f.parentNode.insertBefore(j,f);})(window,document,'script','dataLayer','GTM-WK23PSS');</script>
<!-- Hotjar Tracking Code for staging -->
<script>
    (function(h,o,t,j,a,r){
        h.hj=h.hj||function(){(h.hj.q=h.hj.q||[]).push(arguments)};
        h._hjSettings={hjid:3587741,hjsv:6};
        a=o.getElementsByTagName('head')[0];
        r=o.createElement('script');r.async=1;
        r.src=t+h._hjSettings.hjid+j+h._hjSettings.hjsv;
        a.appendChild(r);
    })(window,document,'https://static.hotjar.com/c/hotjar-','.js?sv=');
</script>
<!-- End Hotjar Tracking code -->
    <title>Limitations - Cypher Manual</title>
    <link rel="prev" href="../load-privileges/">
    <link rel="next" href="../privileges-immutable/">
      <meta name="description" content="Known limitations and implications of Neo4js role-based access control security.">
<link rel="stylesheet" href="https://neo4j.com/wp-content/themes/neo4jweb/assets/neo4j-react-modules-assets/search-preact/chunkless/bundle.css" />
<link rel="stylesheet" href="https://neo4j.com/wp-content/themes/neo4jweb/assets/neo4j-react-modules-assets/search-preact/chunkless/utilities.min.css" />

    <link rel="preload" href="../../../../../assets/fonts/fontawesome-webfont.woff2?v=4.7.0" as="font">
    <link rel="stylesheet" href="../../../../../assets/css/site.css">
    <link href="https://fonts.googleapis.com/css2?family=Nunito+Sans:wght@300;400;600;700&display=swap" rel="stylesheet">

    <link rel="shortcut icon" href="https://neo4j.com/wp-content/themes/neo4jweb/favicon.ico" />



    <meta property="neo:type" content="Docs">
    <meta property="neo:site" content="Reference Docs">


    <meta property="og:site_name" content="Neo4j Graph Data Platform" />
    <meta property="article:publisher" content="https://www.facebook.com/neo4j.graph.database" />
    <meta name="twitter:card" content="summary_large_image" />
    <meta name="twitter:creator" content="@neo4j" />
    <meta name="twitter:site" content="@neo4j" />
    <meta property="og:type" content="article" />
    <meta property="og:title" content="Limitations - Cypher Manual" />
    <meta property="og:locale" content="en_US" />
    <meta property="og:image" content="https://dist.neo4j.com/wp-content/uploads/20210423062553/neo4j-social-share-21.png" />
    <meta property="og:description" content="Known limitations and implications of Neo4js role-based access control security." />
    <meta property="og:url" content="https://neo4j.com/docs/cypher-manual/5/administration/access-control/limitations/" />
    <link rel="shortcut icon" href="https://neo4j.com/wp-content/themes/neo4jweb/favicon.ico" />
  </head>
  <body class="article enterprise-edition aura-db-enterprise docs">
<!-- Google Tag Manager (noscript) -->
<noscript><iframe src="https://www.googletagmanager.com/ns.html?id=GTM-WK23PSS"
height="0" width="0" style="display:none;visibility:hidden"></iframe></noscript>
<!-- End Google Tag Manager (noscript) -->
<script>(function(f,b){if(!b.__SV){var e,g,i,h;window.mixpanel=b;b._i=[];b.init=function(e,f,c){function g(a,d){var b=d.split(".");2==b.length&&(a=a[b[0]],d=b[1]);a[d]=function(){a.push([d].concat(Array.prototype.slice.call(arguments,0)))}}var a=b;"undefined"!==typeof c?a=b[c]=[]:c="mixpanel";a.people=a.people||[];a.toString=function(a){var d="mixpanel";"mixpanel"!==c&&(d+="."+c);a||(d+=" (stub)");return d};a.people.toString=function(){return a.toString(1)+".people (stub)"};i="disable time_event track track_pageview track_links track_forms track_with_groups add_group set_group remove_group register register_once alias unregister identify name_tag set_config reset opt_in_tracking opt_out_tracking has_opted_in_tracking has_opted_out_tracking clear_opt_in_out_tracking start_batch_senders people.set people.set_once people.unset people.increment people.append people.union people.track_charge people.clear_charges people.delete_user people.remove".split(" ");
for(h=0;h<i.length;h++)g(a,i[h]);var j="set set_once union unset remove delete".split(" ");a.get_group=function(){function b(c){d[c]=function(){call2_args=arguments;call2=[c].concat(Array.prototype.slice.call(call2_args,0));a.push([e,call2])}}for(var d={},e=["get_group"].concat(Array.prototype.slice.call(arguments,0)),c=0;c<j.length;c++)b(j[c]);return d};b._i.push([e,f,c])};b.__SV=1.2;e=f.createElement("script");e.type="text/javascript";e.async=!0;e.src="undefined"!==typeof MIXPANEL_CUSTOM_LIB_URL?
MIXPANEL_CUSTOM_LIB_URL:"file:"===f.location.protocol&&"//cdn.mxpnl.com/libs/mixpanel-2-latest.min.js".match(/^\/\//)?"https://cdn.mxpnl.com/libs/mixpanel-2-latest.min.js":"//cdn.mxpnl.com/libs/mixpanel-2-latest.min.js";g=f.getElementsByTagName("script")[0];g.parentNode.insertBefore(e,g)}})(document,window.mixpanel||[]);
mixpanel.init("4bfb2414ab973c741b6f067bf06d5575", {batch_requests: true})
mixpanel.track("Page View", {
    pathname: window.location.origin + window.location.pathname,
    search: window.location.search,
    hash: window.location.hash,
    referrer: document.referrer,
})
</script>
<header class="header">
  <nav class="navbar">
    <div class="navbar-brand">
      <a class="navbar-item" href="/">

      <img class="navbar-logo" src="https://dist.neo4j.com/wp-content/uploads/20210422142941/neo4j-logo-2020.svg" alt="Neo4j Docs" />
      <a href="/docs/" class="navbar-item no-left-padding" aria-label="Docs">
        Docs
      </a>

      </div>

      <button class="navbar-search search-button" data-target="topbar-nav" id="search_open_mobile" aria-label="Open Search">
        <svg width="23px" height="23px" viewBox="0 0 23 23" version="1.1" class="fill-current float-right" id="searchx" role="button" title="Search Website">
          <g stroke="none" stroke-width="1" fill="none" fill-rule="evenodd" stroke-linecap="round"
            stroke-linejoin="round">
            <g transform="translate(-2.000000, -2.000000)" stroke="#a0aec0" stroke-width="1.5">
              <circle
                transform="translate(11.389364, 11.388564) rotate(-23.025000) translate(-11.389364, -11.388564) "
                cx="11.3893642" cy="11.3885639" r="8.056"></circle>
              <path d="M17.0853333,17.0844444 L23.3333333,23.3333333" ></path>
            </g>
          </g>
        </svg>
      </button>
      <button class="navbar-burger" data-target="topbar-nav" aria-label="Mobile Navigation Button">
        <span></span>
        <span></span>
        <span></span>
      </button>
    </div>
    <div id="topbar-nav" class="navbar-menu">
            <div class="navbar-end">


        <div class="navbar-item has-dropdown is-hoverable docs">
          <a class="navbar-link" href="/docs/">Docs</a>
          <div class="navbar-dropdown">
            <div class="navbar-item project">
              <span class="project-name">Neo4j DBMS</span>
              <ul class="project-links">
                <li><a href="/docs/getting-started/current/" class="project-link">Getting Started</a></li>
                <li><a href="/docs/operations-manual/current/" class="project-link">Operations</a></li>
                <li><a href="/docs/migration-guide/current/" class="project-link">Migration and Upgrade</a></li>
                <li><a href="/docs/status-codes/current/" class="project-link">Status Codes</a></li>
                <li><a href="/docs/java-reference/current/" class="project-link">Java Reference</a></li>
                <li><a href="/docs/kerberos-add-on/current/" class="project-link">Kerberos Add-on</a></li>
              </ul>
            </div>

            <div class="navbar-item project">
              <a class="project-name" href="/docs/aura/">Neo4j Aura</a>
              <ul class="project-links">
                <li><a class="project-link" href="/docs/aura">Neo4j Aura</a></li>
                <li><a class="project-link" href="/docs/aura/auradb/">Neo4j AuraDB</a></li>
                <li><a class="project-link" href="/docs/aura/aurads/">Neo4j AuraDS</a></li>
              </ul>
            </div>

            <div class="navbar-item project">
              <span class="project-name">Neo4j Tools</span>
              <ul class="project-links">
                <li><a href="/docs/bloom-user-guide/current/" class="project-link">Neo4j Bloom</a></li>
                <li><a href="/docs/browser-manual/current/" class="project-link">Neo4j Browser</a></li>
                <li><a href="/docs/data-importer/current/" class="project-link">Neo4j Data Importer</a></li>
                <li><a href="/docs/desktop-manual/current/" class="project-link">Neo4j Desktop</a></li>
                <li><a href="/docs/ops-manager/current/" class="project-link">Neo4j Ops Manager</a></li>
              </ul>
            </div>

            <div class="navbar-item project">
              <span class="project-name">Neo4j Graph Data Science</span>
              <ul class="project-links">
                <li><a href="/docs/graph-data-science/current/" class="project-link">Neo4j Graph Data Science Library</a></li>
              </ul>
            </div>

            <div class="navbar-item project">
              <span class="project-name">Cypher Query Language</span>
              <ul class="project-links">
                <li><a href="/docs/cypher-manual/current/" class="project-link">Cypher</a></li>
                <li><a href="/docs/cypher-cheat-sheet/current/" class="project-link">Cypher Cheat Sheet</a></li>
                <li><a href="/docs/apoc/current/" class="project-link">APOC Library</a></li>
              </ul>
            </div>

            <div class="navbar-item project">
              <span class="project-name" href="/docs/drivers-apis">Create applications</span>
              <ul class="project-links">
                <li><a href="/docs/python-manual/current/" class="project-link">Python Driver</a></li>
                <li><a href="/docs/go-manual/current/" class="project-link">Go Driver</a></li>
                <li><a href="/docs/java-manual/current/" class="project-link">Java Driver</a></li>
                <li><a href="/docs/javascript-manual/current/" class="project-link">JavaScript Driver</a></li>
                <li><a href="/docs/dotnet-manual/current/" class="project-link">.Net Driver</a></li>
                <li><a href="/docs/graphql-manual/current/" class="project-link">Neo4j GraphQL Library</a></li>
                <li><a href="/docs/http-api/current/" class="project-link">HTTP API</a></li>
                <li><a href="/docs/ogm-manual/current/" class="project-link">OGM Library</a></li>
                <li><a href="https://docs.spring.io/spring-data/neo4j/docs/current/reference/html/#reference" class="project-link">Spring Data Neo4j</a></li>
                <li><a href="/docs/spark/" class="project-link">Neo4j Connector for Apache Spark</a></li>
                <li><a href="/docs/kafka/" class="project-link">Neo4j Connector for Apache Kafka</a></li>
              </ul>
            </div>

          </div>
        </div>
        <div class="navbar-item has-dropdown is-hoverable labs">
          <a class="navbar-link" href="/labs/">Labs</a>
          <div class="navbar-dropdown">
            <div class="navbar-item project">
              <a class="project-name" href="/labs/arrows/">arrows.app</a>
              <ul class="project-links">
                <li><a href="/labs/arrows/" class="project-link">Details</a></li>
                <li><a href="https://arrows.app" class="project-link">arrows.app</a></li>
              </ul>
            </div>
            <div class="navbar-item project">
              <a class="project-name" href="/labs/apoc/">APOC Extended</a>

              <ul class="project-links">
                <li><a href="/labs/apoc/5/" class="project-link">Documentation</a></li>
                <li><a href="/developer/neo4j-apoc/" class="project-link">Developer Guide</a></li>
              </ul>
            </div>
            <div class="navbar-item project">
              <a class="project-name" href="/labs/halin/">Halin</a>
            </div>
            <div class="navbar-item project">
              <a class="project-name" href="/labs/etl-tool/">ETL Tool</a>
              <ul class="project-links">
                <li><a href="/labs/etl-tool/" class="project-link">Details</a></li>
                <li><a href="/labs/etl-tool/1.5.0/" class="project-link">Documentation</a></li>
              </ul>
            </div>
            <div class="navbar-item project">
              <a class="project-name" href="/labs/neo4j-migrations/">Neo4j Migrations</a>
              <ul class="project-links">
                <li><a href="/labs/neo4j-migrations/" class="project-link">Details</a></li>
                <li><a href="/labs/neo4j-migrations/2.0/" class="project-link">Documentation</a></li>
              </ul>
            </div>
            <div class="navbar-item project">
              <a class="project-name" href="/labs/liquibase/">Neo4j Plugin For Liquibase</a>
              <ul class="project-links">
                <li><a href="/labs/liquibase/" class="project-link">Details</a></li>
                <li><a href="https://github.com/liquibase/liquibase-neo4j" class="project-link">Documentation</a></li>
              </ul>
            </div>
            <div class="navbar-item project">
              <a class="project-name" href="/labs/neosemantics/">Neosemantics</a>
              <ul class="project-links">
                <li><a href="/labs/neosemantics/tutorial/" class="project-link">Getting Started</a></li>
                <li><a href="/labs/neosemantics/4.0/" class="project-link">Documentation</a></li>
              </ul>
            </div>
            <div class="navbar-item project">
              <a class="project-name" href="/labs/neo4j-helm/">Neo4j Helm</a>
              <ul class="project-links">
                <li><a href="/labs/neo4j-helm/" class="project-link">Details</a></li>
                <li><a href="/labs/neo4j-helm/1.0.0/" class="project-link">Documentation</a></li>
              </ul>
            </div>
            <div class="navbar-item project">
              <a class="project-name" href="/labs/neodash/">NeoDash</a>
              <ul class="project-links">
                <li><a href="/labs/neodash/" class="project-link">Details</a></li>
                <li><a href="/labs/neodash/2.1/" class="project-link">Documentation</a></li>
              </ul>
            </div>
            <div class="navbar-item project">
              <a class="project-name" href="/labs/neomodel/">neomodel</a>
              <ul class="project-links">
                <li><a href="/labs/neomodel/" class="project-link">Details</a></li>
                <li><a href="https://neomodel.readthedocs.io/en/latest/" target="_blank" class="project-link">Documentation</a></li>
              </ul>
            </div>
          </div>
        </div>
        <div class="navbar-item has-dropdown is-hoverable developer">
          <a class="navbar-link" href="/developer/resources/">Get Help</a>
          <div class="navbar-dropdown">
            <div class="navbar-item project">
              <a class="project-name" href="https://graphacademy.neo4j.com/?ref=docs" target="_blank">GraphAcademy</a>
              <ul class="project-links">
                <li><a class="project-link" href="https://graphacademy.neo4j.com/?ref=docs">Free, Self Paced Training</a></li>
                <li><a class="project-link" href="https://graphacademy.neo4j.com/certification/?ref=docs" target="_blank">Certification</a></li>
              </ul>
            </div>

            <div class="navbar-item project">
              <a class="project-name" href="https://dev.neo4j.com/forum" target="_blank">Community Forum</a>
            </div>
            <div class="navbar-item project">
              <a class="project-name" href="https://dev.neo4j.com/chat" target="_blank">Discord Chat</a>
            </div>
            <div class="navbar-item project">
              <a class="project-name" href="/developer/kb" target="_blank">Knowledge Base</a>
            </div>
            <div class="navbar-item project">
              <a class="project-name" href="https://medium.com/neo4j" target="_blank">Neo4j Developer Blog</a>
            </div>
            <div class="navbar-item project">
              <a class="project-name" href="https://www.youtube.com/neo4j" target="_blank">Neo4j Videos</a>
            </div>
          </div>
        </div>
        <div class="navbar-item is-hoverable getting-started-cta">
          <a class="navbar-link primary" href="https://neo4j.com/cloud/platform/aura-graph-database/?ref=docs-nav-get-started">Get Started Free</a>
        </div>
        <div class="navbar-item">
          <a class="navbar-link search-button" href="#search" id="search_open"><svg width="23px" height="23px" viewBox="0 0 23 23"
              version="1.1" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink"
              class="fill-current float-right" id="search" role="button" title="Search Website">
              <g stroke="none" stroke-width="1" fill="none" fill-rule="evenodd" stroke-linecap="round"
                stroke-linejoin="round">
                <g transform="translate(-2.000000, -2.000000)" stroke="#a0aec0" stroke-width="1.5">
                  <circle
                    transform="translate(11.389364, 11.388564) rotate(-23.025000) translate(-11.389364, -11.388564) "
                    cx="11.3893642" cy="11.3885639" r="8.056"></circle>
                  <path d="M17.0853333,17.0844444 L23.3333333,23.3333333" ></path>
                </g>
              </g>
            </svg><span class="navbar-mobile">Search</span></a>
        </div>
      </div>
    </div>
  </nav>
</header>
<div class="body">
<div class="nav-container" data-component="cypher-manual" data-version="5">
  <aside class="nav">
    <div class="panels">
      <div class="selectors">
        
      </div>
      <div class="nav-panel-menu is-active" data-panel="menu">
    <nav class="nav-menu">
    <ul class="nav-list">
  <li class="nav-item" data-depth="0">
<ul class="nav-list">
  <li class="nav-item" data-depth="1">
    <a class="nav-link nav-item-toggle" href="../../../introduction/">Introduction</a>
<ul class="nav-list">
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../../introduction/cypher_overview/">Overview</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../../introduction/cypher_neo4j/">Cypher and Neo4j</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../../introduction/cypher_aura/">Cypher and Aura</a>
  </li>
</ul>
  </li>
  <li class="nav-item" data-depth="1">
    <a class="nav-link nav-item-toggle" href="../../../queries/">Queries</a>
<ul class="nav-list">
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../../queries/concepts/">Core concepts</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../../queries/basic/">Basic queries</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../../queries/expressions/">Cypher expressions</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../../queries/case/">Conditional expressions (CASE)</a>
  </li>
</ul>
  </li>
  <li class="nav-item" data-depth="1">
    <a class="nav-link nav-item-toggle" href="../../../clauses/">Clauses</a>
<ul class="nav-list">
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../../clauses/clause_composition/">Clause composition</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../../clauses/match/">MATCH</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../../clauses/optional-match/">OPTIONAL MATCH</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../../clauses/return/">RETURN</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../../clauses/with/">WITH</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../../clauses/unwind/">UNWIND</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../../clauses/where/">WHERE</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../../clauses/order-by/">ORDER BY</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../../clauses/skip/">SKIP</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../../clauses/limit/">LIMIT</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../../clauses/create/">CREATE</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../../clauses/delete/">DELETE</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../../clauses/set/">SET</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../../clauses/remove/">REMOVE</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../../clauses/foreach/">FOREACH</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../../clauses/merge/">MERGE</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../../clauses/call/">CALL procedure</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../../clauses/union/">UNION</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../../clauses/use/">USE</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../../clauses/load-csv/">LOAD CSV</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../../clauses/listing-functions/">SHOW FUNCTIONS</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../../clauses/listing-procedures/">SHOW PROCEDURES</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../../clauses/listing-settings/">SHOW SETTINGS</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../../clauses/transaction-clauses/#query-listing-transactions">SHOW TRANSACTIONS</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../../clauses/transaction-clauses/#query-terminate-transactions">TERMINATE TRANSACTIONS</a>
  </li>
</ul>
  </li>
  <li class="nav-item" data-depth="1">
    <a class="nav-link nav-item-toggle" href="../../../subqueries/">Subqueries</a>
<ul class="nav-list">
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../../subqueries/call-subquery/">CALL subqueries</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../../subqueries/subqueries-in-transactions/">CALL subqueries in transactions</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../../subqueries/existential/">EXISTS subqueries</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../../subqueries/count/">COUNT subqueries</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../../subqueries/collect/">COLLECT subqueries</a>
  </li>
</ul>
  </li>
  <li class="nav-item" data-depth="1">
    <a class="nav-link nav-item-toggle" href="../../../patterns/">Patterns</a>
<ul class="nav-list">
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../../patterns/concepts/">Concepts</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../../patterns/primer/">Primer</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../../patterns/reference/">Syntax and semantics</a>
  </li>
</ul>
  </li>
  <li class="nav-item" data-depth="1">
    <a class="nav-link nav-item-toggle" href="../../../values-and-types/">Values and types</a>
<ul class="nav-list">
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../../values-and-types/property-structural-constructed/">Property, structural, and constructed values</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../../values-and-types/temporal/">Temporal values</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../../values-and-types/spatial/">Spatial values</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../../values-and-types/working-with-null/">Working with <code>null</code></a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../../values-and-types/lists/">Lists</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../../values-and-types/maps/">Maps</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../../values-and-types/casting-data/">Casting data values</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../../values-and-types/type-predicate/">Type predicate expressions</a>
  </li>
</ul>
  </li>
  <li class="nav-item" data-depth="1">
    <a class="nav-link nav-item-toggle" href="../../../functions/">Functions</a>
<ul class="nav-list">
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../../functions/predicate/">Predicate functions</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../../functions/scalar/">Scalar functions</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../../functions/aggregating/">Aggregating functions</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../../functions/list/">List functions</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../../functions/mathematical-numeric/">Mathematical functions - numeric</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../../functions/mathematical-logarithmic/">Mathematical functions - logarithmic</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../../functions/mathematical-trigonometric/">Mathematical functions - trigonometric</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../../functions/string/">String functions</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../../functions/temporal/">Temporal functions - instant types</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../../functions/temporal/duration/">Temporal functions - duration</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../../functions/spatial/">Spatial functions</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../../functions/load-csv/">LOAD CSV functions</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../../functions/graph/">Graph functions</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../../functions/database/">Database functions</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../../functions/user-defined/">User-defined functions</a>
  </li>
</ul>
  </li>
  <li class="nav-item" data-depth="1">
    <a class="nav-link" href="../../../indexes-for-search-performance/">Indexes for search performance</a>
  </li>
  <li class="nav-item" data-depth="1">
    <a class="nav-link" href="../../../indexes-for-full-text-search/">Full-text search index</a>
  </li>
  <li class="nav-item" data-depth="1">
    <a class="nav-link" href="../../../indexes-for-vector-search/">Vector search index</a>
  </li>
  <li class="nav-item" data-depth="1">
    <a class="nav-link nav-item-toggle" href="../../../constraints/">Constraints</a>
<ul class="nav-list">
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../../constraints/syntax/">Syntax</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../../constraints/examples/">Examples</a>
  </li>
</ul>
  </li>
  <li class="nav-item" data-depth="1">
    <a class="nav-link nav-item-toggle" href="../../../query-tuning/">Query tuning</a>
<ul class="nav-list">
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../../query-tuning/query-options/">Cypher query options</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../../query-tuning/query-profile/">Profile a query</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../../query-tuning/indexes/">The use of indexes</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../../query-tuning/basic-example/">Basic query tuning example</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../../query-tuning/advanced-example/">Advanced query tuning example</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../../query-tuning/using/">Planner hints and the USING keyword</a>
  </li>
</ul>
  </li>
  <li class="nav-item" data-depth="1">
    <a class="nav-link nav-item-toggle" href="../../../execution-plans/">Execution plans</a>
<ul class="nav-list">
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../../execution-plans/db-hits/">Database hits</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../../execution-plans/operator-summary/">Execution plan operators</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../../execution-plans/operators/">Execution plan operators in detail</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../../execution-plans/shortestpath-planning/">Shortest path planning</a>
  </li>
</ul>
  </li>
  <li class="nav-item" data-depth="1">
    <a class="nav-link nav-item-toggle" href="../../../query-caches/">Query caches</a>
<ul class="nav-list">
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../../query-caches/unified-query-caches/">Unifying query caches</a>
  </li>
</ul>
  </li>
  <li class="nav-item" data-depth="1">
    <a class="nav-link nav-item-toggle" href="../../">Administration</a>
<ul class="nav-list">
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../databases/">Database management</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../aliases/">Database alias management</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../servers/">Server management</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link nav-item-toggle" href="../">Access control</a>
<ul class="nav-list">
  <li class="nav-item" data-depth="3">
    <a class="nav-link" href="../manage-users/">Managing users</a>
  </li>
  <li class="nav-item" data-depth="3">
    <a class="nav-link" href="../manage-roles/">Managing roles</a>
  </li>
  <li class="nav-item" data-depth="3">
    <a class="nav-link" href="../manage-privileges/">Managing privileges</a>
  </li>
  <li class="nav-item" data-depth="3">
    <a class="nav-link" href="../built-in-roles/">Built-in roles and privileges</a>
  </li>
  <li class="nav-item" data-depth="3">
    <a class="nav-link" href="../privileges-reads/">Read privileges</a>
  </li>
  <li class="nav-item" data-depth="3">
    <a class="nav-link" href="../privileges-writes/">Write privileges</a>
  </li>
  <li class="nav-item" data-depth="3">
    <a class="nav-link" href="../database-administration/">Database administration</a>
  </li>
  <li class="nav-item" data-depth="3">
    <a class="nav-link" href="../dbms-administration/">DBMS administration</a>
  </li>
  <li class="nav-item" data-depth="3">
    <a class="nav-link" href="../load-privileges/">Load privileges</a>
  </li>
  <li class="nav-item is-current-page" data-depth="3">
    <a class="nav-link" href="./">Limitations</a>
  </li>
  <li class="nav-item" data-depth="3">
    <a class="nav-link" href="../privileges-immutable/">Immutable privileges</a>
  </li>
</ul>
  </li>
</ul>
  </li>
  <li class="nav-item" data-depth="1">
    <a class="nav-link nav-item-toggle" href="../../../syntax/">Syntax</a>
<ul class="nav-list">
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../../syntax/parsing/">Parsing</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../../syntax/naming/">Naming rules and recommendations</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../../syntax/variables/">Variables</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../../syntax/reserved/">Reserved keywords</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../../syntax/parameters/">Parameters</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../../syntax/operators/">Operators</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../../syntax/comments/">Comments</a>
  </li>
</ul>
  </li>
  <li class="nav-item" data-depth="1">
    <a class="nav-link" href="../../../deprecations-additions-removals-compatibility/">Deprecations, additions, and compatibility</a>
  </li>
  <li class="nav-item" data-depth="1">
    <a class="nav-link" href="../../../keyword-glossary/">Glossary of keywords</a>
  </li>
  <li class="nav-item" data-depth="1">
    <span class="nav-text nav-item-toggle">Appendix</span>
<ul class="nav-list">
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../../styleguide/">Cypher styleguide</a>
  </li>
</ul>
  </li>
</ul>
  </li>
</ul>
  </nav>
</div>
    </div>
  </aside>
</div>
<main class="article">
<div class="toolbar" role="navigation">
  <div class="toolbar-wrapper">
    <button class="nav-toggle" aria-label="Toggle Table of Contents"></button>
    <a href="../../../introduction/" class="home-link" aria-label="Go to home page"></a>
    <nav class="breadcrumbs" aria-label="breadcrumbs">
  <ul>
    <li><a href="../../../introduction/">Cypher Manual</a></li>
    <li><a href="../../">
        Administration
    </a></li>
    <li><a href="../">
        Access control
    </a></li>
    <li><a href="./">
        Limitations
    </a></li>
  </ul>
</nav>
      </div>
</div>

  <div class="content">
<article class="doc">
<div class="sect-header">
<h1 class="page">Limitations</h1>
<div class="roles is-before-toc">
    <span class="role enterprise-edition"></span>
    <span class="role aura-db-enterprise"></span>
</div>
</div>





<div id="preamble">
<div class="sectionbody">
<div class="quoteblock abstract">
<blockquote>
<div class="paragraph">
<p>This section lists the known limitations and implications of Neo4js role-based access control security.</p>
</div>
</blockquote>
</div>
</div>
</div>
<div class="sect1">
<h2 id="access-control-limitations-indexes"><a class="anchor" href="#access-control-limitations-indexes"></a>Security and Indexes</h2>
<div class="sectionbody">
<div class="paragraph">
<p>As described in <a href="../../../indexes-for-search-performance/" class="xref page">Indexes for search performance</a>, Neo4j 5 supports the creation and use of indexes to improve the performance of Cypher<sup>&reg;</sup> queries.</p>
</div>
<div class="paragraph">
<p>Note that the Neo4j security model impacts the results of queries, regardless if the indexes are used or not.
When using non full-text Neo4j indexes, a Cypher query will always return the same results it would have if no index existed.
This means that, if the security model causes fewer results to be returned due to restricted read access in <a href="../manage-privileges/" class="xref page">Graph and sub-graph access control</a>,
the index will also return the same fewer results.</p>
</div>
<div class="paragraph">
<p>However, this rule is not fully obeyed by <a href="../../../indexes-for-full-text-search/" class="xref page">Indexes for full-text search</a>.
These specific indexes are backed by <em>Lucene</em> internally.
It is therefore not possible to know for certain whether a security violation has affected each specific entry returned from the index.
In face of this, Neo4j will return zero results from full-text indexes in case it is determined that any result might be violating the security privileges active for that query.</p>
</div>
<div class="paragraph">
<p>Since full-text indexes are not automatically used by Cypher, they do not lead to the case where the same Cypher query would return different results simply because such an index was created.
Users need to explicitly call procedures to use these indexes.
The problem is only that, if this behavior is not known by the user, they might expect the full-text index to return the same results that a different, but semantically similar, Cypher query does.</p>
</div>
<div class="sect2">
<h3 id="_example_with_denied_properties"><a class="anchor" href="#_example_with_denied_properties"></a>Example with denied properties</h3>
<div class="paragraph">
<p>Consider the following example.
The database has nodes with labels <code>:User</code> and <code>:Person</code>, and they have properties <code>name</code> and <code>surname</code>.
There are indexes on both properties:</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">CREATE INDEX singleProp FOR (n:User) ON (n.name);
CREATE INDEX composite  FOR (n:User) ON (n.name, n.surname);
CREATE FULLTEXT INDEX userNames FOR (n:User|Person) ON EACH [n.name, n.surname];</code></pre>
</div>
</div>
<div class="admonitionblock note">
<table>
<tr>
<td class="icon">
<i class="fa icon-note" title="Note"></i>
</td>
<td class="content">
<div class="paragraph">
<p>Full-text indexes support multiple labels.
See <a href="../../../indexes-for-full-text-search/" class="xref page">Indexes for full-text search</a> for more details on creating and using full-text indexes.</p>
</div>
</td>
</tr>
</table>
</div>
<div class="paragraph">
<p>After creating these indexes, it would appear that the latter two indexes accomplish the same thing.
However, this is not completely accurate.
The composite and full-text indexes behave in different ways and are focused on different use cases.
A key difference is that full-text indexes are backed by <em>Lucene</em>, and will use the <em>Lucene</em> syntax for querying.</p>
</div>
<div class="paragraph">
<p>This has consequences for users restricted on the labels or properties involved in the indexes.
Ideally, if the labels and properties in the index are denied, they can correctly return zero results from both native indexes and full-text indexes.
However, there are borderline cases where this is not as simple.</p>
</div>
<div class="paragraph">
<p>Imagine the following nodes were added to the database:</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">CREATE (:User {name: 'Sandy'});
CREATE (:User {name: 'Mark', surname: 'Andy'});
CREATE (:User {name: 'Andy', surname: 'Anderson'});
CREATE (:User:Person {name: 'Mandy', surname: 'Smith'});
CREATE (:User:Person {name: 'Joe', surname: 'Andy'});</code></pre>
</div>
</div>
<div class="paragraph">
<p>Consider denying the label <code>:Person</code>:</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">DENY TRAVERSE ON GRAPH * NODES Person TO users</code></pre>
</div>
</div>
<div class="paragraph">
<p>If the user runs a query that uses the native single property index on <code>name</code>:</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (n:User) WHERE n.name CONTAINS 'ndy' RETURN n.name</code></pre>
</div>
</div>
<div class="paragraph">
<p>This query performs several checks:</p>
</div>
<div class="ulist">
<ul>
<li>
<p>Scans the index to create a stream of results of nodes with the <code>name</code> property, which leads to five results.</p>
</li>
<li>
<p>Filters the results to include only nodes where <code>n.name CONTAINS 'ndy'</code>, filtering out <code>Mark</code> and <code>Joe</code>, which leads to three results.</p>
</li>
<li>
<p>Filters the results to exclude nodes that also have the denied label <code>:Person</code>, filtering out <code>Mandy</code>, which leads to two results.</p>
</li>
</ul>
</div>
<div class="paragraph">
<p>Two results will be returned from this dataset and only one of them has the <code>surname</code> property.</p>
</div>
<div class="paragraph">
<p>In order to use the native composite index on <code>name</code> and <code>surname</code>, the query needs to include a predicate on the <code>surname</code> property as well:</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (n:User)
WHERE n.name CONTAINS 'ndy' AND n.surname IS NOT NULL
RETURN n.name</code></pre>
</div>
</div>
<div class="paragraph">
<p>This query performs several checks, which are almost identical to the single property index query:</p>
</div>
<div class="ulist">
<ul>
<li>
<p>Scans the index to create a stream of results of nodes with the <code>name</code> and <code>surname</code> property, which leads to four results.</p>
</li>
<li>
<p>Filters the results to include only nodes where <code>n.name CONTAINS 'ndy'</code>, filtering out <code>Mark</code> and <code>Joe</code>, which leads to two results.</p>
</li>
<li>
<p>Filters the results to exclude nodes that also have the denied label <code>:Person</code>, filtering out <code>Mandy</code>, which leads to only one result.</p>
</li>
</ul>
</div>
<div class="paragraph">
<p>Only one result was returned from the above dataset.
What if this query with the full-text index was used instead:</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">CALL db.index.fulltext.queryNodes("userNames", "ndy") YIELD node, score
RETURN node.name</code></pre>
</div>
</div>
<div class="paragraph">
<p>The problem now is that it is not certain whether the results provided by the index were achieved due to a match to the <code>name</code> or the <code>surname</code> property.
The steps taken by the query engine would be:</p>
</div>
<div class="ulist">
<ul>
<li>
<p>Run a <em>Lucene</em> query on the full-text index to produce results containing <code>ndy</code> in either property, leading to five results.</p>
</li>
<li>
<p>Filter the results to exclude nodes that also have the label <code>:Person</code>, filtering out <code>Mandy</code> and <code>Joe</code>, leading to three results.</p>
</li>
</ul>
</div>
<div class="paragraph">
<p>This difference in results is caused by the <code>OR</code> relationship between the two properties in the index creation.</p>
</div>
</div>
<div class="sect2">
<h3 id="_denying_properties"><a class="anchor" href="#_denying_properties"></a>Denying properties</h3>
<div class="paragraph">
<p>Now consider denying access on properties, like the <code>surname</code> property:</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">DENY READ {surname} ON GRAPH * TO users</code></pre>
</div>
</div>
<div class="paragraph">
<p>For that, run the same queries again:</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (n:User)
WHERE n.name CONTAINS 'ndy'
RETURN n.name</code></pre>
</div>
</div>
<div class="paragraph">
<p>This query operates exactly as before, returning the same two results, because nothing in it relates to the denied property.</p>
</div>
<div class="paragraph">
<p>However, this is not the same for the query targeting the composite index:</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (n:User)
WHERE n.name CONTAINS 'ndy' AND n.surname IS NOT NULL
RETURN n.name</code></pre>
</div>
</div>
<div class="paragraph">
<p>Since the <code>surname</code> property is denied, it will appear to always be <code>null</code> and the composite index empty. Therefore, the query returns no result.</p>
</div>
<div class="paragraph">
<p>Now consider the full-text index query:</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">CALL db.index.fulltext.queryNodes("userNames", "ndy") YIELD node, score
RETURN node.name</code></pre>
</div>
</div>
<div class="paragraph">
<p>The problem remains, since it is not certain whether the results provided by the index were returned due to a match on the <code>name</code> or the <code>surname</code> property.
Results from the <code>surname</code> property now need to be excluded by the security rules, because they require that the user is unable to see any <code>surname</code> properties.
However, the security model is not able to introspect the <em>Lucene</em> query in order to know what it will actually do, whether it works only on the allowed <code>name</code> property, or also on the disallowed <code>surname</code> property.
What is known is that the earlier query returned a match for <code>Joe Andy</code> which should now be filtered out.
Therefore, in order to never return results the user should not be able to see, all results need to be blocked.
The steps taken by the query engine would be:</p>
</div>
<div class="ulist">
<ul>
<li>
<p>Determine if the full-text index includes denied properties.</p>
</li>
<li>
<p>If yes, return an empty results stream.
Otherwise, it will process as described before.</p>
</li>
</ul>
</div>
<div class="paragraph">
<p>In this case, the query will return zero results rather than simply returning the results <code>Andy</code> and <code>Sandy</code>, which might have been expected.</p>
</div>
</div>
</div>
</div>
<div class="sect1">
<h2 id="access-control-limitations-labels"><a class="anchor" href="#access-control-limitations-labels"></a>Security and labels</h2>
<div class="sectionbody">
<div class="sect2">
<h3 id="_traversing_the_graph_with_multi_labeled_nodes"><a class="anchor" href="#_traversing_the_graph_with_multi_labeled_nodes"></a>Traversing the graph with multi-labeled nodes</h3>
<div class="paragraph">
<p>The general influence of access control privileges on graph traversal is described in detail in <a href="../manage-privileges/" class="xref page">Graph and sub-graph access control</a>.
The following section will only focus on nodes due to their ability to have multiple labels.
Relationships can only have one type of label and thus they do not exhibit the behavior this section aims to clarify.
While this section will not mention relationships further, the general function of the traverse privilege also applies to them.</p>
</div>
<div class="paragraph">
<p>For any node that is traversable, due to <code>GRANT TRAVERSE</code> or <code>GRANT MATCH</code>,
the user can get information about the attached labels by calling the built-in <code>labels()</code> function.
In the case of nodes with multiple labels, they can be returned to users that weren&#8217;t directly granted access to.</p>
</div>
<div class="paragraph">
<p>To give an illustrative example, imagine a graph with three nodes: one labeled <code>:A</code>, another labeled <code>:B</code> and one with the labels <code>:A</code> and <code>:B</code>.
In this case, there is a user with the role <code>custom</code> defined by:</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">GRANT TRAVERSE ON GRAPH * NODES A TO custom</code></pre>
</div>
</div>
<div class="paragraph">
<p>If that user were to execute</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (n:A)
RETURN n, labels(n)</code></pre>
</div>
</div>
<div class="paragraph">
<p>They would get a result with two nodes: the node that was labeled with <code>:A</code> and the node with labels <code>:A :B</code>.</p>
</div>
<div class="paragraph">
<p>In contrast, executing</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (n:B)
RETURN n, labels(n)</code></pre>
</div>
</div>
<div class="paragraph">
<p>This will return only the one node that has both labels: <code>:A</code> and <code>:B</code>.
Even though <code>:B</code> did not have access to traversals, there is one node with that label accessible in the dataset due to the allow-listed label <code>:A</code> that is attached to the same node.</p>
</div>
<div class="paragraph">
<p>If a user is denied to traverse on a label they will never get results from any node that has this label attached to it.
Thus, the label name will never show up for them.
As an example, this can be done by executing:</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">DENY TRAVERSE ON GRAPH * NODES B TO custom</code></pre>
</div>
</div>
<div class="paragraph">
<p>The query</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (n:A)
RETURN n, labels(n)</code></pre>
</div>
</div>
<div class="paragraph">
<p>will now return the node only labeled with <code>:A</code>, while the query</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (n:B)
RETURN n, labels(n)</code></pre>
</div>
</div>
<div class="paragraph">
<p>will now return no nodes.</p>
</div>
</div>
<div class="sect2">
<h3 id="_the_db_labels_procedure"><a class="anchor" href="#_the_db_labels_procedure"></a>The db.labels() procedure</h3>
<div class="paragraph">
<p>In contrast to the normal graph traversal described in the previous section, the built-in <code>db.labels()</code> procedure is not processing the data graph itself, but the security rules defined on the system graph.
That means:</p>
</div>
<div class="ulist">
<ul>
<li>
<p>If a label is explicitly whitelisted (granted), it will be returned by this procedure.</p>
</li>
<li>
<p>If a label is denied or isn&#8217;t explicitly allowed, it will not be returned by this procedure.</p>
</li>
</ul>
</div>
<div class="paragraph">
<p>Reusing the previous example, imagine a graph with three nodes: one labeled <code>:A</code>, another labeled <code>:B</code> and one with the labels <code>:A</code> and <code>:B</code>.
In this case, there is a user with the role <code>custom</code> defined by:</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">GRANT TRAVERSE ON GRAPH * NODES A TO custom</code></pre>
</div>
</div>
<div class="paragraph">
<p>This means that only label <code>:A</code> is explicitly allow-listed.
Thus, executing</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">CALL db.labels()</code></pre>
</div>
</div>
<div class="paragraph">
<p>will only return label <code>:A</code>, because that is the only label for which traversal was granted.</p>
</div>
</div>
</div>
</div>
<div class="sect1">
<h2 id="access-control-limitations-db-operations"><a class="anchor" href="#access-control-limitations-db-operations"></a>Security and count store operations</h2>
<div class="sectionbody">
<div class="paragraph">
<p>The rules of a security model may impact some of the database operations.
This means extra security checks are necessary to incur additional data accesses, especially in the case of count store operations.
These are, however, usually very fast lookups and the difference might be noticeable.</p>
</div>
<div class="paragraph">
<p>See the following security rules that use a <code>restricted</code> and a <code>free</code> role as an example:</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">GRANT TRAVERSE ON GRAPH * NODES Person TO restricted;
DENY TRAVERSE ON GRAPH * NODES Customer TO restricted;
GRANT TRAVERSE ON GRAPH * ELEMENTS * TO free;</code></pre>
</div>
</div>
<div class="paragraph">
<p>Now, let&#8217;s look at what the database needs to do in order to execute the following query:</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (n:Person)
RETURN count(n)</code></pre>
</div>
</div>
<div class="paragraph">
<p>For both roles the execution plan will look like this:</p>
</div>
<div class="listingblock">
<div class="content">
<pre>+--------------------------+
| Operator                 |
+--------------------------+
| +ProduceResults          |
| |                        +
| +NodeCountFromCountStore |
+--------------------------+</pre>
</div>
</div>
<div class="paragraph">
<p>Internally, however, very different operations need to be executed.
The following table illustrates the difference:</p>
</div>
<table class="tableblock frame-all grid-all stretch">
<colgroup>
<col style="width: 50%;">
<col style="width: 50%;">
</colgroup>
<thead>
<tr>
<th class="tableblock halign-left valign-top">User with <code>free</code> role</th>
<th class="tableblock halign-left valign-top">User with <code>restricted</code> role</th>
</tr>
</thead>
<tbody>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock">The database can access the count store and retrieve the total number of nodes with the label <code>:Person</code>.</p>
<p class="tableblock">This is a very quick operation.</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">The database cannot access the count store because it must make sure that only traversable nodes with the desired label <code>:Person</code> are counted.
Due to this, each node with the <code>:Person</code> label needs to be accessed and examined to make sure that they do not have a deny-listed label, such as <code>:Customer</code>.</p>
<p class="tableblock">Due to the additional data accesses that the security checks need to do, this operation will be slower compared to executing the query as an unrestricted user.</p></td>
</tr>
</tbody>
</table>
</div>
</div>
<nav class="pagination">
  <span class="prev"><a href="../load-privileges/">Load privileges</a></span>

  <span class="next"><a href="../privileges-immutable/">Immutable privileges</a></span>
</nav>
    <div class="feedback">
    <div class="header question">
        <p><strong>Was this page helpful?</strong></p>

        <svg width="22px" height="22px" viewBox="0 0 22 22" role="button" class="no" aria-label="No, this page isn't helpful">
            <path
                d="M6.25,15.8333333 C6.25,13.7622655 7.92893219,12.0833333 10,12.0833333 C12.0710678,12.0833333 13.75,13.7622655 13.75,15.8333333"
                ></path>
            <circle  cx="10" cy="10" r="9.58333333"></circle>
            <path
                d="M12.5,4.58333333 C12.8934466,4.05873783 13.5109223,3.75 14.1666667,3.75 C14.822411,3.75 15.4398867,4.05873783 15.8333333,4.58333333"
                ></path>
            <line x1="4.58333333" y1="7.91666667" x2="7.08333333" y2="7.91666667" ></line>
            <path
                d="M7.08333333,8.54166667 C6.96827401,8.54166667 6.875,8.44839266 6.875,8.33333333 C6.875,8.21827401 6.96827401,8.125 7.08333333,8.125 C7.19839266,8.125 7.29166667,8.21827401 7.29166667,8.33333333 C7.29166667,8.44839266 7.19839266,8.54166667 7.08333333,8.54166667"
                ></path>
            <line x1="12.9166667" y1="7.91666667" x2="15.4166667" y2="7.91666667" ></line>
            <path
                d="M15.4166667,8.54166667 C15.3016073,8.54166667 15.2083333,8.44839266 15.2083333,8.33333333 C15.2083333,8.21827401 15.3016073,8.125 15.4166667,8.125 C15.531726,8.125 15.625,8.21827401 15.625,8.33333333 C15.625,8.44839266 15.531726,8.54166667 15.4166667,8.54166667"
                ></path>
            <path
                d="M4.16666667,4.58333333 C4.5601133,4.05873783 5.17758895,3.75 5.83333333,3.75 C6.48907772,3.75 7.10655337,4.05873783 7.5,4.58333333"
                ></path>
        </svg>

        <svg width="22px" height="22px" viewBox="0 0 22 22" role="button" class="yes" aria-label="Yes, this page is helpful">
            <circle  cx="10" cy="10" r="9.58333333"></circle>
            <path
                d="M5.41666667,8.125 C5.53172599,8.125 5.625,8.21827401 5.625,8.33333333 C5.625,8.44839266 5.53172599,8.54166667 5.41666667,8.54166667 C5.30160734,8.54166667 5.20833333,8.44839266 5.20833333,8.33333333 C5.20833333,8.21827401 5.30160734,8.125 5.41666667,8.125"
                ></path>
            <path
                d="M14.5833333,8.125 C14.468274,8.125 14.375,8.21827401 14.375,8.33333333 C14.375,8.44839266 14.468274,8.54166667 14.5833333,8.54166667 C14.6983927,8.54166667 14.7916667,8.44839266 14.7916667,8.33333333 C14.7916667,8.21827401 14.6983927,8.125 14.5833333,8.125"
                ></path>
            <path
                d="M13.2275,12.9166657 C13.4853075,12.9162808 13.7287776,13.035241 13.8869095,13.2388563 C14.0450415,13.4424715 14.1000278,13.7078123 14.0358333,13.9575 C13.562901,15.7999679 11.9021969,17.0882321 10,17.0882321 C8.09780311,17.0882321 6.43709903,15.7999679 5.96416667,13.9575 C5.89997223,13.7078123 5.95495852,13.4424715 6.11309045,13.2388563 C6.27122239,13.035241 6.51469246,12.9162808 6.7725,12.9166657 L13.2275,12.9166657 Z"
                ></path>
        </svg>
    </div>


</div></article>
<aside class="toc sidebar" data-title="Contents"
  data-levels="2">
  <div class="toc-menu">
    <div class="toc-menu-placeholder"></div>

      </div>
  </aside>  </div>
</main>
</div>
<footer class="footer">
  <div class="wrapper">
  <div class="column">
    <div class="logo-footer"></div>
    <p> <span id="footer-copyright-year">2023</span> Neo4j, Inc.<br>
      <a href="https://neo4j.com/terms/">Terms</a> | <a href="https://neo4j.com/privacy-policy/">Privacy </a> | <a href="https://neo4j.com/sitemap/">Sitemap</a></p>
    <p>Neo4j<sup></sup>, Neo Technology<sup></sup>, Cypher<sup></sup>, Neo4j<sup></sup> Bloom<sup></sup> and
      Neo4j<sup></sup> Aura<sup></sup> are registered trademarks
      of Neo4j, Inc. All other marks are owned by their respective companies.</p>
  </div>

  <div class="column">
    <h2><a href="https://neo4j.com/contact-us/?ref=footer">Contact Us </a></h2>
    <p>US: 1-855-636-4532<br>
      Sweden +46 171 480 113<br>
      UK: +44 20 3868 3223<br>
      France: +33 (0) 1 88 46 13 20<br>
      <!--Germany: +49 (0)89 26204 6300</p>-->
    </p>
  </div>
  <div class="column links">
    <h2>Learn</h2>
    <ul>
      <li><i class="fa fa-wrench" aria-hidden="true"></i> <a rel="noopener" href="https://neo4j.com/sandbox/?ref=developer-footer">Sandbox</a></li>
      <li><i class="fa fa-comments-o" aria-hidden="true"></i> <a rel="noopener" href="https://community.neo4j.com?ref=developer-footer" target="_blank">Neo4j Community Site</a></li>
      <li><i class="fa fa-book" aria-hidden="true"></i> <a rel="noopener" href="https://medium.com/neo4j" target="_blank">Neo4j Developer Blog</a></li>
      <li><i class="fa fa-youtube" aria-hidden="true"></i> <a rel="noopener" href="https://www.youtube.com/neo4j" target="_blank">Neo4j Videos</a></li>
      <li><i class="fa fa-graduation-cap" aria-hidden="true"></i> <a rel="noopener" href="https://neo4j.com/graphacademy/?ref=developer-footer">GraphAcademy</a></li>
      <li><i class="fa fa-flask" aria-hidden="true"></i> <a href="https://neo4j.com/labs/?ref=developer-footer">Neo4j Labs</a></li>
    </ul>
  </div>
  <div class="column links">
    <h2>Social</h2>
    <ul>
      <li><i class="fa fa-twitter" aria-hidden="true"></i> <a rel="noopener" href="https://twitter.com/neo4j" target="_blank">Twitter</a></li>
      <li><i class="fa fa-meetup" aria-hidden="true"></i> <a rel="noopener" href="https://www.meetup.com/Neo4j-Online-Meetup/" target="_blank">Meetups</a></li>
      <li><i class="fa fa-github" aria-hidden="true"></i> <a rel="noopener" href="https://github.com/neo4j/neo4j" target="_blank">Github</a></li>
      <li><i class="fa fa-stack-overflow" aria-hidden="true"></i> <a rel="noopener" href="https://stackoverflow.com/questions/tagged/neo4j" target="_blank">Stack Overflow</a></li>

      <li class="speaker-program"><a href="https://docs.google.com/forms/d/e/1FAIpQLSdEcNnMruES5iwvOVYovmS1D_P1ZL_HdUOitFrwrvruv5PZvA/viewform">Want to Speak?</a></li>
    </ul>
  </div>
</div>
</footer>

  <script src="../../../../../assets/js/vendor/auth0.js"></script>
  <script src="../../../../../assets/js/site.js"></script>
  <script async src="../../../../../assets/js/vendor/highlight.js"></script>
  <script async src="../../../../../assets/js/vendor/image-zoom.js"></script>


<div id="neo4j-algolia-search-v2"></div>
<script src="https://neo4j.com/wp-content/themes/neo4jweb/assets/neo4j-react-modules-assets/search-preact/chunkless/bundle.js"></script>
<script src="https://neo4j.com/wp-content/themes/neo4jweb/assets/neo4j-react-modules-assets/search-preact/chunkless/polyfill.js"></script>
<script>window.algoliaSearchOptions = {indexName: "docs",placeholder: "Search Documentation",template: "docs"}</script>  </body>
</html>
