<!DOCTYPE html>
<html lang="en">
  <head>
    <meta charset="utf-8">
    <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=5, minimum-scale=1">
    <meta name="msvalidate.01" content="B5163518CBE4A854B63801277FE5E35C" />
    <meta name="google-site-verification" content="ucqagxjVuq0lJZeLKs0F5AppzK111lNt3IoxU6mzlJE" />
    <meta name="robots" content="index, follow" />
    <meta name="googlebot" content="index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1" />
    <meta name="bingbot" content="index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1" />

    <meta property="og:locale" content="en_US" />
    <meta property="og:type" content="article" />

<script>(function(w,d,s,l,i){w[l]=w[l]||[];w[l].push({'gtm.start':new Date().getTime(),event:'gtm.js'});var f=d.getElementsByTagName(s)[0],j=d.createElement(s),dl=l!='dataLayer'?'&l='+l:'';j.async=true;j.src='https://www.googletagmanager.com/gtm.js?id='+i+dl;f.parentNode.insertBefore(j,f);})(window,document,'script','dataLayer','GTM-WK23PSS');</script>
<!-- Hotjar Tracking Code for staging -->
<script>
    (function(h,o,t,j,a,r){
        h.hj=h.hj||function(){(h.hj.q=h.hj.q||[]).push(arguments)};
        h._hjSettings={hjid:3587741,hjsv:6};
        a=o.getElementsByTagName('head')[0];
        r=o.createElement('script');r.async=1;
        r.src=t+h._hjSettings.hjid+j+h._hjSettings.hjsv;
        a.appendChild(r);
    })(window,document,'https://static.hotjar.com/c/hotjar-','.js?sv=');
</script>
<!-- End Hotjar Tracking code -->
    <title>WHERE - Cypher Manual</title>
    <link rel="prev" href="../unwind/">
    <link rel="next" href="../order-by/">
      <meta name="description" content="&#x60;WHERE&#x60; adds constraints to the patterns in a &#x60;MATCH&#x60; or &#x60;OPTIONAL MATCH&#x60; clause or filters the results of a &#x60;WITH&#x60; clause.">
<link rel="stylesheet" href="https://neo4j.com/wp-content/themes/neo4jweb/assets/neo4j-react-modules-assets/search-preact/chunkless/bundle.css" />
<link rel="stylesheet" href="https://neo4j.com/wp-content/themes/neo4jweb/assets/neo4j-react-modules-assets/search-preact/chunkless/utilities.min.css" />

    <link rel="preload" href="../../../../assets/fonts/fontawesome-webfont.woff2?v=4.7.0" as="font">
    <link rel="stylesheet" href="../../../../assets/css/site.css">
    <link href="https://fonts.googleapis.com/css2?family=Nunito+Sans:wght@300;400;600;700&display=swap" rel="stylesheet">

    <link rel="shortcut icon" href="https://neo4j.com/wp-content/themes/neo4jweb/favicon.ico" />



    <meta property="neo:type" content="Docs">
    <meta property="neo:site" content="Reference Docs">


    <meta property="og:site_name" content="Neo4j Graph Data Platform" />
    <meta property="article:publisher" content="https://www.facebook.com/neo4j.graph.database" />
    <meta name="twitter:card" content="summary_large_image" />
    <meta name="twitter:creator" content="@neo4j" />
    <meta name="twitter:site" content="@neo4j" />
    <meta property="og:type" content="article" />
    <meta property="og:title" content="WHERE - Cypher Manual" />
    <meta property="og:locale" content="en_US" />
    <meta property="og:image" content="https://dist.neo4j.com/wp-content/uploads/20210423062553/neo4j-social-share-21.png" />
    <meta property="og:description" content="`WHERE` adds constraints to the patterns in a `MATCH` or `OPTIONAL MATCH` clause or filters the results of a `WITH` clause." />
    <meta property="og:url" content="https://neo4j.com/docs/cypher-manual/5/clauses/where/" />
    <link rel="shortcut icon" href="https://neo4j.com/wp-content/themes/neo4jweb/favicon.ico" />
  </head>
  <body class="article docs">
<!-- Google Tag Manager (noscript) -->
<noscript><iframe src="https://www.googletagmanager.com/ns.html?id=GTM-WK23PSS"
height="0" width="0" style="display:none;visibility:hidden"></iframe></noscript>
<!-- End Google Tag Manager (noscript) -->
<script>(function(f,b){if(!b.__SV){var e,g,i,h;window.mixpanel=b;b._i=[];b.init=function(e,f,c){function g(a,d){var b=d.split(".");2==b.length&&(a=a[b[0]],d=b[1]);a[d]=function(){a.push([d].concat(Array.prototype.slice.call(arguments,0)))}}var a=b;"undefined"!==typeof c?a=b[c]=[]:c="mixpanel";a.people=a.people||[];a.toString=function(a){var d="mixpanel";"mixpanel"!==c&&(d+="."+c);a||(d+=" (stub)");return d};a.people.toString=function(){return a.toString(1)+".people (stub)"};i="disable time_event track track_pageview track_links track_forms track_with_groups add_group set_group remove_group register register_once alias unregister identify name_tag set_config reset opt_in_tracking opt_out_tracking has_opted_in_tracking has_opted_out_tracking clear_opt_in_out_tracking start_batch_senders people.set people.set_once people.unset people.increment people.append people.union people.track_charge people.clear_charges people.delete_user people.remove".split(" ");
for(h=0;h<i.length;h++)g(a,i[h]);var j="set set_once union unset remove delete".split(" ");a.get_group=function(){function b(c){d[c]=function(){call2_args=arguments;call2=[c].concat(Array.prototype.slice.call(call2_args,0));a.push([e,call2])}}for(var d={},e=["get_group"].concat(Array.prototype.slice.call(arguments,0)),c=0;c<j.length;c++)b(j[c]);return d};b._i.push([e,f,c])};b.__SV=1.2;e=f.createElement("script");e.type="text/javascript";e.async=!0;e.src="undefined"!==typeof MIXPANEL_CUSTOM_LIB_URL?
MIXPANEL_CUSTOM_LIB_URL:"file:"===f.location.protocol&&"//cdn.mxpnl.com/libs/mixpanel-2-latest.min.js".match(/^\/\//)?"https://cdn.mxpnl.com/libs/mixpanel-2-latest.min.js":"//cdn.mxpnl.com/libs/mixpanel-2-latest.min.js";g=f.getElementsByTagName("script")[0];g.parentNode.insertBefore(e,g)}})(document,window.mixpanel||[]);
mixpanel.init("4bfb2414ab973c741b6f067bf06d5575", {batch_requests: true})
mixpanel.track("Page View", {
    pathname: window.location.origin + window.location.pathname,
    search: window.location.search,
    hash: window.location.hash,
    referrer: document.referrer,
})
</script>
<header class="header">
  <nav class="navbar">
    <div class="navbar-brand">
      <a class="navbar-item" href="/">

      <img class="navbar-logo" src="https://dist.neo4j.com/wp-content/uploads/20210422142941/neo4j-logo-2020.svg" alt="Neo4j Docs" />
      <a href="/docs/" class="navbar-item no-left-padding" aria-label="Docs">
        Docs
      </a>

      </div>

      <button class="navbar-search search-button" data-target="topbar-nav" id="search_open_mobile" aria-label="Open Search">
        <svg width="23px" height="23px" viewBox="0 0 23 23" version="1.1" class="fill-current float-right" id="searchx" role="button" title="Search Website">
          <g stroke="none" stroke-width="1" fill="none" fill-rule="evenodd" stroke-linecap="round"
            stroke-linejoin="round">
            <g transform="translate(-2.000000, -2.000000)" stroke="#a0aec0" stroke-width="1.5">
              <circle
                transform="translate(11.389364, 11.388564) rotate(-23.025000) translate(-11.389364, -11.388564) "
                cx="11.3893642" cy="11.3885639" r="8.056"></circle>
              <path d="M17.0853333,17.0844444 L23.3333333,23.3333333" ></path>
            </g>
          </g>
        </svg>
      </button>
      <button class="navbar-burger" data-target="topbar-nav" aria-label="Mobile Navigation Button">
        <span></span>
        <span></span>
        <span></span>
      </button>
    </div>
    <div id="topbar-nav" class="navbar-menu">
            <div class="navbar-end">


        <div class="navbar-item has-dropdown is-hoverable docs">
          <a class="navbar-link" href="/docs/">Docs</a>
          <div class="navbar-dropdown">
            <div class="navbar-item project">
              <span class="project-name">Neo4j DBMS</span>
              <ul class="project-links">
                <li><a href="/docs/getting-started/current/" class="project-link">Getting Started</a></li>
                <li><a href="/docs/operations-manual/current/" class="project-link">Operations</a></li>
                <li><a href="/docs/migration-guide/current/" class="project-link">Migration and Upgrade</a></li>
                <li><a href="/docs/status-codes/current/" class="project-link">Status Codes</a></li>
                <li><a href="/docs/java-reference/current/" class="project-link">Java Reference</a></li>
                <li><a href="/docs/kerberos-add-on/current/" class="project-link">Kerberos Add-on</a></li>
              </ul>
            </div>

            <div class="navbar-item project">
              <a class="project-name" href="/docs/aura/">Neo4j Aura</a>
              <ul class="project-links">
                <li><a class="project-link" href="/docs/aura">Neo4j Aura</a></li>
                <li><a class="project-link" href="/docs/aura/auradb/">Neo4j AuraDB</a></li>
                <li><a class="project-link" href="/docs/aura/aurads/">Neo4j AuraDS</a></li>
              </ul>
            </div>

            <div class="navbar-item project">
              <span class="project-name">Neo4j Tools</span>
              <ul class="project-links">
                <li><a href="/docs/bloom-user-guide/current/" class="project-link">Neo4j Bloom</a></li>
                <li><a href="/docs/browser-manual/current/" class="project-link">Neo4j Browser</a></li>
                <li><a href="/docs/data-importer/current/" class="project-link">Neo4j Data Importer</a></li>
                <li><a href="/docs/desktop-manual/current/" class="project-link">Neo4j Desktop</a></li>
                <li><a href="/docs/ops-manager/current/" class="project-link">Neo4j Ops Manager</a></li>
              </ul>
            </div>

            <div class="navbar-item project">
              <span class="project-name">Neo4j Graph Data Science</span>
              <ul class="project-links">
                <li><a href="/docs/graph-data-science/current/" class="project-link">Neo4j Graph Data Science Library</a></li>
              </ul>
            </div>

            <div class="navbar-item project">
              <span class="project-name">Cypher Query Language</span>
              <ul class="project-links">
                <li><a href="/docs/cypher-manual/current/" class="project-link">Cypher</a></li>
                <li><a href="/docs/cypher-cheat-sheet/current/" class="project-link">Cypher Cheat Sheet</a></li>
                <li><a href="/docs/apoc/current/" class="project-link">APOC Library</a></li>
              </ul>
            </div>

            <div class="navbar-item project">
              <span class="project-name" href="/docs/drivers-apis">Create applications</span>
              <ul class="project-links">
                <li><a href="/docs/python-manual/current/" class="project-link">Python Driver</a></li>
                <li><a href="/docs/go-manual/current/" class="project-link">Go Driver</a></li>
                <li><a href="/docs/java-manual/current/" class="project-link">Java Driver</a></li>
                <li><a href="/docs/javascript-manual/current/" class="project-link">JavaScript Driver</a></li>
                <li><a href="/docs/dotnet-manual/current/" class="project-link">.Net Driver</a></li>
                <li><a href="/docs/graphql-manual/current/" class="project-link">Neo4j GraphQL Library</a></li>
                <li><a href="/docs/http-api/current/" class="project-link">HTTP API</a></li>
                <li><a href="/docs/ogm-manual/current/" class="project-link">OGM Library</a></li>
                <li><a href="https://docs.spring.io/spring-data/neo4j/docs/current/reference/html/#reference" class="project-link">Spring Data Neo4j</a></li>
                <li><a href="/docs/spark/" class="project-link">Neo4j Connector for Apache Spark</a></li>
                <li><a href="/docs/kafka/" class="project-link">Neo4j Connector for Apache Kafka</a></li>
              </ul>
            </div>

          </div>
        </div>
        <div class="navbar-item has-dropdown is-hoverable labs">
          <a class="navbar-link" href="/labs/">Labs</a>
          <div class="navbar-dropdown">
            <div class="navbar-item project">
              <a class="project-name" href="/labs/arrows/">arrows.app</a>
              <ul class="project-links">
                <li><a href="/labs/arrows/" class="project-link">Details</a></li>
                <li><a href="https://arrows.app" class="project-link">arrows.app</a></li>
              </ul>
            </div>
            <div class="navbar-item project">
              <a class="project-name" href="/labs/apoc/">APOC Extended</a>

              <ul class="project-links">
                <li><a href="/labs/apoc/5/" class="project-link">Documentation</a></li>
                <li><a href="/developer/neo4j-apoc/" class="project-link">Developer Guide</a></li>
              </ul>
            </div>
            <div class="navbar-item project">
              <a class="project-name" href="/labs/halin/">Halin</a>
            </div>
            <div class="navbar-item project">
              <a class="project-name" href="/labs/etl-tool/">ETL Tool</a>
              <ul class="project-links">
                <li><a href="/labs/etl-tool/" class="project-link">Details</a></li>
                <li><a href="/labs/etl-tool/1.5.0/" class="project-link">Documentation</a></li>
              </ul>
            </div>
            <div class="navbar-item project">
              <a class="project-name" href="/labs/neo4j-migrations/">Neo4j Migrations</a>
              <ul class="project-links">
                <li><a href="/labs/neo4j-migrations/" class="project-link">Details</a></li>
                <li><a href="/labs/neo4j-migrations/2.0/" class="project-link">Documentation</a></li>
              </ul>
            </div>
            <div class="navbar-item project">
              <a class="project-name" href="/labs/liquibase/">Neo4j Plugin For Liquibase</a>
              <ul class="project-links">
                <li><a href="/labs/liquibase/" class="project-link">Details</a></li>
                <li><a href="https://github.com/liquibase/liquibase-neo4j" class="project-link">Documentation</a></li>
              </ul>
            </div>
            <div class="navbar-item project">
              <a class="project-name" href="/labs/neosemantics/">Neosemantics</a>
              <ul class="project-links">
                <li><a href="/labs/neosemantics/tutorial/" class="project-link">Getting Started</a></li>
                <li><a href="/labs/neosemantics/4.0/" class="project-link">Documentation</a></li>
              </ul>
            </div>
            <div class="navbar-item project">
              <a class="project-name" href="/labs/neo4j-helm/">Neo4j Helm</a>
              <ul class="project-links">
                <li><a href="/labs/neo4j-helm/" class="project-link">Details</a></li>
                <li><a href="/labs/neo4j-helm/1.0.0/" class="project-link">Documentation</a></li>
              </ul>
            </div>
            <div class="navbar-item project">
              <a class="project-name" href="/labs/neodash/">NeoDash</a>
              <ul class="project-links">
                <li><a href="/labs/neodash/" class="project-link">Details</a></li>
                <li><a href="/labs/neodash/2.1/" class="project-link">Documentation</a></li>
              </ul>
            </div>
            <div class="navbar-item project">
              <a class="project-name" href="/labs/neomodel/">neomodel</a>
              <ul class="project-links">
                <li><a href="/labs/neomodel/" class="project-link">Details</a></li>
                <li><a href="https://neomodel.readthedocs.io/en/latest/" target="_blank" class="project-link">Documentation</a></li>
              </ul>
            </div>
          </div>
        </div>
        <div class="navbar-item has-dropdown is-hoverable developer">
          <a class="navbar-link" href="/developer/resources/">Get Help</a>
          <div class="navbar-dropdown">
            <div class="navbar-item project">
              <a class="project-name" href="https://graphacademy.neo4j.com/?ref=docs" target="_blank">GraphAcademy</a>
              <ul class="project-links">
                <li><a class="project-link" href="https://graphacademy.neo4j.com/?ref=docs">Free, Self Paced Training</a></li>
                <li><a class="project-link" href="https://graphacademy.neo4j.com/certification/?ref=docs" target="_blank">Certification</a></li>
              </ul>
            </div>

            <div class="navbar-item project">
              <a class="project-name" href="https://dev.neo4j.com/forum" target="_blank">Community Forum</a>
            </div>
            <div class="navbar-item project">
              <a class="project-name" href="https://dev.neo4j.com/chat" target="_blank">Discord Chat</a>
            </div>
            <div class="navbar-item project">
              <a class="project-name" href="/developer/kb" target="_blank">Knowledge Base</a>
            </div>
            <div class="navbar-item project">
              <a class="project-name" href="https://medium.com/neo4j" target="_blank">Neo4j Developer Blog</a>
            </div>
            <div class="navbar-item project">
              <a class="project-name" href="https://www.youtube.com/neo4j" target="_blank">Neo4j Videos</a>
            </div>
          </div>
        </div>
        <div class="navbar-item is-hoverable getting-started-cta">
          <a class="navbar-link primary" href="https://neo4j.com/cloud/platform/aura-graph-database/?ref=docs-nav-get-started">Get Started Free</a>
        </div>
        <div class="navbar-item">
          <a class="navbar-link search-button" href="#search" id="search_open"><svg width="23px" height="23px" viewBox="0 0 23 23"
              version="1.1" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink"
              class="fill-current float-right" id="search" role="button" title="Search Website">
              <g stroke="none" stroke-width="1" fill="none" fill-rule="evenodd" stroke-linecap="round"
                stroke-linejoin="round">
                <g transform="translate(-2.000000, -2.000000)" stroke="#a0aec0" stroke-width="1.5">
                  <circle
                    transform="translate(11.389364, 11.388564) rotate(-23.025000) translate(-11.389364, -11.388564) "
                    cx="11.3893642" cy="11.3885639" r="8.056"></circle>
                  <path d="M17.0853333,17.0844444 L23.3333333,23.3333333" ></path>
                </g>
              </g>
            </svg><span class="navbar-mobile">Search</span></a>
        </div>
      </div>
    </div>
  </nav>
</header>
<div class="body">
<div class="nav-container" data-component="cypher-manual" data-version="5">
  <aside class="nav">
    <div class="panels">
      <div class="selectors">
        
      </div>
      <div class="nav-panel-menu is-active" data-panel="menu">
    <nav class="nav-menu">
    <ul class="nav-list">
  <li class="nav-item" data-depth="0">
<ul class="nav-list">
  <li class="nav-item" data-depth="1">
    <a class="nav-link nav-item-toggle" href="../../introduction/">Introduction</a>
<ul class="nav-list">
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../introduction/cypher_overview/">Overview</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../introduction/cypher_neo4j/">Cypher and Neo4j</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../introduction/cypher_aura/">Cypher and Aura</a>
  </li>
</ul>
  </li>
  <li class="nav-item" data-depth="1">
    <a class="nav-link nav-item-toggle" href="../../queries/">Queries</a>
<ul class="nav-list">
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../queries/concepts/">Core concepts</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../queries/basic/">Basic queries</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../queries/expressions/">Cypher expressions</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../queries/case/">Conditional expressions (CASE)</a>
  </li>
</ul>
  </li>
  <li class="nav-item" data-depth="1">
    <a class="nav-link nav-item-toggle" href="../">Clauses</a>
<ul class="nav-list">
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../clause_composition/">Clause composition</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../match/">MATCH</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../optional-match/">OPTIONAL MATCH</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../return/">RETURN</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../with/">WITH</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../unwind/">UNWIND</a>
  </li>
  <li class="nav-item is-current-page" data-depth="2">
    <a class="nav-link" href="./">WHERE</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../order-by/">ORDER BY</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../skip/">SKIP</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../limit/">LIMIT</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../create/">CREATE</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../delete/">DELETE</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../set/">SET</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../remove/">REMOVE</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../foreach/">FOREACH</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../merge/">MERGE</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../call/">CALL procedure</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../union/">UNION</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../use/">USE</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../load-csv/">LOAD CSV</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../listing-functions/">SHOW FUNCTIONS</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../listing-procedures/">SHOW PROCEDURES</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../listing-settings/">SHOW SETTINGS</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../transaction-clauses/#query-listing-transactions">SHOW TRANSACTIONS</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../transaction-clauses/#query-terminate-transactions">TERMINATE TRANSACTIONS</a>
  </li>
</ul>
  </li>
  <li class="nav-item" data-depth="1">
    <a class="nav-link nav-item-toggle" href="../../subqueries/">Subqueries</a>
<ul class="nav-list">
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../subqueries/call-subquery/">CALL subqueries</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../subqueries/subqueries-in-transactions/">CALL subqueries in transactions</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../subqueries/existential/">EXISTS subqueries</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../subqueries/count/">COUNT subqueries</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../subqueries/collect/">COLLECT subqueries</a>
  </li>
</ul>
  </li>
  <li class="nav-item" data-depth="1">
    <a class="nav-link nav-item-toggle" href="../../patterns/">Patterns</a>
<ul class="nav-list">
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../patterns/concepts/">Concepts</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../patterns/primer/">Primer</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../patterns/reference/">Syntax and semantics</a>
  </li>
</ul>
  </li>
  <li class="nav-item" data-depth="1">
    <a class="nav-link nav-item-toggle" href="../../values-and-types/">Values and types</a>
<ul class="nav-list">
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../values-and-types/property-structural-constructed/">Property, structural, and constructed values</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../values-and-types/temporal/">Temporal values</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../values-and-types/spatial/">Spatial values</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../values-and-types/working-with-null/">Working with <code>null</code></a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../values-and-types/lists/">Lists</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../values-and-types/maps/">Maps</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../values-and-types/casting-data/">Casting data values</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../values-and-types/type-predicate/">Type predicate expressions</a>
  </li>
</ul>
  </li>
  <li class="nav-item" data-depth="1">
    <a class="nav-link nav-item-toggle" href="../../functions/">Functions</a>
<ul class="nav-list">
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../functions/predicate/">Predicate functions</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../functions/scalar/">Scalar functions</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../functions/aggregating/">Aggregating functions</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../functions/list/">List functions</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../functions/mathematical-numeric/">Mathematical functions - numeric</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../functions/mathematical-logarithmic/">Mathematical functions - logarithmic</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../functions/mathematical-trigonometric/">Mathematical functions - trigonometric</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../functions/string/">String functions</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../functions/temporal/">Temporal functions - instant types</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../functions/temporal/duration/">Temporal functions - duration</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../functions/spatial/">Spatial functions</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../functions/load-csv/">LOAD CSV functions</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../functions/graph/">Graph functions</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../functions/database/">Database functions</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../functions/user-defined/">User-defined functions</a>
  </li>
</ul>
  </li>
  <li class="nav-item" data-depth="1">
    <a class="nav-link" href="../../indexes-for-search-performance/">Indexes for search performance</a>
  </li>
  <li class="nav-item" data-depth="1">
    <a class="nav-link" href="../../indexes-for-full-text-search/">Full-text search index</a>
  </li>
  <li class="nav-item" data-depth="1">
    <a class="nav-link" href="../../indexes-for-vector-search/">Vector search index</a>
  </li>
  <li class="nav-item" data-depth="1">
    <a class="nav-link nav-item-toggle" href="../../constraints/">Constraints</a>
<ul class="nav-list">
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../constraints/syntax/">Syntax</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../constraints/examples/">Examples</a>
  </li>
</ul>
  </li>
  <li class="nav-item" data-depth="1">
    <a class="nav-link nav-item-toggle" href="../../query-tuning/">Query tuning</a>
<ul class="nav-list">
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../query-tuning/query-options/">Cypher query options</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../query-tuning/query-profile/">Profile a query</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../query-tuning/indexes/">The use of indexes</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../query-tuning/basic-example/">Basic query tuning example</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../query-tuning/advanced-example/">Advanced query tuning example</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../query-tuning/using/">Planner hints and the USING keyword</a>
  </li>
</ul>
  </li>
  <li class="nav-item" data-depth="1">
    <a class="nav-link nav-item-toggle" href="../../execution-plans/">Execution plans</a>
<ul class="nav-list">
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../execution-plans/db-hits/">Database hits</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../execution-plans/operator-summary/">Execution plan operators</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../execution-plans/operators/">Execution plan operators in detail</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../execution-plans/shortestpath-planning/">Shortest path planning</a>
  </li>
</ul>
  </li>
  <li class="nav-item" data-depth="1">
    <a class="nav-link nav-item-toggle" href="../../query-caches/">Query caches</a>
<ul class="nav-list">
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../query-caches/unified-query-caches/">Unifying query caches</a>
  </li>
</ul>
  </li>
  <li class="nav-item" data-depth="1">
    <a class="nav-link nav-item-toggle" href="../../administration/">Administration</a>
<ul class="nav-list">
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../administration/databases/">Database management</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../administration/aliases/">Database alias management</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../administration/servers/">Server management</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link nav-item-toggle" href="../../administration/access-control/">Access control</a>
<ul class="nav-list">
  <li class="nav-item" data-depth="3">
    <a class="nav-link" href="../../administration/access-control/manage-users/">Managing users</a>
  </li>
  <li class="nav-item" data-depth="3">
    <a class="nav-link" href="../../administration/access-control/manage-roles/">Managing roles</a>
  </li>
  <li class="nav-item" data-depth="3">
    <a class="nav-link" href="../../administration/access-control/manage-privileges/">Managing privileges</a>
  </li>
  <li class="nav-item" data-depth="3">
    <a class="nav-link" href="../../administration/access-control/built-in-roles/">Built-in roles and privileges</a>
  </li>
  <li class="nav-item" data-depth="3">
    <a class="nav-link" href="../../administration/access-control/privileges-reads/">Read privileges</a>
  </li>
  <li class="nav-item" data-depth="3">
    <a class="nav-link" href="../../administration/access-control/privileges-writes/">Write privileges</a>
  </li>
  <li class="nav-item" data-depth="3">
    <a class="nav-link" href="../../administration/access-control/database-administration/">Database administration</a>
  </li>
  <li class="nav-item" data-depth="3">
    <a class="nav-link" href="../../administration/access-control/dbms-administration/">DBMS administration</a>
  </li>
  <li class="nav-item" data-depth="3">
    <a class="nav-link" href="../../administration/access-control/load-privileges/">Load privileges</a>
  </li>
  <li class="nav-item" data-depth="3">
    <a class="nav-link" href="../../administration/access-control/limitations/">Limitations</a>
  </li>
  <li class="nav-item" data-depth="3">
    <a class="nav-link" href="../../administration/access-control/privileges-immutable/">Immutable privileges</a>
  </li>
</ul>
  </li>
</ul>
  </li>
  <li class="nav-item" data-depth="1">
    <a class="nav-link nav-item-toggle" href="../../syntax/">Syntax</a>
<ul class="nav-list">
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../syntax/parsing/">Parsing</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../syntax/naming/">Naming rules and recommendations</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../syntax/variables/">Variables</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../syntax/reserved/">Reserved keywords</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../syntax/parameters/">Parameters</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../syntax/operators/">Operators</a>
  </li>
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../syntax/comments/">Comments</a>
  </li>
</ul>
  </li>
  <li class="nav-item" data-depth="1">
    <a class="nav-link" href="../../deprecations-additions-removals-compatibility/">Deprecations, additions, and compatibility</a>
  </li>
  <li class="nav-item" data-depth="1">
    <a class="nav-link" href="../../keyword-glossary/">Glossary of keywords</a>
  </li>
  <li class="nav-item" data-depth="1">
    <span class="nav-text nav-item-toggle">Appendix</span>
<ul class="nav-list">
  <li class="nav-item" data-depth="2">
    <a class="nav-link" href="../../styleguide/">Cypher styleguide</a>
  </li>
</ul>
  </li>
</ul>
  </li>
</ul>
  </nav>
</div>
    </div>
  </aside>
</div>
<main class="article">
<div class="toolbar" role="navigation">
  <div class="toolbar-wrapper">
    <button class="nav-toggle" aria-label="Toggle Table of Contents"></button>
    <a href="../../introduction/" class="home-link" aria-label="Go to home page"></a>
    <nav class="breadcrumbs" aria-label="breadcrumbs">
  <ul>
    <li><a href="../../introduction/">Cypher Manual</a></li>
    <li><a href="../">
        Clauses
    </a></li>
    <li><a href="./">
        WHERE
    </a></li>
  </ul>
</nav>
      </div>
</div>

  <div class="content">
<article class="doc">
<div class="sect-header">
<h1 class="page">WHERE</h1>
</div>





<div class="sect1">
<h2 id="where-introduction"><a class="anchor" href="#where-introduction"></a>Introduction</h2>
<div class="sectionbody">
<div class="paragraph">
<p>The <code>WHERE</code> clause is not a clause in its own right&#8201;&#8212;&#8201;rather, it is part of the <code>MATCH</code>, <code>OPTIONAL MATCH</code>, and <code>WITH</code> clauses.</p>
</div>
<div class="paragraph">
<p>When used with <code>MATCH</code> and <code>OPTIONAL MATCH</code>, <code>WHERE</code> adds constraints to the patterns described.
<em>It should not be seen as a filter after the matching is finished.</em></p>
</div>
<div class="paragraph">
<p>In the case of <code>WITH</code>, however, <code>WHERE</code> simply filters the results.</p>
</div>
<div class="paragraph">
<p>In the case of multiple <code>MATCH</code> / <code>OPTIONAL MATCH</code> clauses, the predicate in <code>WHERE</code> is always a part of the patterns in the directly preceding <code>MATCH</code> / <code>OPTIONAL MATCH</code>.
Both results and performance may be impacted if <code>WHERE</code> is put inside the wrong <code>MATCH</code> clause.</p>
</div>
<div class="paragraph">
<p><a href="../../indexes-for-search-performance/" class="xref page">Indexes</a> may be used to optimize queries using <code>WHERE</code> in a variety of cases.</p>
</div>
</div>
</div>
<div class="sect1">
<h2 id="where-example-graph"><a class="anchor" href="#where-example-graph"></a>Example graph</h2>
<div class="sectionbody">
<div class="paragraph">
<p>The following graph is used for the examples below:</p>
</div>
<div class="imageblock middle">
<div class="content">
<img src="../../_images/graph_where_clause.svg" alt="graph where clause" width="600">
</div>
</div>
<div class="paragraph">
<p>To recreate the graph, run the following query in an empty Neo4j database:</p>
</div>
<div class="listingblock test-setup">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">CREATE
(andy:Swedish:Person {name: 'Andy', age: 36, belt: 'white'}),
(timothy:Person {name: 'Timothy', age: 25}),
(peter:Person {name: 'Peter', age: 35, email: 'peter_n@example.com'}),
(andy)-[:KNOWS {since: 2012}]-&gt;(timothy),
(andy)-[:KNOWS {since: 1999}]-&gt;(peter)</code></pre>
</div>
</div>
</div>
</div>
<div class="sect1">
<h2 id="query-where-basic"><a class="anchor" href="#query-where-basic"></a>Basic usage</h2>
<div class="sectionbody">
<div class="sect2">
<h3 id="node-pattern-predicates"><a class="anchor" href="#node-pattern-predicates"></a>Node pattern predicates</h3>
<div class="paragraph">
<p><code>WHERE</code> can appear inside a node pattern in a <code>MATCH</code> clause or a pattern comprehension:</p>
</div>
<div class="listingblock">
<div class="title">Query</div>
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">WITH 30 AS minAge
MATCH (a:Person WHERE a.name = 'Andy')-[:KNOWS]-&gt;(b:Person WHERE b.age &gt; minAge)
RETURN b.name</code></pre>
</div>
</div>
<table class="tableblock frame-all grid-all stretch queryresult">
<caption class="title">Table 1. Result</caption>
<colgroup>
<col style="width: 100%;">
</colgroup>
<thead>
<tr>
<th class="tableblock halign-left valign-top">b.name</th>
</tr>
</thead>
<tbody>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Peter"</code></p></td>
</tr>
</tbody>
<tfoot>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>Rows: 1</code></p></td>
</tr>
</tfoot>
</table>
<div class="paragraph">
<p>When used this way, predicates in <code>WHERE</code> can reference the node variable that the <code>WHERE</code> clause belongs to, but not other elements of the <code>MATCH</code> pattern.</p>
</div>
<div class="paragraph">
<p>The same rule applies to pattern comprehensions:</p>
</div>
<div class="listingblock">
<div class="title">Query</div>
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (a:Person {name: 'Andy'})
RETURN [(a)--&gt;(b WHERE b:Person) | b.name] AS friends</code></pre>
</div>
</div>
<table class="tableblock frame-all grid-all stretch queryresult">
<caption class="title">Table 2. Result</caption>
<colgroup>
<col style="width: 100%;">
</colgroup>
<thead>
<tr>
<th class="tableblock halign-left valign-top">friends</th>
</tr>
</thead>
<tbody>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>["Peter","Timothy"]</code></p></td>
</tr>
</tbody>
<tfoot>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>Rows: 1</code></p></td>
</tr>
</tfoot>
</table>
</div>
<div class="sect2">
<h3 id="boolean-operations"><a class="anchor" href="#boolean-operations"></a>Boolean operations</h3>
<div class="paragraph">
<p>The following boolean operators can be used with the <code>WHERE</code> clause: <code>AND</code>, <code>OR</code>, <code>XOR</code>, and <code>NOT</code>.
For more information on how operators work with <code>null</code>, see the chapter on <a href="../../values-and-types/working-with-null/" class="xref page">Working with null</a>.</p>
</div>
<div class="listingblock">
<div class="title">Query</div>
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (n:Person)
WHERE n.name = 'Peter' XOR (n.age &lt; 30 AND n.name = 'Timothy') OR NOT (n.name = 'Timothy' OR n.name = 'Peter')
RETURN
  n.name AS name,
  n.age AS age
ORDER BY name</code></pre>
</div>
</div>
<table class="tableblock frame-all grid-all stretch queryresult">
<caption class="title">Table 3. Result</caption>
<colgroup>
<col style="width: 50%;">
<col style="width: 50%;">
</colgroup>
<thead>
<tr>
<th class="tableblock halign-left valign-top">name</th>
<th class="tableblock halign-left valign-top">age</th>
</tr>
</thead>
<tbody>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Andy"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>36</code></p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Peter"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>35</code></p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Timothy"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>25</code></p></td>
</tr>
</tbody>
<tfoot>
<tr>
<td class="tableblock halign-left valign-top" colspan="2"><p class="tableblock"><code>Rows: 3</code></p></td>
</tr>
</tfoot>
</table>
</div>
<div class="sect2">
<h3 id="filter-on-node-label"><a class="anchor" href="#filter-on-node-label"></a>Filter on node label</h3>
<div class="paragraph">
<p>To filter nodes by label, write a label predicate after the <code>WHERE</code> keyword using <code>WHERE n:foo</code>:</p>
</div>
<div class="listingblock">
<div class="title">Query</div>
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (n)
WHERE n:Swedish
RETURN n.name, n.age</code></pre>
</div>
</div>
<div class="paragraph">
<p>The <code>name</code> and <code>age</code> values for <code>Andy</code> are returned:</p>
</div>
<table class="tableblock frame-all grid-all stretch queryresult">
<caption class="title">Table 4. Result</caption>
<colgroup>
<col style="width: 50%;">
<col style="width: 50%;">
</colgroup>
<thead>
<tr>
<th class="tableblock halign-left valign-top">n.name</th>
<th class="tableblock halign-left valign-top">n.age</th>
</tr>
</thead>
<tbody>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Andy"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>36</code></p></td>
</tr>
</tbody>
<tfoot>
<tr>
<td class="tableblock halign-left valign-top" colspan="2"><p class="tableblock"><code>Rows: 1</code></p></td>
</tr>
</tfoot>
</table>
</div>
<div class="sect2">
<h3 id="filter-on-node-property"><a class="anchor" href="#filter-on-node-property"></a>Filter on node property</h3>
<div class="paragraph">
<p>To filter on a node property, write your clause after the <code>WHERE</code> keyword:</p>
</div>
<div class="listingblock">
<div class="title">Query</div>
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (n:Person)
WHERE n.age &lt; 30
RETURN n.name, n.age</code></pre>
</div>
</div>
<div class="paragraph">
<p>The <code>name</code> and <code>age</code> values for <code>Timothy</code> are returned because he is less than 30 years of age:</p>
</div>
<table class="tableblock frame-all grid-all stretch queryresult">
<caption class="title">Table 5. Result</caption>
<colgroup>
<col style="width: 50%;">
<col style="width: 50%;">
</colgroup>
<thead>
<tr>
<th class="tableblock halign-left valign-top">n.name</th>
<th class="tableblock halign-left valign-top">n.age</th>
</tr>
</thead>
<tbody>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Timothy"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>25</code></p></td>
</tr>
</tbody>
<tfoot>
<tr>
<td class="tableblock halign-left valign-top" colspan="2"><p class="tableblock"><code>Rows: 1</code></p></td>
</tr>
</tfoot>
</table>
</div>
<div class="sect2">
<h3 id="filter-on-relationship-property"><a class="anchor" href="#filter-on-relationship-property"></a>Filter on relationship property</h3>
<div class="paragraph">
<p>To filter on a relationship property, write your clause after the <code>WHERE</code> keyword:</p>
</div>
<div class="listingblock">
<div class="title">Query</div>
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (n:Person)-[k:KNOWS]-&gt;(f)
WHERE k.since &lt; 2000
RETURN f.name, f.age, f.email</code></pre>
</div>
</div>
<div class="paragraph">
<p>The <code>name</code>, <code>age</code> and <code>email</code> values for <code>Peter</code> are returned because <code>Andy</code> has known him since before 2000:</p>
</div>
<table class="tableblock frame-all grid-all stretch queryresult">
<caption class="title">Table 6. Result</caption>
<colgroup>
<col style="width: 33.3333%;">
<col style="width: 33.3333%;">
<col style="width: 33.3334%;">
</colgroup>
<thead>
<tr>
<th class="tableblock halign-left valign-top">f.name</th>
<th class="tableblock halign-left valign-top">f.age</th>
<th class="tableblock halign-left valign-top">f.email</th>
</tr>
</thead>
<tbody>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Peter"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>35</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"<a href="mailto:peter_n@example.com">peter_n@example.com</a>"</code></p></td>
</tr>
</tbody>
<tfoot>
<tr>
<td class="tableblock halign-left valign-top" colspan="3"><p class="tableblock"><code>Rows: 1</code></p></td>
</tr>
</tfoot>
</table>
</div>
<div class="sect2">
<h3 id="filter-on-dynamic-property"><a class="anchor" href="#filter-on-dynamic-property"></a>Filter on dynamically-computed node property</h3>
<div class="paragraph">
<p>To filter on a property using a dynamically computed name, use square bracket syntax:</p>
</div>
<div class="listingblock">
<div class="title">Query</div>
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">WITH 'AGE' AS propname
MATCH (n:Person)
WHERE n[toLower(propname)] &lt; 30
RETURN n.name, n.age</code></pre>
</div>
</div>
<div class="paragraph">
<p>The <code>name</code> and <code>age</code> values for <code>Timothy</code> are returned because he is less than 30 years of age:</p>
</div>
<table class="tableblock frame-all grid-all stretch queryresult">
<caption class="title">Table 7. Result</caption>
<colgroup>
<col style="width: 50%;">
<col style="width: 50%;">
</colgroup>
<thead>
<tr>
<th class="tableblock halign-left valign-top">n.name</th>
<th class="tableblock halign-left valign-top">n.age</th>
</tr>
</thead>
<tbody>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Timothy"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>25</code></p></td>
</tr>
</tbody>
<tfoot>
<tr>
<td class="tableblock halign-left valign-top" colspan="2"><p class="tableblock"><code>Rows: 1</code></p></td>
</tr>
</tfoot>
</table>
</div>
<div class="sect2">
<h3 id="property-existence-checking"><a class="anchor" href="#property-existence-checking"></a>Property existence checking</h3>
<div class="paragraph">
<p>Use the <code>IS NOT NULL</code> predicate to only include nodes or relationships in which a property exists:</p>
</div>
<div class="listingblock">
<div class="title">Query</div>
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (n:Person)
WHERE n.belt IS NOT NULL
RETURN n.name, n.belt</code></pre>
</div>
</div>
<div class="paragraph">
<p>The <code>name</code> and <code>belt</code> values for <code>Andy</code> are returned because he is the only one with a <code>belt</code> property:</p>
</div>
<table class="tableblock frame-all grid-all stretch queryresult">
<caption class="title">Table 8. Result</caption>
<colgroup>
<col style="width: 50%;">
<col style="width: 50%;">
</colgroup>
<thead>
<tr>
<th class="tableblock halign-left valign-top">n.name</th>
<th class="tableblock halign-left valign-top">n.belt</th>
</tr>
</thead>
<tbody>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Andy"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"white"</code></p></td>
</tr>
</tbody>
<tfoot>
<tr>
<td class="tableblock halign-left valign-top" colspan="2"><p class="tableblock"><code>Rows: 1</code></p></td>
</tr>
</tfoot>
</table>
</div>
<div class="sect2">
<h3 id="usage-with-with-clause"><a class="anchor" href="#usage-with-with-clause"></a>Using <code>WITH</code></h3>
<div class="paragraph">
<p>As <code>WHERE</code> is not considered a clause in its own right, its scope is not limited by a <code>WITH</code> directly before it.</p>
</div>
<div class="listingblock">
<div class="title">Query</div>
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (n:Person)
WITH n.name as name
WHERE n.age = 25
RETURN name</code></pre>
</div>
</div>
<table class="tableblock frame-all grid-all stretch queryresult">
<caption class="title">Table 9. Result</caption>
<colgroup>
<col style="width: 100%;">
</colgroup>
<thead>
<tr>
<th class="tableblock halign-left valign-top">name</th>
</tr>
</thead>
<tbody>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Timothy"</code></p></td>
</tr>
</tbody>
<tfoot>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>Rows: 1</code></p></td>
</tr>
</tfoot>
</table>
<div class="paragraph">
<p>The name for <code>Timothy</code> is returned because the <code>WHERE</code> clause still acts as a filter on the <code>MATCH</code>.
<code>WITH</code> reduces the scope for the rest of the query moving forward.
In this case, <code>name</code> is now the only variable in scope for the <code>RETURN</code> clause.</p>
</div>
</div>
</div>
</div>
<div class="sect1">
<h2 id="query-where-string"><a class="anchor" href="#query-where-string"></a>String matching</h2>
<div class="sectionbody">
<div class="paragraph">
<p>The prefix and suffix of a string can be matched using <code>STARTS WITH</code> and <code>ENDS WITH</code>.
To undertake a substring search (that is, match regardless of the location within a string), use <code>CONTAINS</code>.</p>
</div>
<div class="paragraph">
<p>The matching is <em>case-sensitive</em>.
Attempting to use these operators on values which are not strings will return <code>null</code>.</p>
</div>
<div class="sect2">
<h3 id="match-string-start"><a class="anchor" href="#match-string-start"></a>Prefix string search using <code>STARTS WITH</code></h3>
<div class="paragraph">
<p>The <code>STARTS WITH</code> operator is used to perform case-sensitive matching on the beginning of a string:</p>
</div>
<div class="listingblock">
<div class="title">Query</div>
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (n:Person)
WHERE n.name STARTS WITH 'Pet'
RETURN n.name, n.age</code></pre>
</div>
</div>
<div class="paragraph">
<p>The <code>name</code> and <code>age</code> values for <code>Peter</code> are returned because his name starts with "Pet":</p>
</div>
<table class="tableblock frame-all grid-all stretch queryresult">
<caption class="title">Table 10. Result</caption>
<colgroup>
<col style="width: 50%;">
<col style="width: 50%;">
</colgroup>
<thead>
<tr>
<th class="tableblock halign-left valign-top">n.name</th>
<th class="tableblock halign-left valign-top">n.age</th>
</tr>
</thead>
<tbody>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Peter"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>35</code></p></td>
</tr>
</tbody>
<tfoot>
<tr>
<td class="tableblock halign-left valign-top" colspan="2"><p class="tableblock"><code>Rows: 1</code></p></td>
</tr>
</tfoot>
</table>
</div>
<div class="sect2">
<h3 id="match-string-end"><a class="anchor" href="#match-string-end"></a>Suffix string search using <code>ENDS WITH</code></h3>
<div class="paragraph">
<p>The <code>ENDS WITH</code> operator is used to perform case-sensitive matching on the ending of a string:</p>
</div>
<div class="listingblock">
<div class="title">Query</div>
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (n:Person)
WHERE n.name ENDS WITH 'ter'
RETURN n.name, n.age</code></pre>
</div>
</div>
<div class="paragraph">
<p>The <code>name</code> and <code>age</code> values for <code>Peter</code> are returned because his name ends with "ter":</p>
</div>
<table class="tableblock frame-all grid-all stretch queryresult">
<caption class="title">Table 11. Result</caption>
<colgroup>
<col style="width: 50%;">
<col style="width: 50%;">
</colgroup>
<thead>
<tr>
<th class="tableblock halign-left valign-top">n.name</th>
<th class="tableblock halign-left valign-top">n.age</th>
</tr>
</thead>
<tbody>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Peter"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>35</code></p></td>
</tr>
</tbody>
<tfoot>
<tr>
<td class="tableblock halign-left valign-top" colspan="2"><p class="tableblock"><code>Rows: 1</code></p></td>
</tr>
</tfoot>
</table>
</div>
<div class="sect2">
<h3 id="match-string-contains"><a class="anchor" href="#match-string-contains"></a>Substring search using <code>CONTAINS</code></h3>
<div class="paragraph">
<p>The <code>CONTAINS</code> operator is used to perform case-sensitive matching regardless of location within a string:</p>
</div>
<div class="listingblock">
<div class="title">Query</div>
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (n:Person)
WHERE n.name CONTAINS 'ete'
RETURN n.name, n.age</code></pre>
</div>
</div>
<div class="paragraph">
<p>The <code>name</code> and <code>age</code> for <code>Peter</code> are are returned because his name contains "ete":</p>
</div>
<table class="tableblock frame-all grid-all stretch queryresult">
<caption class="title">Table 12. Result</caption>
<colgroup>
<col style="width: 50%;">
<col style="width: 50%;">
</colgroup>
<thead>
<tr>
<th class="tableblock halign-left valign-top">n.name</th>
<th class="tableblock halign-left valign-top">n.age</th>
</tr>
</thead>
<tbody>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Peter"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>35</code></p></td>
</tr>
</tbody>
<tfoot>
<tr>
<td class="tableblock halign-left valign-top" colspan="2"><p class="tableblock"><code>Rows: 1</code></p></td>
</tr>
</tfoot>
</table>
</div>
<div class="sect2">
<h3 id="match-string-negation"><a class="anchor" href="#match-string-negation"></a>String matching negation</h3>
<div class="paragraph">
<p>Use the <code>NOT</code> keyword to exclude all matches on given string from your result:</p>
</div>
<div class="listingblock">
<div class="title">Query</div>
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (n:Person)
WHERE NOT n.name ENDS WITH 'y'
RETURN n.name, n.age</code></pre>
</div>
</div>
<div class="paragraph">
<p>The <code>name</code> and <code>age</code> values <code>Peter</code> are returned because his name does not end with "y":</p>
</div>
<table class="tableblock frame-all grid-all stretch queryresult">
<caption class="title">Table 13. Result</caption>
<colgroup>
<col style="width: 50%;">
<col style="width: 50%;">
</colgroup>
<thead>
<tr>
<th class="tableblock halign-left valign-top">n.name</th>
<th class="tableblock halign-left valign-top">n.age</th>
</tr>
</thead>
<tbody>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Peter"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>35</code></p></td>
</tr>
</tbody>
<tfoot>
<tr>
<td class="tableblock halign-left valign-top" colspan="2"><p class="tableblock"><code>Rows: 1</code></p></td>
</tr>
</tfoot>
</table>
</div>
</div>
</div>
<div class="sect1">
<h2 id="query-where-regex"><a class="anchor" href="#query-where-regex"></a>Regular expressions</h2>
<div class="sectionbody">
<div class="paragraph">
<p>Cypher<sup>&reg;</sup> supports filtering using regular expressions.
The regular expression syntax is inherited from the <a href="https://docs.oracle.com/en/java/javase/17/docs/api/java.base/java/util/regex/Pattern.html">Java regular expressions</a>.
This includes support for flags that change how strings are matched, including case-insensitive <code>(?i)</code>, multiline <code>(?m)</code>, and dotall <code>(?s)</code>.</p>
</div>
<div class="paragraph">
<p>Flags are given at the beginning of the regular expression.
For an example of a regular expression flag given at the beginning of a pattern, see the <a href="#case-insensitive-regular-expressions">case-insensitive regular expression</a> section.</p>
</div>
<div class="sect2">
<h3 id="matching-using-regular-expressions"><a class="anchor" href="#matching-using-regular-expressions"></a>Matching using regular expressions</h3>
<div class="paragraph">
<p>To match on regular expressions, use <code>=~ 'regexp'</code>:</p>
</div>
<div class="listingblock">
<div class="title">Query</div>
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (n:Person)
WHERE n.name =~ 'Tim.*'
RETURN n.name, n.age</code></pre>
</div>
</div>
<div class="paragraph">
<p>The <code>name</code> and <code>age</code> values for <code>Timothy</code> are returned because his name starts with "Tim".</p>
</div>
<table class="tableblock frame-all grid-all stretch queryresult">
<caption class="title">Table 14. Result</caption>
<colgroup>
<col style="width: 50%;">
<col style="width: 50%;">
</colgroup>
<thead>
<tr>
<th class="tableblock halign-left valign-top">n.name</th>
<th class="tableblock halign-left valign-top">n.age</th>
</tr>
</thead>
<tbody>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Timothy"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>25</code></p></td>
</tr>
</tbody>
<tfoot>
<tr>
<td class="tableblock halign-left valign-top" colspan="2"><p class="tableblock"><code>Rows: 1</code></p></td>
</tr>
</tfoot>
</table>
</div>
<div class="sect2">
<h3 id="escaping-in-regular-expressions"><a class="anchor" href="#escaping-in-regular-expressions"></a>Escaping in regular expressions</h3>
<div class="paragraph">
<p>Characters like <code>.</code> or <code>*</code> have special meaning in a regular expression.
To use these as ordinary characters, without special meaning, escape them.</p>
</div>
<div class="listingblock">
<div class="title">Query</div>
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (n:Person)
WHERE n.email =~ '.*\\.com'
RETURN n.name, n.age, n.email</code></pre>
</div>
</div>
<div class="paragraph">
<p>The <code>name</code>, <code>age</code>, and <code>email</code> values for <code>Peter</code> are returned because his email ends with ".com":</p>
</div>
<table class="tableblock frame-all grid-all stretch queryresult">
<caption class="title">Table 15. Result</caption>
<colgroup>
<col style="width: 33.3333%;">
<col style="width: 33.3333%;">
<col style="width: 33.3334%;">
</colgroup>
<thead>
<tr>
<th class="tableblock halign-left valign-top">n.name</th>
<th class="tableblock halign-left valign-top">n.age</th>
<th class="tableblock halign-left valign-top">n.email</th>
</tr>
</thead>
<tbody>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Peter"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>35</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"<a href="mailto:peter_n@example.com">peter_n@example.com</a>"</code></p></td>
</tr>
</tbody>
<tfoot>
<tr>
<td class="tableblock halign-left valign-top" colspan="3"><p class="tableblock"><code>Rows: 1</code></p></td>
</tr>
</tfoot>
</table>
<div class="paragraph">
<p>Note that the regular expression constructs in
<a href="https://docs.oracle.com/en/java/javase/17/docs/api/java.base/java/util/regex/Pattern.html">Java regular expressions</a>
are applied only after resolving the escaped character sequences in the given
<a href="../../queries/expressions/#expressions-string-literals" class="xref page">string literal</a>.
It is sometimes necessary to add additional backslashes to express regular expression
constructs.
This list clarifies the combination of these two definitions, containing the original escape sequence and the resulting character in the regular expression:</p>
</div>
<table class="tableblock frame-all grid-all stretch">
<colgroup>
<col style="width: 20%;">
<col style="width: 40%;">
<col style="width: 40%;">
</colgroup>
<thead>
<tr>
<th class="tableblock halign-right valign-top">String literal sequence</th>
<th class="tableblock halign-left valign-top">Resulting Regex sequence</th>
<th class="tableblock halign-left valign-top">Regex match</th>
</tr>
</thead>
<tbody>
<tr>
<td class="tableblock halign-right valign-top"><p class="tableblock"><code>\t</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Tab</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Tab</p></td>
</tr>
<tr>
<td class="tableblock halign-right valign-top"><p class="tableblock"><code>\\t</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>\t</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Tab</p></td>
</tr>
<tr>
<td class="tableblock halign-right valign-top"><p class="tableblock"><code>\b</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Backspace</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Backspace</p></td>
</tr>
<tr>
<td class="tableblock halign-right valign-top"><p class="tableblock"><code>\\b</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>\b</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Word boundary</p></td>
</tr>
<tr>
<td class="tableblock halign-right valign-top"><p class="tableblock"><code>\n</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Newline</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">NewLine</p></td>
</tr>
<tr>
<td class="tableblock halign-right valign-top"><p class="tableblock"><code>\\n</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>\n</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Newline</p></td>
</tr>
<tr>
<td class="tableblock halign-right valign-top"><p class="tableblock"><code>\r</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Carriage return</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Carriage return</p></td>
</tr>
<tr>
<td class="tableblock halign-right valign-top"><p class="tableblock"><code>\\r</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>\r</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Carriage return</p></td>
</tr>
<tr>
<td class="tableblock halign-right valign-top"><p class="tableblock"><code>\f</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Form feed</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Form feed</p></td>
</tr>
<tr>
<td class="tableblock halign-right valign-top"><p class="tableblock"><code>\\f</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>\f</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Form feed</p></td>
</tr>
<tr>
<td class="tableblock halign-right valign-top"><p class="tableblock"><code>\'</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Single quote</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Single quote</p></td>
</tr>
<tr>
<td class="tableblock halign-right valign-top"><p class="tableblock"><code>\"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Double quote</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Double quote</p></td>
</tr>
<tr>
<td class="tableblock halign-right valign-top"><p class="tableblock"><code>\\</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Backslash</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Backslash</p></td>
</tr>
<tr>
<td class="tableblock halign-right valign-top"><p class="tableblock"><code>\\\</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>\\</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Backslash</p></td>
</tr>
<tr>
<td class="tableblock halign-right valign-top"><p class="tableblock"><code>\uxxxx</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Unicode UTF-16 code point (4 hex digits must follow the <code>\u</code>)</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Unicode UTF-16 code point (4 hex digits must follow the <code>\u</code>)</p></td>
</tr>
<tr>
<td class="tableblock halign-right valign-top"><p class="tableblock"><code>\\uxxxx</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>\uxxxx</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Unicode UTF-16 code point (4 hex digits must follow the <code>\u</code>)</p></td>
</tr>
</tbody>
</table>
<div class="admonitionblock note">
<table>
<tr>
<td class="icon">
<i class="fa icon-note" title="Note"></i>
</td>
<td class="content">
<div class="paragraph">
<p>Using regular expressions with unsanitized user input makes you vulnerable to Cypher injection.
Consider using <a href="../../syntax/parameters/" class="xref page">parameters</a> instead.</p>
</div>
</td>
</tr>
</table>
</div>
</div>
<div class="sect2">
<h3 id="case-insensitive-regular-expressions"><a class="anchor" href="#case-insensitive-regular-expressions"></a>Case-insensitive regular expressions</h3>
<div class="paragraph">
<p>By pre-pending a regular expression with <code>(?i)</code>, the whole expression becomes case-insensitive:</p>
</div>
<div class="listingblock">
<div class="title">Query</div>
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (n:Person)
WHERE n.name =~ '(?i)AND.*'
RETURN n.name, n.age</code></pre>
</div>
</div>
<div class="paragraph">
<p>The <code>name</code> and <code>age</code> for <code>Andy</code> are returned because his name starts with 'AND' irrespective of casing:</p>
</div>
<table class="tableblock frame-all grid-all stretch queryresult">
<caption class="title">Table 16. Result</caption>
<colgroup>
<col style="width: 50%;">
<col style="width: 50%;">
</colgroup>
<thead>
<tr>
<th class="tableblock halign-left valign-top">n.name</th>
<th class="tableblock halign-left valign-top">n.age</th>
</tr>
</thead>
<tbody>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Andy"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>36</code></p></td>
</tr>
</tbody>
<tfoot>
<tr>
<td class="tableblock halign-left valign-top" colspan="2"><p class="tableblock"><code>Rows: 1</code></p></td>
</tr>
</tfoot>
</table>
</div>
</div>
</div>
<div class="sect1">
<h2 id="query-where-patterns"><a class="anchor" href="#query-where-patterns"></a>Using path patterns in <code>WHERE</code></h2>
<div class="sectionbody">
<div class="sect2">
<h3 id="filter-on-patterns"><a class="anchor" href="#filter-on-patterns"></a>Filter on patterns</h3>
<div class="paragraph">
<p>Patterns are expressions in Cypher, expressions that return a list of paths.
List expressions are also predicates; an empty list represents <code>false</code>, and a non-empty list represents <code>true</code>.</p>
</div>
<div class="paragraph">
<p>Patterns are not only expressions, they are also predicates.
The only limitation to a pattern is that it must be able to express it in a single path.
Unlike <code>MATCH</code>, it is not possible to use commas between multiple paths.
To combine multiple patterns using <code>WHERE</code>, instead use <code>AND</code>.
Note that new variables cannot be introduced.
Although it might look very similar to the <code>MATCH</code> patterns, the <code>WHERE</code> clause is used to eliminate matched paths.
<code>MATCH (a)-[<strong>]&#8594;(b)</code> is very different from <code>WHERE (a)-[</strong>]&#8594;(b)</code>.
The first will produce a path for every path it can find between <code>a</code> and <code>b</code>, whereas the latter will eliminate any matched paths where <code>a</code> and <code>b</code> do not have a directed relationship chain between them.</p>
</div>
<div class="listingblock">
<div class="title">Query</div>
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH
  (timothy:Person {name: 'Timothy'}),
  (other:Person)
WHERE other.name IN ['Andy', 'Peter'] AND (other)--&gt;(timothy)
RETURN other.name, other.age</code></pre>
</div>
</div>
<div class="paragraph">
<p>The <code>name</code> and <code>age</code> values for nodes that have an outgoing relationship to <code>Timothy</code> are returned:</p>
</div>
<table class="tableblock frame-all grid-all stretch queryresult">
<caption class="title">Table 17. Result</caption>
<colgroup>
<col style="width: 50%;">
<col style="width: 50%;">
</colgroup>
<thead>
<tr>
<th class="tableblock halign-left valign-top">other.name</th>
<th class="tableblock halign-left valign-top">other.age</th>
</tr>
</thead>
<tbody>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Andy"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>36</code></p></td>
</tr>
</tbody>
<tfoot>
<tr>
<td class="tableblock halign-left valign-top" colspan="2"><p class="tableblock"><code>Rows: 1</code></p></td>
</tr>
</tfoot>
</table>
</div>
<div class="sect2">
<h3 id="filter-on-patterns-using-not"><a class="anchor" href="#filter-on-patterns-using-not"></a>Filter on patterns using <code>NOT</code></h3>
<div class="paragraph">
<p>The <code>NOT</code> operator can be used to exclude a pattern:</p>
</div>
<div class="listingblock">
<div class="title">Query</div>
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH
  (person:Person),
  (peter:Person {name: 'Peter'})
WHERE NOT (person)--&gt;(peter)
RETURN person.name, person.age</code></pre>
</div>
</div>
<div class="paragraph">
<p>The <code>name</code> and <code>age</code> values for nodes that do not have an outgoing relationship to <code>Peter</code> are returned:</p>
</div>
<table class="tableblock frame-all grid-all stretch queryresult">
<caption class="title">Table 18. Result</caption>
<colgroup>
<col style="width: 50%;">
<col style="width: 50%;">
</colgroup>
<thead>
<tr>
<th class="tableblock halign-left valign-top">person.name</th>
<th class="tableblock halign-left valign-top">person.age</th>
</tr>
</thead>
<tbody>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Timothy"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>25</code></p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Peter"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>35</code></p></td>
</tr>
</tbody>
<tfoot>
<tr>
<td class="tableblock halign-left valign-top" colspan="2"><p class="tableblock"><code>Rows: 2</code></p></td>
</tr>
</tfoot>
</table>
</div>
<div class="sect2">
<h3 id="filter-on-patterns-with-properties"><a class="anchor" href="#filter-on-patterns-with-properties"></a>Filter on patterns with properties</h3>
<div class="paragraph">
<p>Properties can also be added to patterns:</p>
</div>
<div class="listingblock">
<div class="title">Query</div>
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (n:Person)
WHERE (n)-[:KNOWS]-({name: 'Timothy'})
RETURN n.name, n.age</code></pre>
</div>
</div>
<div class="paragraph">
<p>The <code>name</code> and <code>age</code> values are returned for nodes that have a relationship with the type <code>KNOWS</code> connected to <code>Timothy</code>:</p>
</div>
<table class="tableblock frame-all grid-all stretch queryresult">
<caption class="title">Table 19. Result</caption>
<colgroup>
<col style="width: 50%;">
<col style="width: 50%;">
</colgroup>
<thead>
<tr>
<th class="tableblock halign-left valign-top">n.name</th>
<th class="tableblock halign-left valign-top">n.age</th>
</tr>
</thead>
<tbody>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Andy"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>36</code></p></td>
</tr>
</tbody>
<tfoot>
<tr>
<td class="tableblock halign-left valign-top" colspan="2"><p class="tableblock"><code>Rows: 1</code></p></td>
</tr>
</tfoot>
</table>
</div>
<div class="sect2">
<h3 id="filter-on-relationship-type"><a class="anchor" href="#filter-on-relationship-type"></a>Filter on relationship type</h3>
<div class="paragraph">
<p>You can put the exact relationship type in the <code>MATCH</code> pattern,
It also possible to do more advanced filtering on the relationship type by using the special property <code>type</code> to compare the type with something else.
In this example, the query does a regular expression comparison with the name of the relationship type:</p>
</div>
<div class="listingblock">
<div class="title">Query</div>
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (n:Person)-[r]-&gt;()
WHERE n.name='Andy' AND type(r) =~ 'K.*'
RETURN type(r), r.since</code></pre>
</div>
</div>
<div class="paragraph">
<p>This returns all relationships having a type whose name starts with 'K':</p>
</div>
<table class="tableblock frame-all grid-all stretch queryresult">
<caption class="title">Table 20. Result</caption>
<colgroup>
<col style="width: 50%;">
<col style="width: 50%;">
</colgroup>
<thead>
<tr>
<th class="tableblock halign-left valign-top">type(r)</th>
<th class="tableblock halign-left valign-top">r.since</th>
</tr>
</thead>
<tbody>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"KNOWS"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>1999</code></p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"KNOWS"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>2012</code></p></td>
</tr>
</tbody>
<tfoot>
<tr>
<td class="tableblock halign-left valign-top" colspan="2"><p class="tableblock"><code>Rows: 2</code></p></td>
</tr>
</tfoot>
</table>
</div>
</div>
</div>
<div class="sect1">
<h2 id="query-where-lists"><a class="anchor" href="#query-where-lists"></a>Lists</h2>
<div class="sectionbody">
<div class="sect2">
<h3 id="where-in-operator"><a class="anchor" href="#where-in-operator"></a><code>IN</code> operator</h3>
<div class="paragraph">
<p>To check if an element exists in a list, use the <code>IN</code> operator.
The below query checks whether a property exists in a literal list:</p>
</div>
<div class="listingblock">
<div class="title">Query</div>
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (a:Person)
WHERE a.name IN ['Peter', 'Timothy']
RETURN a.name, a.age</code></pre>
</div>
</div>
<table class="tableblock frame-all grid-all stretch queryresult">
<caption class="title">Table 21. Result</caption>
<colgroup>
<col style="width: 50%;">
<col style="width: 50%;">
</colgroup>
<thead>
<tr>
<th class="tableblock halign-left valign-top">a.name</th>
<th class="tableblock halign-left valign-top">a.age</th>
</tr>
</thead>
<tbody>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Timothy"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>25</code></p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Peter"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>35</code></p></td>
</tr>
</tbody>
<tfoot>
<tr>
<td class="tableblock halign-left valign-top" colspan="2"><p class="tableblock"><code>Rows: 2</code></p></td>
</tr>
</tfoot>
</table>
</div>
</div>
</div>
<div class="sect1">
<h2 id="missing-properties-and-values"><a class="anchor" href="#missing-properties-and-values"></a>Missing properties and values</h2>
<div class="sectionbody">
<div class="sect2">
<h3 id="default-to-false-missing-property"><a class="anchor" href="#default-to-false-missing-property"></a>Default to <code>false</code> if property is missing</h3>
<div class="paragraph">
<p>As missing properties evaluate to <code>null</code>, the comparison in the example will evaluate to <code>false</code> for nodes without the <code>belt</code> property:</p>
</div>
<div class="listingblock">
<div class="title">Query</div>
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (n:Person)
WHERE n.belt = 'white'
RETURN n.name, n.age, n.belt</code></pre>
</div>
</div>
<div class="paragraph">
<p>Only the <code>name</code>, <code>age</code>, and <code>belt</code> values of nodes with white belts are returned:</p>
</div>
<table class="tableblock frame-all grid-all stretch queryresult">
<caption class="title">Table 22. Result</caption>
<colgroup>
<col style="width: 33.3333%;">
<col style="width: 33.3333%;">
<col style="width: 33.3334%;">
</colgroup>
<thead>
<tr>
<th class="tableblock halign-left valign-top">n.name</th>
<th class="tableblock halign-left valign-top">n.age</th>
<th class="tableblock halign-left valign-top">n.belt</th>
</tr>
</thead>
<tbody>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Andy"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>36</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"white"</code></p></td>
</tr>
</tbody>
<tfoot>
<tr>
<td class="tableblock halign-left valign-top" colspan="3"><p class="tableblock"><code>Rows: 1</code></p></td>
</tr>
</tfoot>
</table>
</div>
<div class="sect2">
<h3 id="default-to-true-missing-property"><a class="anchor" href="#default-to-true-missing-property"></a>Default to <code>true</code> if property is missing</h3>
<div class="paragraph">
<p>To compare node or relationship properties against missing properties, use the <code>IS NULL</code> operator:</p>
</div>
<div class="listingblock">
<div class="title">Query</div>
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (n:Person)
WHERE n.belt = 'white' OR n.belt IS NULL
RETURN n.name, n.age, n.belt
ORDER BY n.name</code></pre>
</div>
</div>
<div class="paragraph">
<p>This returns all values for all nodes, even those without the <code>belt</code> property:</p>
</div>
<table class="tableblock frame-all grid-all stretch queryresult">
<caption class="title">Table 23. Result</caption>
<colgroup>
<col style="width: 33.3333%;">
<col style="width: 33.3333%;">
<col style="width: 33.3334%;">
</colgroup>
<thead>
<tr>
<th class="tableblock halign-left valign-top">n.name</th>
<th class="tableblock halign-left valign-top">n.age</th>
<th class="tableblock halign-left valign-top">n.belt</th>
</tr>
</thead>
<tbody>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Andy"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>36</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"white"</code></p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Peter"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>35</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>&lt;null&gt;</code></p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Timothy"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>25</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>&lt;null&gt;</code></p></td>
</tr>
</tbody>
<tfoot>
<tr>
<td class="tableblock halign-left valign-top" colspan="3"><p class="tableblock"><code>Rows: 3</code></p></td>
</tr>
</tfoot>
</table>
</div>
<div class="sect2">
<h3 id="filter-on-null"><a class="anchor" href="#filter-on-null"></a>Filter on <code>null</code></h3>
<div class="paragraph">
<p>To test if a value or variable is <code>null</code>, use the <code>IS NULL</code> operator.
To test if a value or variable is not <code>null</code>, use the <code>IS NOT NULL</code> operator
<code>NOT(IS NULL x)</code> also works.</p>
</div>
<div class="listingblock">
<div class="title">Query</div>
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (person:Person)
WHERE person.name = 'Peter' AND person.belt IS NULL
RETURN person.name, person.age, person.belt</code></pre>
</div>
</div>
<div class="paragraph">
<p>The <code>name</code> and <code>age</code> values for nodes that have name <code>Peter</code> but no <code>belt</code> property are returned:</p>
</div>
<table class="tableblock frame-all grid-all stretch queryresult">
<caption class="title">Table 24. Result</caption>
<colgroup>
<col style="width: 33.3333%;">
<col style="width: 33.3333%;">
<col style="width: 33.3334%;">
</colgroup>
<thead>
<tr>
<th class="tableblock halign-left valign-top">person.name</th>
<th class="tableblock halign-left valign-top">person.age</th>
<th class="tableblock halign-left valign-top">person.belt</th>
</tr>
</thead>
<tbody>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Peter"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>35</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>&lt;null&gt;</code></p></td>
</tr>
</tbody>
<tfoot>
<tr>
<td class="tableblock halign-left valign-top" colspan="3"><p class="tableblock"><code>Rows: 1</code></p></td>
</tr>
</tfoot>
</table>
</div>
</div>
</div>
<div class="sect1">
<h2 id="query-where-ranges"><a class="anchor" href="#query-where-ranges"></a>Using ranges</h2>
<div class="sectionbody">
<div class="sect2">
<h3 id="simple-range"><a class="anchor" href="#simple-range"></a>Simple range</h3>
<div class="paragraph">
<p>To check whether an element exists within a specific range, use the inequality operators <code>&lt;</code>, <code>&#8656;</code>, <code>&gt;=</code>, <code>&gt;</code>:</p>
</div>
<div class="listingblock">
<div class="title">Query</div>
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (a:Person)
WHERE a.name &gt;= 'Peter'
RETURN a.name, a.age</code></pre>
</div>
</div>
<div class="paragraph">
<p>The <code>name</code> and <code>age</code> values of nodes having a <code>name</code> property lexicographically (i.e. using the dictionary order) greater than or equal to <code>Peter</code> are returned:</p>
</div>
<table class="tableblock frame-all grid-all stretch queryresult">
<caption class="title">Table 25. Result</caption>
<colgroup>
<col style="width: 50%;">
<col style="width: 50%;">
</colgroup>
<thead>
<tr>
<th class="tableblock halign-left valign-top">a.name</th>
<th class="tableblock halign-left valign-top">a.age</th>
</tr>
</thead>
<tbody>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Timothy"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>25</code></p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Peter"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>35</code></p></td>
</tr>
</tbody>
<tfoot>
<tr>
<td class="tableblock halign-left valign-top" colspan="2"><p class="tableblock"><code>Rows: 2</code></p></td>
</tr>
</tfoot>
</table>
</div>
<div class="sect2">
<h3 id="composite-range"><a class="anchor" href="#composite-range"></a>Composite range</h3>
<div class="paragraph">
<p>Several inequalities can be used to construct a range:</p>
</div>
<div class="listingblock">
<div class="title">Query</div>
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">MATCH (a:Person)
WHERE a.name &gt; 'Andy' AND a.name &lt; 'Timothy'
RETURN a.name, a.age</code></pre>
</div>
</div>
<div class="paragraph">
<p>The <code>name</code> and <code>age</code> values of nodes having a <code>name</code> property lexicographically between <code>Andy</code> and <code>Timothy</code> are returned:</p>
</div>
<table class="tableblock frame-all grid-all stretch queryresult">
<caption class="title">Table 26. Result</caption>
<colgroup>
<col style="width: 50%;">
<col style="width: 50%;">
</colgroup>
<thead>
<tr>
<th class="tableblock halign-left valign-top">a.name</th>
<th class="tableblock halign-left valign-top">a.age</th>
</tr>
</thead>
<tbody>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>"Peter"</code></p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>35</code></p></td>
</tr>
</tbody>
<tfoot>
<tr>
<td class="tableblock halign-left valign-top" colspan="2"><p class="tableblock"><code>Rows: 1</code></p></td>
</tr>
</tfoot>
</table>
</div>
</div>
</div>
<div class="sect1">
<h2 id="pattern-element-predicates"><a class="anchor" href="#pattern-element-predicates"></a>Pattern element predicates</h2>
<div class="sectionbody">
<div class="paragraph">
<p><code>WHERE</code> clauses can be added to pattern elements in order to specify additional constraints:</p>
</div>
<div class="sect2">
<h3 id="relationship-pattern-predicates"><a class="anchor" href="#relationship-pattern-predicates"></a>Relationship pattern predicates</h3>
<div class="paragraph">
<p><code>WHERE</code> can also appear inside a relationship pattern in a <code>MATCH</code> clause:</p>
</div>
<div class="listingblock">
<div class="title">Query</div>
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">WITH 2000 AS minYear
MATCH (a:Person)-[r:KNOWS WHERE r.since &lt; minYear]-&gt;(b:Person)
RETURN r.since</code></pre>
</div>
</div>
<table class="tableblock frame-all grid-all stretch queryresult">
<caption class="title">Table 27. Result</caption>
<colgroup>
<col style="width: 100%;">
</colgroup>
<thead>
<tr>
<th class="tableblock halign-left valign-top">r.since</th>
</tr>
</thead>
<tbody>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>1999</code></p></td>
</tr>
</tbody>
<tfoot>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>Rows: 1</code></p></td>
</tr>
</tfoot>
</table>
<div class="paragraph">
<p>However, it cannot be used inside of variable length relationships, as this would lead to an error.
For example:</p>
</div>
<div class="listingblock test-fail">
<div class="title">Query</div>
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">WITH 2000 AS minYear
MATCH (a:Person)-[r:KNOWS*1..3 WHERE r.since &gt; b.yearOfBirth]-&gt;(b:Person)
RETURN r.since</code></pre>
</div>
</div>
<div class="listingblock">
<div class="title">Error message</div>
<div class="content">
<pre class="highlightjs highlight"><code class="language-output hljs" data-lang="output">Relationship pattern predicates are not supported for variable-length relationships.</code></pre>
</div>
</div>
<div class="paragraph">
<p>Putting predicates inside a relationship pattern can help with readability.
Note that it is strictly equivalent to using a standalone <code>WHERE</code> sub-clause.</p>
</div>
<div class="listingblock">
<div class="title">Query</div>
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">WITH 2000 AS minYear
MATCH (a:Person)-[r:KNOWS]-&gt;(b:Person)
WHERE r.since &lt; minYear
RETURN r.since</code></pre>
</div>
</div>
<table class="tableblock frame-all grid-all stretch queryresult">
<caption class="title">Table 28. Result</caption>
<colgroup>
<col style="width: 100%;">
</colgroup>
<thead>
<tr>
<th class="tableblock halign-left valign-top">r.since</th>
</tr>
</thead>
<tbody>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>1999</code></p></td>
</tr>
</tbody>
<tfoot>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>Rows: 1</code></p></td>
</tr>
</tfoot>
</table>
<div class="paragraph">
<p>Relationship pattern predicates can also be used inside pattern comprehensions, where the same caveats apply:</p>
</div>
<div class="listingblock">
<div class="title">Query</div>
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">WITH 2000 AS minYear
MATCH (a:Person {name: 'Andy'})
RETURN [(a)-[r:KNOWS WHERE r.since &lt; minYear]-&gt;(b:Person) | r.since] AS years</code></pre>
</div>
</div>
<table class="tableblock frame-all grid-all stretch queryresult">
<caption class="title">Table 29. Result</caption>
<colgroup>
<col style="width: 100%;">
</colgroup>
<thead>
<tr>
<th class="tableblock halign-left valign-top">years</th>
</tr>
</thead>
<tbody>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>[1999]</code></p></td>
</tr>
</tbody>
<tfoot>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock"><code>Rows: 1</code></p></td>
</tr>
</tfoot>
</table>
</div>
</div>
</div>
<nav class="pagination">
  <span class="prev"><a href="../unwind/">UNWIND</a></span>

  <span class="next"><a href="../order-by/">ORDER BY</a></span>
</nav>
    <div class="feedback">
    <div class="header question">
        <p><strong>Was this page helpful?</strong></p>

        <svg width="22px" height="22px" viewBox="0 0 22 22" role="button" class="no" aria-label="No, this page isn't helpful">
            <path
                d="M6.25,15.8333333 C6.25,13.7622655 7.92893219,12.0833333 10,12.0833333 C12.0710678,12.0833333 13.75,13.7622655 13.75,15.8333333"
                ></path>
            <circle  cx="10" cy="10" r="9.58333333"></circle>
            <path
                d="M12.5,4.58333333 C12.8934466,4.05873783 13.5109223,3.75 14.1666667,3.75 C14.822411,3.75 15.4398867,4.05873783 15.8333333,4.58333333"
                ></path>
            <line x1="4.58333333" y1="7.91666667" x2="7.08333333" y2="7.91666667" ></line>
            <path
                d="M7.08333333,8.54166667 C6.96827401,8.54166667 6.875,8.44839266 6.875,8.33333333 C6.875,8.21827401 6.96827401,8.125 7.08333333,8.125 C7.19839266,8.125 7.29166667,8.21827401 7.29166667,8.33333333 C7.29166667,8.44839266 7.19839266,8.54166667 7.08333333,8.54166667"
                ></path>
            <line x1="12.9166667" y1="7.91666667" x2="15.4166667" y2="7.91666667" ></line>
            <path
                d="M15.4166667,8.54166667 C15.3016073,8.54166667 15.2083333,8.44839266 15.2083333,8.33333333 C15.2083333,8.21827401 15.3016073,8.125 15.4166667,8.125 C15.531726,8.125 15.625,8.21827401 15.625,8.33333333 C15.625,8.44839266 15.531726,8.54166667 15.4166667,8.54166667"
                ></path>
            <path
                d="M4.16666667,4.58333333 C4.5601133,4.05873783 5.17758895,3.75 5.83333333,3.75 C6.48907772,3.75 7.10655337,4.05873783 7.5,4.58333333"
                ></path>
        </svg>

        <svg width="22px" height="22px" viewBox="0 0 22 22" role="button" class="yes" aria-label="Yes, this page is helpful">
            <circle  cx="10" cy="10" r="9.58333333"></circle>
            <path
                d="M5.41666667,8.125 C5.53172599,8.125 5.625,8.21827401 5.625,8.33333333 C5.625,8.44839266 5.53172599,8.54166667 5.41666667,8.54166667 C5.30160734,8.54166667 5.20833333,8.44839266 5.20833333,8.33333333 C5.20833333,8.21827401 5.30160734,8.125 5.41666667,8.125"
                ></path>
            <path
                d="M14.5833333,8.125 C14.468274,8.125 14.375,8.21827401 14.375,8.33333333 C14.375,8.44839266 14.468274,8.54166667 14.5833333,8.54166667 C14.6983927,8.54166667 14.7916667,8.44839266 14.7916667,8.33333333 C14.7916667,8.21827401 14.6983927,8.125 14.5833333,8.125"
                ></path>
            <path
                d="M13.2275,12.9166657 C13.4853075,12.9162808 13.7287776,13.035241 13.8869095,13.2388563 C14.0450415,13.4424715 14.1000278,13.7078123 14.0358333,13.9575 C13.562901,15.7999679 11.9021969,17.0882321 10,17.0882321 C8.09780311,17.0882321 6.43709903,15.7999679 5.96416667,13.9575 C5.89997223,13.7078123 5.95495852,13.4424715 6.11309045,13.2388563 C6.27122239,13.035241 6.51469246,12.9162808 6.7725,12.9166657 L13.2275,12.9166657 Z"
                ></path>
        </svg>
    </div>


</div></article>
<aside class="toc sidebar" data-title="Contents"
  data-levels="2">
  <div class="toc-menu">
    <div class="toc-menu-placeholder"></div>

      </div>
  </aside>  </div>
</main>
</div>
<footer class="footer">
  <div class="wrapper">
  <div class="column">
    <div class="logo-footer"></div>
    <p> <span id="footer-copyright-year">2023</span> Neo4j, Inc.<br>
      <a href="https://neo4j.com/terms/">Terms</a> | <a href="https://neo4j.com/privacy-policy/">Privacy </a> | <a href="https://neo4j.com/sitemap/">Sitemap</a></p>
    <p>Neo4j<sup></sup>, Neo Technology<sup></sup>, Cypher<sup></sup>, Neo4j<sup></sup> Bloom<sup></sup> and
      Neo4j<sup></sup> Aura<sup></sup> are registered trademarks
      of Neo4j, Inc. All other marks are owned by their respective companies.</p>
  </div>

  <div class="column">
    <h2><a href="https://neo4j.com/contact-us/?ref=footer">Contact Us </a></h2>
    <p>US: 1-855-636-4532<br>
      Sweden +46 171 480 113<br>
      UK: +44 20 3868 3223<br>
      France: +33 (0) 1 88 46 13 20<br>
      <!--Germany: +49 (0)89 26204 6300</p>-->
    </p>
  </div>
  <div class="column links">
    <h2>Learn</h2>
    <ul>
      <li><i class="fa fa-wrench" aria-hidden="true"></i> <a rel="noopener" href="https://neo4j.com/sandbox/?ref=developer-footer">Sandbox</a></li>
      <li><i class="fa fa-comments-o" aria-hidden="true"></i> <a rel="noopener" href="https://community.neo4j.com?ref=developer-footer" target="_blank">Neo4j Community Site</a></li>
      <li><i class="fa fa-book" aria-hidden="true"></i> <a rel="noopener" href="https://medium.com/neo4j" target="_blank">Neo4j Developer Blog</a></li>
      <li><i class="fa fa-youtube" aria-hidden="true"></i> <a rel="noopener" href="https://www.youtube.com/neo4j" target="_blank">Neo4j Videos</a></li>
      <li><i class="fa fa-graduation-cap" aria-hidden="true"></i> <a rel="noopener" href="https://neo4j.com/graphacademy/?ref=developer-footer">GraphAcademy</a></li>
      <li><i class="fa fa-flask" aria-hidden="true"></i> <a href="https://neo4j.com/labs/?ref=developer-footer">Neo4j Labs</a></li>
    </ul>
  </div>
  <div class="column links">
    <h2>Social</h2>
    <ul>
      <li><i class="fa fa-twitter" aria-hidden="true"></i> <a rel="noopener" href="https://twitter.com/neo4j" target="_blank">Twitter</a></li>
      <li><i class="fa fa-meetup" aria-hidden="true"></i> <a rel="noopener" href="https://www.meetup.com/Neo4j-Online-Meetup/" target="_blank">Meetups</a></li>
      <li><i class="fa fa-github" aria-hidden="true"></i> <a rel="noopener" href="https://github.com/neo4j/neo4j" target="_blank">Github</a></li>
      <li><i class="fa fa-stack-overflow" aria-hidden="true"></i> <a rel="noopener" href="https://stackoverflow.com/questions/tagged/neo4j" target="_blank">Stack Overflow</a></li>

      <li class="speaker-program"><a href="https://docs.google.com/forms/d/e/1FAIpQLSdEcNnMruES5iwvOVYovmS1D_P1ZL_HdUOitFrwrvruv5PZvA/viewform">Want to Speak?</a></li>
    </ul>
  </div>
</div>
</footer>

  <script src="../../../../assets/js/vendor/auth0.js"></script>
  <script src="../../../../assets/js/site.js"></script>
  <script async src="../../../../assets/js/vendor/highlight.js"></script>
  <script async src="../../../../assets/js/vendor/image-zoom.js"></script>


<div id="neo4j-algolia-search-v2"></div>
<script src="https://neo4j.com/wp-content/themes/neo4jweb/assets/neo4j-react-modules-assets/search-preact/chunkless/bundle.js"></script>
<script src="https://neo4j.com/wp-content/themes/neo4jweb/assets/neo4j-react-modules-assets/search-preact/chunkless/polyfill.js"></script>
<script>window.algoliaSearchOptions = {indexName: "docs",placeholder: "Search Documentation",template: "docs"}</script>  </body>
</html>
